{
    "version": "https://jsonfeed.org/version/1",
    "title": "The Generation Z Blog",
    "description": "",
    "home_page_url": "https://blog.thegenz.org",
    "feed_url": "https://blog.thegenz.org/feed.json",
    "user_comment": "",
    "icon": "https://blog.thegenz.org/media/website/gen-z-logo-refined.png",
    "author": {
        "name": "Ishan Vepa"
    },
    "items": [
        {
            "id": "https://blog.thegenz.org/hispanics-can-also-be-racist-heres-why.html",
            "url": "https://blog.thegenz.org/hispanics-can-also-be-racist-heres-why.html",
            "title": "Hispanics Can Also Be Racist - Here&#x27;s Why",
            "summary": "This summer has seen a lot more political and economic tension than ever before in most of our lifetimes. Racism has always been a point of discussion in the United States, especially in a post-Civil Rights Movement era. However, growing up in South Florida has&hellip;",
            "content_html": "<p><span style=\"font-weight: 400;\">This summer has seen a lot more political and economic tension than ever before in most of our lifetimes. Racism has always been a point of discussion in the United States, especially in a post-Civil Rights Movement era. </span></p>\n<p class=\"msg msg--highlight \"><em><strong>However, growing up in South Florida has always gotten me to wonder how racism is handled in other parts of the world, specifically in Latin America.</strong></em></p>\n<p><span style=\"font-weight: 400;\">Perhaps we should start with some history for context. In the early 16th century, the conquistadors landed in the Americas, following Columbus. Their expeditions were pure conquest -- finding land and resources for Spain. Their foreign germs murdered 90% of the native populations and what was left were either chased off, converted to Christianity, enslaved by the Spanish, or a combination of any of these. This could be where racism in Latin America truly started, but there is a key difference: the Spanish conquered for the sake of conquering. The argument could be made that there was hardly real racial motivation for colonizing the Americas, but the argument can be made for the opposite. However, by 1502, African slaves were already in the Caribbean. </span></p>\n<p class=\"msg msg--highlight \"><em><strong>This is, arguably, where the true racism began in colonial Latin America.</strong></em></p>\n<p><span style=\"font-weight: 400;\">While indigenous people were enslaved due to conquest, African slaves were a part of the Trans-Atlantic trade system -- also famously called the Colombian Exchange -- and so now the conquistadors found themselves with a question: What will the social hierarchy be? You have ethnocentric Europeans with two different kinds of enslaved peoples. The </span><i><span style=\"font-weight: 400;\">casta </span></i><span style=\"font-weight: 400;\">system that the Spanish developed was as follows, roughly: with the </span><i><span style=\"font-weight: 400;\">peninsulares </span></i><span style=\"font-weight: 400;\">at the top (white Europeans from the Iberian peninsula), </span><i><span style=\"font-weight: 400;\">creoles</span></i><span style=\"font-weight: 400;\"> just under (white Europeans born in the Americas), mestizos and mulattos, followed by indigenous people, and then black slaves all the way at the bottom -- because to the white conquistador, enslaved Africans were lesser than everyone. This was due to a combination of the notion of blood purity and racial segregation. </span></p>\n<p><span style=\"font-weight: 400;\">This system of both political, economic, and social hierarchy is most probably the reason for modern-day racism in Latin America. Unlike in the United States, racism in Latin America is based on social and economic class. This may sound similar to racism in the U.S., but in Latin America: if you’re poor, then you’re black. In the United States, racism is often the opposite: if you’re black, then you must be poor. According to an article from the American Quarterly, “</span><span style=\"font-weight: 400;\">As early as 1944, Alejandro Lipschutz, a Chilean anthropologist, coined the idea of Latin America as a ‘pigmentocracy’ -- where the region’s social hierarchies are ethnic or color-based. However, that idea was largely ignored until recently, when research using new census data on racial identification began to document racial inequalities. These studies generally show that Afro-descendant and Indigenous people occupy the lowest rungs on the income, educational and occupational ladders across Latin America.”</span><span style=\"font-weight: 400;\"> But because Latin America as a whole is not the wealthiest of continents, funding and money are often pushed towards other projects. </span></p>\n<p><span style=\"font-weight: 400;\">The social aspect of it is also a factor because while in the United States, “negro” is compared to the n-word, but in Latin America, it is used a fond version of “homie” for people with darker skin. To us in the U.S., this appears to be racist. But in Latin America, oftentimes it’s not used as such. Its connotations depend entirely on the context. “Negrita(/o)” is used as a fond pet name for friends or family with dark skin, even if they’re not black. At the same time, it can be used as a slur as bad as the n-word when thrown around with hate behind it. </span></p>\n<p class=\"msg msg--highlight \"><em><strong>Because of all of this, racism is often overlooked. </strong></em></p>\n<p><span style=\"font-weight: 400;\">However, now this poses the question: how does this racism manifest itself in immigrants who come to the United States? It’s quite an interesting phenomena because here, Hispanics are no longer the majority; they’re the minority. Here in the U.S., they are often greeted with racism towards them, so why are some Hispanics still racist towards other minorities? By all logic, they shouldn’t. </span></p>\n<p class=\"msg msg--highlight \"><em><strong>They’re on the same level as them; they’re all facing the same racism and oppression. So, why?  </strong></em></p>\n<p><span style=\"font-weight: 400;\">The answer is very complicated. For one, there is the notion of a sort of “protection.” Latinos are often encouraged to either marry people who are lighter skin than them or marry white people. Marrying lighter skin people has the connotations that you marry rich and that you’re gaining more “protection” from racism. It’s a practice of erasing culture and heritage for the sake of wanting -- what some would call -- a better life. This is the same reason why some Hispanics parents refuse to teach Spanish to their kids -- so that those kids don’t get picked on or have to experience racism like their parents did. </span></p>\n<p><span style=\"font-weight: 400;\">There is also, however, a paradoxical feeling of superiority that leads to racism towards other minorities. This is mainly rooted in stereotypes portrayed in the United States that Hispanics families sometimes believe, such as how black people are called “thugs.” This reinforces the classist racism of Latin America, so the line between “poor therefore black” and “black therefore poor” is extremely blurred.</span></p>\n<p><span style=\"font-weight: 400;\">So hopefully this has provided some insight on how racism manifests itself in different parts of the world, but also how it manifests itself when it is in the United States. </span></p>\n<hr>\n<p class=\"align-center\"><em>Citations</em></p>\n<p><a href=\"https://www.encyclopedia.com/science/encyclopedias-almanacs-transcripts-and-maps/impact-european-diseases-native-americans\"><span style=\"font-weight: 400;\">https://www.encyclopedia.com/science/encyclopedias-almanacs-transcripts-and-maps/impact-european-diseases-native-americans</span></a></p>\n<p><a href=\"https://study.com/academy/lesson/the-spanish-casta-system-definition-significance.html\"><span style=\"font-weight: 400;\">https://study.com/academy/lesson/the-spanish-casta-system-definition-significance.html</span></a></p>\n<p><a href=\"https://nativeheritageproject.com/2013/06/15/las-castas-spanish-racial-classifications/\"><span style=\"font-weight: 400;\">https://nativeheritageproject.com/2013/06/15/las-castas-spanish-racial-classifications/</span></a></p>\n<p><a href=\"https://www.americasquarterly.org/article/the-effects-of-skin-color-in-the-americas/\"><span style=\"font-weight: 400;\">https://www.americasquarterly.org/article/the-effects-of-skin-color-in-the-americas/</span></a></p>",
            "image": "https://blog.thegenz.org/media/posts/58/Landing_of_Columbus_.jpg",
            "author": {
                "name": "Ishan Vepa"
            },
            "tags": [
                   "#society",
                   "#generations",
                   "#culture",
                   "#community",
                   "#advocacy"
            ],
            "date_published": "2021-02-23T08:56:11-05:00",
            "date_modified": "2021-02-23T09:21:24-05:00"
        },
        {
            "id": "https://blog.thegenz.org/why-should-we-care-about-space.html",
            "url": "https://blog.thegenz.org/why-should-we-care-about-space.html",
            "title": "Why should We Care About Space?",
            "summary": "Space is a wondrous place where we can unlock so many secrets of this reality we live in. Many people think that space travel isn’t important or that the rich are the only ones trying to figure out how to travel since they’ve destroyed Earth&hellip;",
            "content_html": "<p class=\"msg msg--highlight \"><span style=\"font-weight: 400;\"><strong><em>Space is a wondrous place where we can unlock so many secrets of this reality we live in. </em></strong></span></p>\n<p><span style=\"font-weight: 400;\">Many people think that space travel isn’t important or that the rich are the only ones trying to figure out how to travel since they’ve destroyed Earth so much and don’t want to live in the future filth and I think both those ideas are absurd. First of all, with many different types of discoveries in space, we’ve learned that there are many planets out there that could be habitable and we’ve learned so much about the matter and how anti-matter works. Also, if the rich really wanted to get off of Earth and/or cared about the destruction of this planet, they would’ve funded space exploration a lot more.</span></p>\n<p><span style=\"font-weight: 400;\">Even though the Cold War was a horrible thing, it led to more activity in searching space, we now have satellites, have space stations, have sent someone to the moon, and have done many more things. With things like satellites and telescopes, we’re able to learn more about other planets, and how to either not become like them or to become more like them. Another thing satellites and space stations are useful for is tracking natural disasters, helping our internet, getting information about certain things whether it’s dangerous or not to the people, and helping us predict what will happen in the future.</span></p>\n<p><span style=\"font-weight: 400;\">Space is so much more than just a big empty area that is close and far away from Earth. It’s an area filled with amazing stars, galaxies, planets, and other things. It shows us how we most likely aren’t alone in this universe and how we’re really insignificant compared to everything else. Don’t get me wrong, everyone is still a valued human being, but to accept our insignificance and to look beyond the stars is such an amazing thing and something we could learn from. We could possibly also find alien life in the future whether it’s intelligent or not. Hopefully, it doesn’t find us first though, because as Stephen Hawking said “If aliens visit us, the outcome will be much as when Columbus landed in America, which didn’t turn out well for the Natives”.</span></p>\n<p><span style=\"font-weight: 400;\">If more funding is put into space, and more people are interested in learning about it, many more secrets about the universe we live in could be unlocked, the way time and possible time travel works could also be discovered more in-depth. Even if scientists don’t put a lot of funding towards discovering space, they could use things like satellites and better stations to learn more about the Earth and unlock the secrets about our planet and the system.</span></p>",
            "image": "https://blog.thegenz.org/media/posts/57/satellite.jpeg",
            "author": {
                "name": "Ishan Vepa"
            },
            "tags": [
                   "#space",
                   "#science",
                   "#oped",
                   "#community",
                   "#class"
            ],
            "date_published": "2020-12-27T11:07:14-05:00",
            "date_modified": "2020-12-27T11:07:14-05:00"
        },
        {
            "id": "https://blog.thegenz.org/one-song-at-a-time-music-for-social-change.html",
            "url": "https://blog.thegenz.org/one-song-at-a-time-music-for-social-change.html",
            "title": "One Song at a Time: Music for Social Change",
            "summary": "People around the world love to listen to and create music. Music has always been a way for people to dance, to celebrate, and to live happy lives. However, music can be more than just a hobby or small enjoyment. Music can help us to&hellip;",
            "content_html": "<p><span style=\"font-weight: 400;\">People around the world love to listen to and create music. Music has always been a way for people to dance, to celebrate, and to live happy lives. However, music can be more than just a hobby or small enjoyment. Music can help us to change the world. This change has occurred multiple times in the past; now our generation can look at those examples and find ways to utilize our music for <em>change.</em></span></p>\n<p><span style=\"font-weight: 400;\">An extremely important example of music inspiring social change is the American Civil Rights Movement. During the 1950s and 60s, many successful musicians, both black and white, used their platforms and music to contribute to the movement. White singers such as Bob Dylan and Joan Baez wrote many songs about the social injustices occurring at the time and devoted large parts of their careers to civil rights. Freedom songs became very popular, especially in the 60s, and they were inspired by black church music. The Staple Singers, originally a gospel group, rose to fame at the height of the civil rights movement. They were signed to Stax Records, a producing company that embodied the collaboration of many different races at a time of social pandemonium. The co-owner of Stax, Jim Stewart, said, “</span><span style=\"font-weight: 400;\">If we've done nothing more, we've shown the world that people of different colors, origins, and convictions can be as one, working together towards the same goal. Because we've learned how to live and work together at Stax Records, we've reaped many material benefits. But, most of all, we've acquired peace of mind. When hate and resentment break out all over the nation, we pull our blinds and display a sign that reads 'Look What We've Done—TOGETHER.'”. </span><span style=\"font-weight: 400;\">All of the music that was created, performed, and shared during this time helped immensely in the movement. It inspired people to stand up for what they believed in and provided a sense of courage for those who were hesitant to take part. Music played a huge role in uniting a divided population to fight together for one of the most central movements in American history.</span></p>\n<p><span style=\"font-weight: 400;\">The idea of using music to inspire social change is still relevant today. A global producing company, Community Media for Development (CMFD) Productions, records both music and radio sessions for exactly this purpose. One of their projects, Musicians Against Xenophobia, united musicians from South Africa, Zimbabwe, and Mozambique to produce a small album centered around the social issue of discrimination. Other CMFD projects include multiple songs about HIV awareness, a radio program titled “Hungry City” that discusses the poor state of food security in South African countries, and a radio series about floods in Mozambique in 2013. </span></p>\n<p><span style=\"font-weight: 400;\">Because music is such an important part of popular culture today, it is a perfect platform to raise awareness about social issues. Artists can address their beliefs in person at concerts, reaching hundreds of people at the same time. Songs on the radio are repeated over and over, which drills important messages into people’s minds. When someone learns and sings along to a song, they can then spread the message to others as well as have more understanding for what the song is truly about. Music is not just a form of entertainment. It contains the messages and ideas of artists who are truly passionate about what they believe in. These messages can often be overlooked by the audience. As a generation, it is important for us to stop and listen to what people are trying to say. If we think about what the artists are trying to tell us, we can create a united generation of people who are courageous and inspired enough to bring about social change. We can change the world for the better, one song at a time. </span></p>",
            "image": "https://blog.thegenz.org/media/posts/56/66A37754-08E5-461F-BA17-31642CFCEA72-maddie-_3.jpeg",
            "author": {
                "name": "Ishan Vepa"
            },
            "tags": [
                   "#society",
                   "#popculture",
                   "#music",
                   "#culture"
            ],
            "date_published": "2020-11-21T17:09:31-05:00",
            "date_modified": "2020-11-21T17:09:31-05:00"
        },
        {
            "id": "https://blog.thegenz.org/are-sports-more-harmful-or-helpful-for-kids.html",
            "url": "https://blog.thegenz.org/are-sports-more-harmful-or-helpful-for-kids.html",
            "title": "Are Sports More Harmful or Helpful for Kids?",
            "summary": " Are sports more harmful or helpful for kids? Sports are more helpful than harmful for kids. Sports are a helpful thing in a child’s life because kids who play sports are more confident, they perform better academically, and get more exercise than the average&hellip;",
            "content_html": "<p class=\"msg msg--highlight  align-center\"><span style=\"font-weight: 400;\"> </span><em><strong>Are sports more harmful or helpful for kids? Sports are more helpful than harmful for kids. Sports are a helpful thing in a child’s life because kids who play sports are more confident, they perform better academically, and get more exercise than the average non playing sports child. </strong></em></p>\n<p><span style=\"font-weight: 400;\">Sports are helpful for children because kids who play sports have more confidence than those who don’t. Most sports jocks tend to be on the more confident side, but according to the news video, “Kids and Sports”, sports give all kids confidence even if they are not playing for a team or with other kids at all. he video also says that minimal confidence is beneficial to a child. As displayed by facts in the video everyone is more confident if or when they play a sport.</span></p>\n<p><span style=\"font-weight: 400;\">Another way sports are helpful for kids is because kids tend to do better academically when they play a sport. In the news video “Sports: How much is too much?”, the coach of the basketball team says that the kids with overwhelming schedules do better academically, than the ones who have nothing to do. The coach also proves that his statement is correct by saying that when the sports season ends grades drop because the athletes seem to lose focus on their sport and their schoolwork. Sports don’t just help athletes in regular school but in college, because being good at a sport can get you a scholarship to a college, especially if you have good grades too.</span></p>\n<p><span style=\"font-weight: 400;\">The last way that sports are helpful for kids is because they help kids get more exercise. Exercise is good for staying healthy and burning calories, most of us know that, but did you know sports help kids prevent a terrible disease. In the article “What in the Name of High School Football?” by Hank Hill, it states, “The single greatest factor in preventing the nation’s number one killer - heart disease - is regular and vigorous exercise”. Children who play sports definitely get regular and vigorous exercise. So just by playing sports children can stay away from the nation’s number one killer. You wouldn’t want to hand your kid to a killer, would you? </span></p>\n<p><span style=\"font-weight: 400;\">In conclusion sports are without a doubt more helpful to kids than harmful. Sports help children socially, academically, and physically. Simply by just playing even one sport children will have more confidence, better grades, and stay away from a killer. If you are wondering whether to put your child on a sports team, if they want to do it, let them. Yes, they can get hurt, but it’s not definite, and it’s probably better than heart disease.</span></p>\n<hr>\n<p class=\"align-center\"><em>Citations</em></p>\n<p><span style=\"font-weight: 400;\">CBS and Katie Couric, directors. </span><i><span style=\"font-weight: 400;\">Notebook: Kids And Sports (CBS News)</span></i><span style=\"font-weight: 400;\">, CBS News, 7 Jan. 2008, www.youtube.com/watch?v=CV-WqlorsBM.</span></p>\n<p><span style=\"font-weight: 400;\">Gray, Walt and KCRA News, directors. </span><i><span style=\"font-weight: 400;\">Sports: How Much Is Too Much?</span></i><span style=\"font-weight: 400;\">, KCRA News, 15 Feb. 2011, www.youtube.com/watch?v=vrP68OD355w.</span></p>\n<p><span style=\"font-weight: 400;\">Hill, Hank. “What in the Name of High School Football?” </span><i><span style=\"font-weight: 400;\">Images.pcmac.org</span></i><span style=\"font-weight: 400;\">, Scholastic Inc., images.pcmac.org/SiSFiles/Schools/GA/CatoosaCounty/HeritageMiddle/Uploads/DocumentsCategories/Documents/sports%20articles.pdf.</span></p>\n<p> </p>",
            "image": "https://blog.thegenz.org/media/posts/55/socc-2.png",
            "author": {
                "name": "Ishan Vepa"
            },
            "tags": [
                   "#youth",
                   "#sports",
                   "#society"
            ],
            "date_published": "2020-11-18T10:34:40-05:00",
            "date_modified": "2020-11-18T10:34:40-05:00"
        },
        {
            "id": "https://blog.thegenz.org/tap-water-versus-plastic-bottles.html",
            "url": "https://blog.thegenz.org/tap-water-versus-plastic-bottles.html",
            "title": "Tap Water Versus Plastic Bottles",
            "summary": "During the school year, what do you usually use? Do you grab a plastic bottle of water? If so, then you may not know the benefits of using tap water instead of bottled water! Why have bottled water when you could get tap water? Well,&hellip;",
            "content_html": "<p class=\"msg msg--highlight  align-center\"><em><strong>During the school year, what do you usually use? Do you grab a plastic bottle of water? If so, then you may not know the benefits of using tap water instead of bottled water!</strong></em></p>\n<p><span style=\"font-weight: 400;\">Why have bottled water when you could get tap water? Well, tap water is free and much more cost-effective than buying plastic water bottles. If you use tap water, instead of plastic bottled water, you would also be decreasing the amount of waste you use daily. Why waste your money and pollute your world by using plastic water bottles, when you could get tap water? </span></p>\n<p><span style=\"font-weight: 400;\">Water bottles would cost you a lot of money if you continuously buy them. Tap water is much better to use in daily life since it saves you money. In fact, according to Business Insider, water bottles cost 2000 times more than regular tap water. In 2012, around $11.8 billion were spent by Americans on water bottles, reported by the BMC. Imagine the amount of savings that everyone could have if they used tap water instead of bottled water! Americans are spending so much on bottled water that a gallon of bottled water is twice the price of gasoline. When there is a more cost-effective solution than continuously buying bottled water, why should we continue to waste our money?</span></p>\n<p class=\"msg msg--highlight  align-center\"><em><strong>Do you throw out your water bottles after drinking them? Well, since you do, tap water is better than bottled water because water bottles create a lot of waste! </strong></em></p>\n<p><span style=\"font-weight: 400;\">According to The World Counts, every second 1,500 plastic bottles are being thrown into the ocean or in landfills. Obviously, this is a lot of waste, especially when most people can easily use tap water from their own home! Only 1 in 5 plastic bottles are recycled as well. The other 4 are usually thrown away, or they are littered.</span></p>\n<p><span style=\"font-weight: 400;\">Some may claim that bottled water has a different taste than regular tap water. What if I told you there isn’t any difference? You might have heard that bottled water is cleaner and healthier than tap water, but this is a huge lie! In reality, tap water is as good as bottled water! The World Counts reported that most bottled water is just tap water! Although critics say that there is a huge difference between tap and bottled water, blind tests state that tap water and bottled water taste the same, according to psych central. This imaginary difference between bottled and tap water is one that is costing Americans a lot of money and increasing the amount of waste created!</span></p>\n<p><span style=\"font-weight: 400;\">As you can see, tap water is just as good as bottled water, if not, even better! Bottled water is a waste of money, creates too much waste and it has no difference than tap water!  Now that you are informed, try to take steps to drink tap water instead of reaching for a bottle of water. Doing this can help the environment and your wallet!</span></p>\n<p><br><br><br></p>",
            "image": "https://blog.thegenz.org/media/posts/54/plasticwaterbottle-Anika-Mathur.jpg",
            "author": {
                "name": "Ishan Vepa"
            },
            "tags": [
                   "#society",
                   "#lifestyle",
                   "#infrastructure",
                   "#environment"
            ],
            "date_published": "2020-10-31T17:49:34-04:00",
            "date_modified": "2020-10-31T17:50:30-04:00"
        },
        {
            "id": "https://blog.thegenz.org/sleep-it-off.html",
            "url": "https://blog.thegenz.org/sleep-it-off.html",
            "title": "Sleep it Off",
            "summary": "According to NDTV, 1 in every 5 people don't get enough sleep every night. Many people like to squeeze out a few more extra hours in their day, whether it be for work or recreation, but they sacrifice the wrong thing to do it. Instead&hellip;",
            "content_html": "<p class=\"msg msg--highlight \"><em><strong>According to NDTV, 1 in every 5 people don't get enough sleep every night.</strong></em></p>\n<p><span style=\"font-weight: 400;\">Many people like to squeeze out a few more extra hours in their day, whether it be for work or recreation, but they sacrifice the wrong thing to do it. Instead of trying to forsake their sleep people should work more efficiently or decide to do it at the later date. Getting enough sleep is especially important during this pandemic as sleeping is the one time when our body can dedicate all resources to fight any germs and diseases that might have infected us.</span></p>\n<p class=\"msg msg--highlight \"><em><strong>Sleep is essential for the physical upkeep of the body, but it also helps maintain cognitive skills, such as attention, learning, memory, and emotional regulation.</strong></em></p>\n<p><span style=\"font-weight: 400;\">According to Erica Jansen, sleep touches almost every aspect of health as it can affect anything from our physical and mental condition the next day to reduce the risk factor of and developing immunity against various diseases and viruses. You might have noticed that one day if you hardly got any sleep, the next day you feel sluggish, moody, and tired. On the other hand, if you got the proper amount of sleep on another day then the day after that you probably felt refreshed, energetic, and maybe even cheerful. All that change came simply from how much sleep you got! Furthermore, according to the CDC, not getting enough sleep can increase one's chances of getting type 2 diabetes, cardiovascular disease, and obesity. </span></p>\n<p><span style=\"font-weight: 400;\">Getting more sleep can also drastically improve your performance at getting work done. According to an article written by Ana Sandoiu, not only does sleeping help us learn new things faster, but it also helps to increase the neuroplasticity of our brains. Neuroplasticity is the brain's ability to rewire itself and create new connections between neurons. </span></p>\n<p><span style=\"font-weight: 400;\">Furthermore, sleep can help one be more emotionally stable and reduce their risk of developing a mental health condition. People who don’t get enough sleep will be more prone to getting anxiety and depression which in itself could lead to further sleepless nights. Sleep also helps us to perceive reality correctly. Research suggests that if one doesn't sleep for 3 or more nights they will have perceptual distortions, hallucinations, and delusions. When scientists reviewed their research they were also able to find out that poor sleep, or insomnia, preceded the development of bipolar disorder and schizophrenia. Insomnia also increased the chances of one to commit suicide. </span></p>\n<p><span style=\"font-weight: 400;\">Now that you have made it this far you are probably wondering if there are any tips as to how to get more/better sleep. One of the best ways that I have found to improve one's sleep cycle is a form of cognitive-behavioral therapy for treating insomnia (CBT-I). To test its effects, Professor Freeman and a few of his colleagues randomly chose 3,755 students with insomnia from 26 different colleges and made them receive either CBT-I or usual care. After some testing, Freeman found that students who received the CBT-I treatment had a more significant improvement in sleep cycles than the students who received the usual care. Not only did the student who received CBT-I have better sleep, but they also experienced less paranoia and fewer hallucinations. </span></p>\n<p><span style=\"font-weight: 400;\">When you begin the therapy you first learn about what exactly sleep is and how to change your sleep-related behaviors and thought processes. Then you learn about sleep hygiene which involves things such as limiting naps and not using electronics 30 minutes before or during bedtime. Next, you are taught three behavioral techniques: Sleep restriction, stimulus control, and relaxation. Finally, you learn about a few cognitive techniques, some of which include belief restructuring, mindfulness, imagery, and paradoxical intention. Of course, this is a brief overview of CBT-I but if you think this might help you then I recommend searching about it and understanding it more in-depth. </span></p>\n<p><span style=\"font-weight: 400;\">Sleep is a very important factor in maintaining our health and living a happy and fulfilling life. We should try to do our best to get enough sleep in the day otherwise your life might start going downhill before you even realize it. While you might think that you are fine if you get a mere 1 hour of sleep or simply not sleeping at all, you are not. Lack of sleep takes its toll both mentally and physically. </span></p>\n<hr>\n<p class=\"align-center\"><em><span style=\"font-weight: 400;\">Citations</span></em></p>\n<p><span style=\"font-weight: 400;\">Jansen, Erica. “Sleep 101: Why Sleep Is So Important to Your Health: The Pursuit: University of Michigan School of Public Health: Adolescent Health: Child Health: Chronic Disease: Epidemic: Mental Health: Obesity.” The Pursuit | University of Michigan School of Public Health | Adolescent Health | Child Health | Chronic Disease | Epidemic | Mental Health | Obesity, 2 Mar. 2020, sph.umich.edu/pursuit/2020posts/why-sleep-is-so-important-to-your-health.html#:~:text=Sleep%20is%20essential%20to%20every,touches%20every%20aspect%20of%20health.</span></p>\n<p><span style=\"font-weight: 400;\">Kingsland, James. “Mental Health: What Role Does Sleep Play?” Edited by Hannah Flynn, Medical News Today, MediLexicon International, 4 Aug. 2020, www.medicalnewstoday.com/articles/sleep-and-mental-health#How-does-CBT-for-insomnia-work?</span></p>\n<p><span style=\"font-weight: 400;\">Sandoiu , Ana. “The Neuroscience of Sleep.” Edited by Jessica Beake, Medical News Today, MediLexicon International, 6 Aug. 2020, www.medicalnewstoday.com/articles/what-happens-in-the-brain-when-you-sleep#The-neurons-that-make-us-forget-dreams.</span></p>\n<p><span style=\"font-weight: 400;\">Perez, Cassandra. “20 Percent People Sleep Deprived Globally: Survey.” Sleep Review, 16 Mar. 2020, www.sleepreviewmag.com/curated/20-percent-people-sleep-deprived-globally-survey/.</span></p>\n<p> </p>",
            "image": "https://blog.thegenz.org/media/posts/53/sleep-Ekansh-Kushwaha.jpg",
            "author": {
                "name": "Ishan Vepa"
            },
            "tags": [
                   "#society",
                   "#lifestyle",
                   "#community"
            ],
            "date_published": "2020-10-27T10:27:02-04:00",
            "date_modified": "2020-10-27T10:27:02-04:00"
        },
        {
            "id": "https://blog.thegenz.org/put-your-parties-on-hold.html",
            "url": "https://blog.thegenz.org/put-your-parties-on-hold.html",
            "title": "Put your Parties on Hold",
            "summary": " In case you’ve been under a rock for the past few months, we are in the middle of a global pandemic. There is a disease plaguing the world, infecting and killing, with no cure as of yet. Nearly the entire world is under quarantine&hellip;",
            "content_html": "<p><span style=\"font-weight: 400;\"> </span><span style=\"font-weight: 400;\">In case you’ve been under a rock for the past few months, we are in the middle of a global pandemic. There is a disease plaguing the world, infecting and killing, with no cure as of yet. Nearly the entire world is under quarantine as to lower the haste of Covid-19’s spread and try to allow hospitals to treat patients at a speed at which they can handle. </span></p>\n<p><span style=\"font-weight: 400;\">In all of this, you’d think this would be a time where people would put down their pitchforks and listen to the people that know what’s best for them. You’d think that there would finally be an event where the whole world could agree to put their gatherings on hold and follow social distancing, not for themselves, but for the innocent people they could spread the disease to whom very well could be at risk of death if they caught such a disease. You’d think these things, but it apparently isn’t the case.</span></p>\n<p><span style=\"font-weight: 400;\"> </span><span style=\"font-weight: 400;\">As an example, social media influencer Jake Paul has thrown a party as of recently. A party. Right now. In the middle of a pandemic. You hopefully can see how such a thing is a problem in today’s life as, even if there were precautions made, germs were definitely spread as well as the potential spread of disease. Though, saying precautions were made would be a complete and utter overstatement, as Jake did nothing of the sort. No distancing, no masks, and dozens of party-goers in extremely close proximity to each other. As icing on the cake, there apparently is a possibility that one of the party attendees was infected during the time the party took place. After hearing such news, Jake Paul was barely fazed, saying he wasn’t worried.</span><span style=\"font-weight: 400;\"> He then said in an interview that he will not promise to stop partying, as “Our leadership has failed us” being his only defense against his actions.</span></p>\n<p><span style=\"font-weight: 400;\"> </span><span style=\"font-weight: 400;\">As for what we can do to combat this stupidity and recklessness is pretty much nothing. All we can do is take precautions, not for us, but for those innocent people. Use Jake Paul as an example of what not to do. We are still in a pandemic, and we can do better than this.</span></p>\n<p dir=\"ltr\"> </p>",
            "image": "https://blog.thegenz.org/media/posts/52/7-1-1024x512-Rohan-Thapliyal.jpg",
            "author": {
                "name": "Ishan Vepa"
            },
            "tags": [
                   "#society",
                   "#socialmedia",
                   "#popculture",
                   "#global",
                   "#covid19",
                   "#coronavirus"
            ],
            "date_published": "2020-10-04T15:26:20-04:00",
            "date_modified": "2020-10-05T07:34:54-04:00"
        },
        {
            "id": "https://blog.thegenz.org/e-waste-the-consequences-of-material-extraction.html",
            "url": "https://blog.thegenz.org/e-waste-the-consequences-of-material-extraction.html",
            "title": "E-Waste: The Consequences of Material Extraction",
            "summary": "The United States produces 6.9 million tons of electronic waste each year and only 12% of it gets recycled according to the EPA. The rate of electronics being produced is five times faster than the growth of the human population itself. All of this electronic&hellip;",
            "content_html": "<p><span style=\"font-weight: 400;\">The United States produces 6.9 million tons of electronic waste each year and only 12% of it gets recycled according to the EPA. The rate of electronics being produced is five times faster than the growth of the human population itself. All of this electronic waste or e-waste, is made of valuable metals and toxic substances, 50 - 70 % of which is transported to foreign countries, where it accumulates developing into a hazard for the surrounding environment. </span></p>\n<p class=\"align-center msg msg--highlight \"><em><strong>But creating massive amounts of electronics requires large amounts of materials that are causing problems in many third-world countries.</strong></em></p>\n<p><strong><i>The conflict in DRC:</i></strong></p>\n<p><span style=\"font-weight: 400;\"> </span><span style=\"font-weight: 400;\">The Democratic Republic has been a hotspot of conflict for many years and is currently going through a civil war fueled by the mining of metals. Both sides depend on the metals to finance operations causing a conflict which has taken the lives of 5.4 million people since 1998. These metals are then bought by foreign countries to produce electronics. Robert Hormats, who served as the Under Secretary of State for Economic Growth, Energy, and the Environment said that the consequences of mineral mining are “one of the most significant moral issues of our time”. </span></p>\n<p><strong><i>Environmental impact: </i></strong></p>\n<p><span style=\"font-weight: 400;\"> </span><span style=\"font-weight: 400;\">Mining for metals is extremely detrimental to the surrounding environment. It contaminates nearby water sources with different types of toxic metals and acids which kills wildlife. A large amount of waste is also produced through the mining process which ends up in the ground or at waste sites. Approximately 80 tons of waste is produced from mining one ounce of gold. The mining of rare Earth elements also requires miners to separate it from radioactive elements. Managing the radioactive waste is also a problem and many are exposed to radiation in the process. One of the largest e-waste dumps in the world is the city of Guiyu in China, where e-waste from all over the world is transported for burning or recycling. The burning of plastics has resulted in 80 % of Guiyu’s children to have high amounts of lead in their blood. Nearby water sources also test high for industrial solvents and metals.</span></p>\n<p><strong><i>What you can do to help: </i></strong></p>\n<p><span style=\"font-weight: 400;\"> </span><span style=\"font-weight: 400;\">One of the best ways that you can help slow down the amount of e-waste produced is by lengthening the time you buy devices. Instead of buying the newest phone and chucking the old one every time your brand comes out with a new version, buy a new phone every two or three versions as most phones work fine for more than 3 or 4 years. This is the same with laptops and TVs which can also last very long before needing a replacement. Most cell carriers have deals where you can trade in a phone and it counts towards your purchase of a newer version which is also a great way to reduce the amount of e-waste you produce. The safest way to dispose of electronics is to check for nearby recycling centers for electronics. They can manage the waste and recover metals and parts that can be recycled before getting rid of the waste.</span></p>\n<hr>\n<p class=\"align-center\"><em><span style=\"font-weight: 400;\">Citations</span></em></p>\n<p><span style=\"font-weight: 400;\"> </span><span style=\"font-weight: 400;\">“Where’s The Harm – From Materials Extraction?” </span><i><span style=\"font-weight: 400;\">Electronics Take Back Coalition</span></i><span style=\"font-weight: 400;\">, </span><a href=\"http://www.electronicstakeback.com/toxics-in-electronics/wheres-the-harm-extraction/\"><span style=\"font-weight: 400;\">www.electronicstakeback.com/toxics-in-electronics/wheres-the-harm-extraction/</span></a><span style=\"font-weight: 400;\">.</span></p>\n<p><span style=\"font-weight: 400;\">Banco, Erin. “Is Your Cell Phone Fueling Civil War in Congo?” </span><i><span style=\"font-weight: 400;\">The Atlantic</span></i><span style=\"font-weight: 400;\">, Atlantic Media Company, 10 July 2011, </span><a href=\"http://www.theatlantic.com/international/archive/2011/07/is-your-cell-phone-fueling-civil-war-in-congo/241663/\"><span style=\"font-weight: 400;\">www.theatlantic.com/international/archive/2011/07/is-your-cell-phone-fueling-civil-war-in-congo/241663/</span></a><span style=\"font-weight: 400;\">.</span></p>\n<p><span style=\"font-weight: 400;\">Pinghui, Zhuang. “China's Notorious e-Waste Dumping Ground Cleaner but Poorer.” </span><i><span style=\"font-weight: 400;\">South China Morning Post</span></i><span style=\"font-weight: 400;\">, 22 Sept. 2017, </span><a href=\"http://www.scmp.com/news/china/society/article/2112226/chinas-most-notorious-e-waste-dumping-ground-now-cleaner-poorer\"><span style=\"font-weight: 400;\">www.scmp.com/news/china/society/article/2112226/chinas-most-notorious-e-waste-dumping-ground-now-cleaner-poorer</span></a><span style=\"font-weight: 400;\">.</span></p>",
            "image": "https://blog.thegenz.org/media/posts/51/e_waste.jpg",
            "author": {
                "name": "Ishan Vepa"
            },
            "tags": [
                   "#tech",
                   "#environment"
            ],
            "date_published": "2020-10-01T17:44:12-04:00",
            "date_modified": "2020-10-01T17:44:12-04:00"
        },
        {
            "id": "https://blog.thegenz.org/should-schools-reopen.html",
            "url": "https://blog.thegenz.org/should-schools-reopen.html",
            "title": "Should Schools Reopen",
            "summary": "With summer ending schools have started to re-open, but is that the right move many wonder. I strongly believe that reopening schools is the worst thing that could happen currently. Because there is still a raging pandemic which the world, let alone the U.S has&hellip;",
            "content_html": "<p class=\"align-center msg msg--highlight \"><em><strong>With summer ending schools have started to re-open, but is that the right move many wonder. I strongly believe that reopening schools is the worst thing that could happen currently. Because there is still a raging pandemic which the world, let alone the U.S has an answer for. </strong></em></p>\n<p class=\"align-center\"><i><span style=\"font-weight: 400;\">What effect has schools reopening had on students</span></i></p>\n<p><span style=\"font-weight: 400;\"> </span><span style=\"font-weight: 400;\">Schools reopening have put many students at risk of catching the virus. In the last two weeks of July over 97,000 covid cases were students, schools were not even open. If the virus is spreading this fast for students when out of school, I don't want to imagine how bad it will be when all schools reopen. But many schools have set up an online option that will provide distance learning to students which will reduce a good chunk of those potential cases but not enough. Many of the schools in the Southern states are reopening and those states have seen a surge in cases. Georgia has had over 40,000 new cases ever since schools opened. Their cases per day went from 2,000 a day to 4,000 a day. If all states reopened schools, their cases would obviously rise and call for the entire state to be shut down again. That's why I believe that online school, until the amount of cases decreases massively, is how schools should be reopening. </span></p>\n<p class=\"align-center\"><i><span style=\"font-weight: 400;\">Why do students and parents not want online school?</span></i></p>\n<p><span style=\"font-weight: 400;\">Many students dislike online learning, because it is easier for many to learn in person. I can agree with this because when schools did close in the spring it was harder keeping a routine and learning new concepts from home. I feel like even though it is harder to learn from home it will be beneficial to the country as there the amount of cases that could happen would be prevented. Many believe that saving lives is worth doing online school, no matter how hard it may be for some students. A major flaw with online education is not everyone has access to it. Many organizations are trying like internet providers are trying to help students who don't have access by providing WiFi and other technology they need. Also it is a lot harder for younger students to learn from a at home setting as they have shorter attention spans and need more help learning topics. But teachers and parents are trying their best to help them. Schools have served as a daycare for many parents and with online school that would not be possible, not every parent can work from home and their child would have to be sent to a daycare which will cost them extra. The government is trying to provide financial support but I fear that it will not be enough to help these families who are struggling during these times. </span></p>\n<p><span style=\"font-weight: 400;\">Overall schools reopening wouldn’t help anybody as after a week or two they would have to close again because of the virus. If a state decides to let schools open for in person learning there should be some requirements, such as less students, masks, social distancing and daily cleaning of the school. Sadly that's not what we have seen in Georgia and many other states that have reopened schools, as many students aren't wearing masks or social distancing. CNN reported on this issue but schools in Georgia have not changed anything. One school even suspended the student who took the photo exposing the school. I don’t think any public place such as schools can open safely without there being an outbreak and for those reasons, I believe schools shouldn’t have in person learning until numbers are under control.</span></p>\n<hr>\n<p class=\"align-center\"><em>Citations</em></p>\n<p>Turner, Cory. “At Least 97,000 Children Tested Positive For Coronavirus In Last 2 Weeks Of July.” <i>NPR</i>, NPR, 11 Aug. 2020, <a href=\"http://www.npr.org/sections/coronavirus-live-updates/2020/08/11/900861372/at-least-97-000-children-tested-positive-for-coronavirus-in-last-2-weeks-of-july\">www.npr.org/sections/coronavirus-live-updates/2020/08/11/900861372/at-least-97-000-children-tested-positive-for-coronavirus-in-last-2-weeks-of-july</a>.</p>\n<p>Peiser, Jaclyn. “A Georgia District Returned to School Last Week. More than 900 Students and Staff Are Now Quarantined.” <i>The Washington Post</i>, WP Company, 12 Aug. 2020, <a href=\"http://www.washingtonpost.com/nation/2020/08/12/school-coronavirus-outbreak-georgia-quarantine/\">www.washingtonpost.com/nation/2020/08/12/school-coronavirus-outbreak-georgia-quarantine/</a>.</p>\n<p>Andone, Dakin. “Georgia School Seen in Photo of a Crowded Hallway Will Briefly Move to Online Learning after Reporting 9 Cases of Covid-19.” <i>CNN</i>, Cable News Network, 10 Aug. 2020, <a href=\"http://www.cnn.com/2020/08/09/us/north-paulding-high-school-covid-19-cases/index.html\">www.cnn.com/2020/08/09/us/north-paulding-high-school-covid-19-cases/index.html</a>.</p>\n<p><span style=\"font-weight: 400;\">Google’s COVID-19 Alert</span></p>\n<p> </p>",
            "image": "https://blog.thegenz.org/media/posts/50/24F482A3-B132-49A9-87F2-B516DFFC1C78-Ryan-Shankar.jpeg",
            "author": {
                "name": "Ishan Vepa"
            },
            "tags": [
                   "#education",
                   "#covid19",
                   "#coronavirus"
            ],
            "date_published": "2020-09-25T17:33:29-04:00",
            "date_modified": "2020-09-25T17:33:29-04:00"
        },
        {
            "id": "https://blog.thegenz.org/our-unconscious-biases-the-hidden-racial-prejudice-within-us-all.html",
            "url": "https://blog.thegenz.org/our-unconscious-biases-the-hidden-racial-prejudice-within-us-all.html",
            "title": "Our Unconscious Biases: The Hidden Racial Prejudice Within us All",
            "summary": "“Are Emily and Greg More Employable Than Lakisha and Jamal?” The American Economic Institute conducted this study in order to understand labor market discrimination. Fictitious resumes were sent to over 1300 employment ads in Boston and Chicago newspapers. The resumes were randomly assigned either a&hellip;",
            "content_html": "<p class=\"msg msg--highlight  align-center\"><em><strong>“Are Emily and Greg More Employable Than Lakisha and Jamal?” </strong></em></p>\n<p><span style=\"font-weight: 400;\">The American Economic Institute conducted this study in order to understand labor market discrimination. Fictitious resumes were sent to over 1300 employment ads in Boston and Chicago newspapers. The resumes were randomly assigned either a white-sounding name (Emily Walsh or Greg Baker) or an African American sounding name (Lakisha Washington or Jamal Jones). The researches also varied the quality of the resumes, giving two higher quality and two-lower-quality resumes to each employer for a total of nearly 5000 resumes covering a vast array of jobs within the fields of sales and administrative support and customer services.</span></p>\n<p><span style=\"font-weight: 400;\">Researchers found that white-sounding names had a 9.65% chance of receiving a callback, whereas African American sounding names had a 6.45% chance. Regarding quality, higher-quality resumes did receive more callbacks, as expected, but for African Americans, the difference was only a 0.51% improvement. A number that researchers deemed statistically insignificant, essentially meaning that African American applicants experienced no gain from a higher quality resume.   </span><span style=\"font-weight: 400;\">                     </span></p>\n<figure class=\"align-center\"><span style=\"font-weight: 400;\">                                                                            </span>                                                                                                <img loading=\"lazy\"  src=\"https://miro.medium.com/max/900/1*R1j1tQkSR8mdQls7G3sjZQ.jpeg\" data-is-external-image=\"true\"  alt=\"Are Emily and Greg more Employable than Lakisha and Jamal? | by Brooke C |  Medium\" width=\"415\" height=\"509\"></figure>\n<p> </p>\n<p><span style=\"font-weight: 400;\">The researchers were in fact able to conclude that the employers were being discriminatory towards the African Americans. </span></p>\n<p><span style=\"font-weight: 400;\">This experiment is just one application of our implicit, unconscious racial biases creating unfair hurdles and impeding access to opportunity. Something that every American has. Racial biases are something that I, a person of color, am not free of.</span></p>\n<p><span style=\"font-weight: 400;\">Why use the word biases, rather than just plain and simple, racism? </span></p>\n<p><span style=\"font-weight: 400;\">The word racism has a severe negative connotation that many view as negative thoughts, negative feelings, and hatred towards a group of people. Since the passing of legislation during the civil rights era making this immoral and illegal, racism has become more subtle. These negative feelings embedded within a race are still there but many aren’t aware of them. And rather than hatred, it’s more like avoidance and discomfort. That’s where the use of the words “unconscious, implicit, racial biases” comes from.</span></p>\n<p class=\"align-center\"><strong>Biases at Work</strong></p>\n<p><span style=\"font-weight: 400;\">John Dovidio, professor of psychology and public health at Yale University, further explores this. “Most of us want to be good people. Prejudice is bad and when we think about it, we always do the right thing. But if something is unconscious, you don’t know you have it. It’s that simple. They’re like having habits of mind that you’ve grown up with” he says in an interview with the American Psychological Association</span></p>\n<p><span style=\"font-weight: 400;\">Many agree that we cannot get rid of this inherent bias in our brains. On the contrary, it’s something we manage. </span></p>\n<p><span style=\"font-weight: 400;\">But the </span><i><span style=\"font-weight: 400;\">Are Emily and Greg More Employable Than Lakisha and Jamal experiment </span></i><span style=\"font-weight: 400;\">has proved that these subtle biases are having greater adverse effects when being put into application. This is evident not only in the labor market but within critical life domains such as housing, education, health, and criminal justice. Our implicit biases present themselves in the form of microaggressions (indirect, subtle, or even unintentional acts of discrimination against members of a marginalized group), stereotyping, avoidance, or in the worst-case scenario, through our decision making, for example with police. All creating barriers that impede opportunity. Essentially, making the need to manage our biases on an individual level all the more vital and urgent. </span></p>\n<p class=\"align-center\"><strong>How can we manage our racial biases?</strong></p>\n<p><span style=\"font-weight: 400;\">One important strategy to understand our biases is the involvement of racial and ethnic diversity in conversations and discussions. Like mentioned before, racism has shifted from hatred to now avoidance, discomfort, and bias. The problem with avoiding a group of people is that allows you to maintain the stereotypes that you have of that group. Assumptions and expectations about the roles they should play all lead to unfair judgments. Reversely, if you continue to interact with those members you no longer think about them as members of a group. You think about them as individuals. </span></p>\n<p><strong>“You haven’t really gotten rid of the implicit bias, but you’ve now been able to fine-tune and dial-up a broader array of repertoire of being able to interact with people and understand them,” says Divido.</strong></p>\n<p><span style=\"font-weight: 400;\">More importantly, dealing with bias is a personal operation. Situations, mostly vulnerable, stress ones, around us affect when our racial biases come into play. In situations where we feel threatened or fearful we are more likely to act on our biases. Jenifer Eberhardt, professor of psychology at Stanford University, explains that “by interrogating ourselves and slowing ourselves down... just being aware when we’re beginning to make stereotypic associations.” This allows you to move your thinking from the primitive, reactive parts of the brain to the more reflective levels.</span></p>\n<p><span style=\"font-weight: 400;\">Black people convicted of capital offenses facing the death penalty at higher rates than white people. Teachers quick to see “patterns” of bad behavior in black children. Police officers shooting unarmed black men. All are outcomes of our biases that not only explore the nature of America but are ideas that Eberhardt has studied. </span></p>\n<p><span style=\"font-weight: 400;\">Eberhardt agrees that increased diversity in neighborhoods, workplaces, and schools is vital. But the implementation of anti-bias training in many institutions is where we can begin to deal with our bias in the workplace. </span></p>\n<p><span style=\"font-weight: 400;\">One example of this is within the Oakland Police Department. By changing its foot pursuit policy, rather than chase a suspect into a blind alley, officers are encouraged to call for backup, set a perimeter, and make a plan. This gives officers more distance on the situation, therefore, allowing them to take hold of their decision making. This is where Eberhardt’s idea of “interrogating ourselves and slowing ourselves down” comes into play. Even without knowing the roots of the behavior, as a result, the change in policy positively affected officer injuries and officer-involved shootings. Oakland used to have eight to nine officer-involved shootings every single year, after changing policy, they had eight officer-involved shootings across five years.  </span></p>\n<p><span style=\"font-weight: 400;\">The glimpses of the anti-bias training being introduced within the workforce are proving to be effective. But it doesn’t stop there. Imagine if these techniques were enforced within our education or criminal justice systems. Eberhardt agrees with the ending of her book, </span><i><span style=\"font-weight: 400;\">Biased: Uncovering the Hidden Prejudice That Shapes What We See, Think, and Do</span></i><span style=\"font-weight: 400;\"> “There is hope in the sheer act of reflection. This is where the power lies and how the process starts.”</span></p>\n<p class=\"align-center\"><strong>As for all of us, whether at work or not, think twice before making an association or acting upon a stereotype considering now we know its impacts in creating and reinforcing racialized barriers to opportunity.</strong></p>\n<hr>\n<p class=\"align-center\"><em><span style=\"font-weight: 400;\">Citations</span></em></p>\n<p><span style=\"font-weight: 400;\">Bertrand, M., and Mullainathan, S., 2020. </span><i><span style=\"font-weight: 400;\">Are Emily And Greg More Employable Than Lakisha And Jamal? A Field Experiment On Labor Market Discrimination</span></i><span style=\"font-weight: 400;\">. Uh.edu. </span><a href=\"https://www.uh.edu/~adkugler/Bertrand&amp;Mullainathan.pdf\"><span style=\"font-weight: 400;\">https://www.uh.edu/~adkugler/Bertrand&amp;Mullainathan.pdf</span></a><span style=\"font-weight: 400;\"> </span></p>\n<p><span style=\"font-weight: 400;\">Chang, A., 2020. </span><i><span style=\"font-weight: 400;\">Can We Overcome Racial Bias? 'Biased' Author Says To Start By Acknowledging It</span></i><span style=\"font-weight: 400;\">.  Npr.org. </span><a href=\"https://www.npr.org/2019/03/28/705113639/can-we-overcome-racial-bias-biased-author-says-to-start-by-acknowledging-it\"><span style=\"font-weight: 400;\">https://www.npr.org/2019/03/28/705113639/can-we-overcome-racial-bias-biased-author-says-to-start-by-acknowledging-it</span></a><span style=\"font-weight: 400;\"> </span></p>\n<p><span style=\"font-weight: 400;\">Hamilton, A., 2020. </span><i><span style=\"font-weight: 400;\">Speaking Of Psychology: Understanding Your Racial Biases</span></i><span style=\"font-weight: 400;\">. Apa.org.</span><a href=\"https://www.apa.org/research/action/speaking-of-psychology/understanding-biases\"><span style=\"font-weight: 400;\">https://www.apa.org/research/action/speaking-of-psychology/understanding-biases</span></a><span style=\"font-weight: 400;\">  </span></p>\n<p><span style=\"font-weight: 400;\">Racial Equity Tools.org. 2020. </span><i><span style=\"font-weight: 400;\">Communicating • Racial Equity Tools</span></i><span style=\"font-weight: 400;\">. Available at: </span><a href=\"https://www.racialequitytools.org/act/communicating/implicit-bias\"><span style=\"font-weight: 400;\">https://www.racialequitytools.org/act/communicating/implicit-bias</span></a><span style=\"font-weight: 400;\"> </span></p>\n<p><span style=\"font-weight: 400;\">Kirwan Institute.osu.edu. 2020. </span><i><span style=\"font-weight: 400;\">Understanding Implicit Bias</span></i><span style=\"font-weight: 400;\">. Available at: </span><a href=\"http://kirwaninstitute.osu.edu/research/understanding-implicit-bias/\"><span style=\"font-weight: 400;\">http://kirwaninstitute.osu.edu/research/understanding-implicit-bias/</span></a><span style=\"font-weight: 400;\"> </span></p>\n<p><span style=\"font-weight: 400;\">Starr, D., 2020. Meet The Psychologist Exploring Unconscious Bias—And Its Tragic Consequences For Society. Science | AAAS. </span><a href=\"https://www.sciencemag.org/news/2020/03/meet-psychologist-exploring-unconscious-bias-and-its-tragic-consequences-society\"><span style=\"font-weight: 400;\">https://www.sciencemag.org/news/2020/03/meet-psychologist-exploring-unconscious-bias-and-its-tragic-consequences-society</span></a><span style=\"font-weight: 400;\"> </span></p>\n<p><br><br><br><br><br><br><br><br><br><br><br><br><br><br></p>",
            "image": "https://blog.thegenz.org/media/posts/48/unconscious-bias-pic-Generation-Z-Media.png",
            "author": {
                "name": "Ishan Vepa"
            },
            "tags": [
                   "#society",
                   "#inequality",
                   "#generations",
                   "#gap",
                   "#community",
                   "#blacklivesmatter"
            ],
            "date_published": "2020-09-16T16:08:18-04:00",
            "date_modified": "2020-09-16T16:25:18-04:00"
        }
    ]
}
