{
    "version": "https://jsonfeed.org/version/1",
    "title": "The Generation Z Blog",
    "description": "",
    "home_page_url": "https://blog.thegenz.org",
    "feed_url": "https://blog.thegenz.org/feed.json",
    "user_comment": "",
    "icon": "https://blog.thegenz.org/media/website/gen-z-logo-refined.png",
    "author": {
        "name": "Ishan Vepa"
    },
    "items": [
        {
            "id": "https://blog.thegenz.org/a-social-study-of-racism-in-latin-america.html",
            "url": "https://blog.thegenz.org/a-social-study-of-racism-in-latin-america.html",
            "title": "A Social Study of Racism in Latin America",
            "summary": "This summer has seen a lot more political and economic tension than ever before in most of our lifetimes. Racism has always been a point of discussion in the United States, especially in a post-Civil Rights Movement era. However, growing up in South Florida has&hellip;",
            "content_html": "<p><span style=\"font-weight: 400;\">This summer has seen a lot more political and economic tension than ever before in most of our lifetimes. Racism has always been a point of discussion in the United States, especially in a post-Civil Rights Movement era. However, growing up in South Florida has always gotten me to wonder how racism is handled in other parts of the world, specifically in Latin America.</span></p>\n<p><span style=\"font-weight: 400;\">Perhaps we should start with some history for context. In the early 16th century, the conquistadors landed in the Americas, following Columbus. Their expeditions were pure conquest -- finding land and resources for Spain. Their foreign germs murdered 90% of the native populations and what was left were either chased off, converted to Christianity, enslaved by the Spanish, or a combination of any of these. This could be where racism in Latin America truly started, but there is a key difference: the Spanish conquered for the sake of conquering. The argument could be made that there was hardly real racial motivation for colonizing the Americas, but the argument can be made for the opposite. However, by 1502, African slaves were already in the Caribbean. This is, arguably, where the true racism began in colonial Latin America.</span></p>\n<p><span style=\"font-weight: 400;\">While indigenous people were enslaved due to conquest, African slaves were a part of the Trans-Atlantic trade system -- also famously called the Colombian Exchange -- and so now the conquistadors found themselves with a question: What will the social hierarchy be? You have ethnocentric Europeans with two different kinds of enslaved peoples. The </span><i><span style=\"font-weight: 400;\">casta </span></i><span style=\"font-weight: 400;\">system that the Spanish developed was as follows, roughly: with the </span><i><span style=\"font-weight: 400;\">peninsulares </span></i><span style=\"font-weight: 400;\">at the top (white Europeans from the Iberian peninsula), </span><i><span style=\"font-weight: 400;\">creoles</span></i><span style=\"font-weight: 400;\"> just under (white Europeans born in the Americas), mestizos and mulattos, followed by indigenous people, and then black slaves all the way at the bottom -- because to the white conquistador, enslaved Africans were lesser than everyone. This was due to a combination of the notion of blood purity and racial segregation. </span></p>\n<p><span style=\"font-weight: 400;\">This system of both political, economic, and social hierarchy is most probably the reason for modern-day racism in Latin America. Unlike in the United States, racism in Latin America is based on social and economic class. This may sound similar to racism in the U.S., but in Latin America: if you’re poor, then you’re black. In the United States, racism is often the opposite: if you’re black, then you must be poor. According to an article from the American Quarterly, “</span><span style=\"font-weight: 400;\">As early as 1944, Alejandro Lipschutz, a Chilean anthropologist, coined the idea of Latin America as a ‘pigmentocracy’ -- where the region’s social hierarchies are ethnic or color-based. However, that idea was largely ignored until recently, when research using new census data on racial identification began to document racial inequalities. These studies generally show that Afro-descendant and Indigenous people occupy the lowest rungs on the income, educational and occupational ladders across Latin America.”</span><span style=\"font-weight: 400;\"> But because Latin America as a whole is not the wealthiest of continents, funding and money are often pushed towards other projects. </span></p>\n<p><span style=\"font-weight: 400;\">The social aspect of it is also a factor because while in the United States, “negro” is compared to the n-word, but in Latin America, it is used a fond version of “homie” for people with darker skin. To us in the U.S., this appears to be racist. But in Latin America, oftentimes it’s not used as such. Its connotations depend entirely on the context. “Negrita(/o)” is used as a fond pet name for friends or family with dark skin, even if they’re not black. At the same time, it can be used as a slur as bad as the n-word when thrown around with hate behind it. </span></p>\n<p class=\"align-left\"><em><span style=\"font-weight: 400;\">Because of all of this, racism is often overlooked. </span></em></p>\n<p><span style=\"font-weight: 400;\">However, now this poses the question: how does this racism manifest itself in immigrants who come to the United States? It’s quite an interesting phenomena because here, Hispanics are no longer the majority; they’re the minority. Here in the U.S., they are often greeted with racism towards them, so why are some Hispanics still racist towards other minorities? By all logic, they shouldn’t. They’re on the same level as them; they’re all facing the same racism and oppression. So, why?  </span></p>\n<p><span style=\"font-weight: 400;\">The answer is very complicated. For one, there is the notion of a sort of “protection.” Latinos are often encouraged to either marry people who are lighter skin than them or marry white people. Marrying lighter skin people has the connotations that you marry rich and that you’re gaining more “protection” from racism. It’s a practice of erasing culture and heritage for the sake of wanting -- what some would call -- a better life. This is the same reason why some Hispanics parents refuse to teach Spanish to their kids -- so that those kids don’t get picked on or have to experience racism like their parents did. </span></p>\n<p><span style=\"font-weight: 400;\">There is also, however, a paradoxical feeling of superiority that leads to racism towards other minorities. This is mainly rooted in stereotypes portrayed in the United States that Hispanics families sometimes believe, such as how black people are called “thugs.” This reinforces the classist racism of Latin America, so the line between “poor therefore black” and “black therefore poor” is extremely blurred.</span></p>\n<p><span style=\"font-weight: 400;\">So hopefully this has provided some insight on how racism manifests itself in different parts of the world, but also how it manifests itself when it is in the United States.</span></p>\n<hr>\n<p class=\"align-center\"><em>Citations</em></p>\n<p>“Science and Its Times: Understanding the Social Significance of Scientific Discovery. . Encyclopedia.com. 11 Aug. 2020 .” <em>Encyclopedia.com</em>, Encyclopedia.com, 3 Sept. 2020,</p>\n<p><a href=\"http://www.encyclopedia.com/science/encyclopedias-almanacs-transcripts-and-maps/impact-european-\">www.encyclopedia.com/science/encyclopedias-almanacs-transcripts-and-maps/impact-european-</a> diseases-native-americans.</p>\n<p><em>Study.com</em>, study.com/academy/lesson/the-spanish-casta-system-definition-significance.html.</p>\n<p>“Las Castas – Spanish Racial Classifications.” <em>Native Heritage Project</em>, 15 June 2013, nativeheritageproject.com/2013/06/15/las-castas-spanish-racial-classifications/.</p>\n<p>Edward Telles and Liza Steele | February 21, 2012. “Racism in Latin America - Racial Identification Latin American Countries.” <em>Americas Quarterly</em>, <a href=\"http://www.americasquarterly.org/article/the-effects-of-skin-color-in-the-americas/\">www.americasquarterly.org/article/the-effects-of-skin-color-in-the-americas/.</a></p>",
            "image": "https://blog.thegenz.org/media/posts/44/Latin_America_Flag_Proposal-800x445.png",
            "author": {
                "name": "Ishan Vepa"
            },
            "tags": [
                   "#generations",
                   "#community"
            ],
            "date_published": "2020-09-04T09:10:02-04:00",
            "date_modified": "2020-09-04T09:10:02-04:00"
        },
        {
            "id": "https://blog.thegenz.org/inequality-is-not-a-political-debate.html",
            "url": "https://blog.thegenz.org/inequality-is-not-a-political-debate.html",
            "title": "Inequality is NOT a Political Debate",
            "summary": "I Look To The Day When People Will Not Be Judged By The Color of Their Skin, But By The Content of Their Character\" - Martin Luther King Jr. Equality has always been an issue for the human race. People are judged for their skin&hellip;",
            "content_html": "<blockquote>\n<p><i>I Look To The Day When People Will Not Be Judged By The Color of Their Skin, But By The Content of Their Character\"</i></p>\n<p><strong><i> - Martin Luther King Jr.</i></strong></p>\n</blockquote>\n<p><span style=\"font-weight: 400;\">Equality has always been an issue for the human race. People are judged for their skin color, gender, sexuality, social status, ethnicity, wealth, and much more. </span></p>\n<p><span style=\"font-weight: 400;\">The groups of people that fall on the “wrong side” of these topics, are considered a minority. Why, you ask? The answer is not simple. In fact, people have been asking this question for centuries. To be honest, there should not be an answer to this question. Actually, there should not even be a question at all. Everyone in the world should be treated equally. Wait…but then why is equality so controversial? </span></p>\n<p><span style=\"font-weight: 400;\">The issue of equality among different groups of people, especially over the last few months, has become a hot topic of debate among politicians. There are associations with different political parties on certain topics. For instance, in the recent Black Lives Matter protests it is believed that most of the people advocating for the cause are Democrats. Of course, this is just a stereotype. Why should it matter what political party you are when it comes to equal rights of African Americans? </span></p>\n<p><span style=\"font-weight: 400;\">The truth is…it shouldn’t. Some people are afraid to speak up about what they truly believe because they do not want to “get political.” However, the way I see it, the issue of Equality is not controversial. There should be no “Republicans vs. Democrats” when fighting for Equality. As a country, we need to unite together and combat these social issues together as one. With that being said, I decided to start this blog because I wanted to “break the barrier” about the controversial topics that I will be blogging about. In fact, nothing I will be posting is “controversial” or “political.” It is simply just the facts. On the other hand, I will be sharing my own personal beliefs on each of the topics. Although, my personal values will be reflected, none of my posts will highlight politics. As I previously stated, the issue of equality and the social injustices around the world do not exhibit a specific political party. So…how can you create social change without getting “political?” </span></p>\n<p><span style=\"font-weight: 400;\">For starters, do not make assumptions about different people’s political affiliation based on their stance in a social issue. By becoming more aware of your own personal views towards other people, you can become a better citizen and have your opinions be more respected by other people. Above all, demonstrate your beliefs clearly. State the problem that you want to be solved, and come up with a solution. I hope this helps to clear up some of the controversy that surrounds Equality!</span></p>",
            "image": "https://blog.thegenz.org/media/posts/43/blm-wm2020-protesters-500x442-01-Tia-Guay.jpg",
            "author": {
                "name": "Ishan Vepa"
            },
            "tags": [
                   "#society",
                   "#rights",
                   "#political",
                   "#mlk",
                   "#inequality",
                   "#generations",
                   "#community",
                   "#blacklivesmatter",
                   "#BLM"
            ],
            "date_published": "2020-09-04T09:10:02-04:00",
            "date_modified": "2020-09-04T09:10:02-04:00"
        },
        {
            "id": "https://blog.thegenz.org/is-voting-important.html",
            "url": "https://blog.thegenz.org/is-voting-important.html",
            "title": "Is Voting Important?",
            "summary": "Voting is a very crucial component of determining what can and can’t happen in your life. When people hear about voting, most people think, “Eh, I’m just one person, what can I do alone?”, when they should be thinking “The fact that I’m one more&hellip;",
            "content_html": "<p><span style=\"font-weight: 400;\">Voting is a very crucial component of determining what can and can’t happen in your life. When people hear about voting, most people think, “Eh, I’m just one person, what can I do alone?”, when they should be thinking “The fact that I’m one more person means that I can change what laws there are and things like who’ll be in office”. Voting is an individual act, but it’s also one of the most powerful things we can do, something that we get to decide without others forcing us to do what they want, and if need be, others don’t even get to know who/what you voted for if you don’t want them knowing.</span></p>\n<p><span style=\"font-weight: 400;\">In places like Australia, you will get fined if you don’t vote unless you have a valid reason not to. Every time you don’t vote, your fines get higher and higher to a point where you will end up being arrested, and I think this is actually a very good thing. What Australia is doing is forcing its people to use their voice, not deprive it, not hide it, but do what they think will be best for their future and others as well. Even if you don’t want to vote, you will and you will end up having to think about what you can do with your vote and who deserves it.</span></p>\n<p><span style=\"font-weight: 400;\">Many people know the power of voting, don’t vote, and then get angry when a law gets either passed or denied and/or when someone they didn’t want gets into office. America should make compulsory voting legal in the US because this would not only benefit the country as a whole with many new voters, but this would also make it so that politicians are forced to also address poorer communities and areas that have problems that are ignored. </span></p>\n<p><span style=\"font-weight: 400;\">An instance in which voting could’ve changed something so dramatic in the USA was when Donald Trump got elected. Out of the entire population, only 58.1% of the eligible voting population voted. Now just think about the other 41.9%, if they voted, Trump could’ve still won, or he could’ve lost. The fact that millions of Americans never voted though, means we’ll never know, and that many didn’t use their voice. Even if you’re doubtful about whether you’re doing the right thing or not, if you can, vote, at least you did something instead of nothing, and you could also learn from it for the better good.</span></p>\n<p><span style=\"font-weight: 400;\">People need to know that even as an individual person with just one vote, they are still incredibly powerful, and can do a lot. They’re not the only ones who think the way they do, and if people vote, they might feel like an individual who isn’t doing anything, but so are many millions just like them who took the initiative to vote. </span></p>\n<p class=\"align-center\"><span style=\"font-weight: 400;\">Voting can change so many things in a country, especially in places like America, where we have a Democratic Republic, a Constitution, and the Bill of Rights to protect our voices and our freedoms. Fighting for them and voting will keep them in place, change them, and with many new things being introduced, make a better tomorrow.</span></p>\n<hr>\n<p class=\"align-center\"><em><span style=\"font-weight: 400;\">Citations</span></em></p>\n<p><span style=\"font-weight: 400;\">Bureau, US Census. “Voting in America: A Look at the 2016 Presidential Election.” </span><i><span style=\"font-weight: 400;\">The United States Census Bureau</span></i><span style=\"font-weight: 400;\">, 10 May 2017, www.census.gov/newsroom/blogs/random-samplings/2017/05/voting_in_america.html.</span></p>\n<p><span style=\"font-weight: 400;\">“Compulsory Voting.” </span><i><span style=\"font-weight: 400;\">International IDEA</span></i><span style=\"font-weight: 400;\">, 2020, www.idea.int/data-tools/data/voter-turnout/compulsory-voting.</span></p>\n<p><span style=\"font-weight: 400;\">“Failure to Vote.” </span><i><span style=\"font-weight: 400;\">Western Australian Electoral Commission</span></i><span style=\"font-weight: 400;\">, www.elections.wa.gov.au/vote/failure-vote.</span></p>\n<p><span style=\"font-weight: 400;\">“Library Guides: Post-Election 2016 Recap &amp; Resources: Voter Turnout.” </span><i><span style=\"font-weight: 400;\">Voter Turnout - Post-Election 2016 Recap &amp; Resources - Library Guides at Penn State University</span></i><span style=\"font-weight: 400;\">, 14 Aug. 2020, guides.libraries.psu.edu/post-election-2016/voter-turnout.</span></p>\n<p dir=\"ltr\"><span style=\"font-weight: 400;\">National Geographic Society. “Why Voting Is Important.” </span><i><span style=\"font-weight: 400;\">National Geographic Society</span></i><span style=\"font-weight: 400;\">, 17 Mar. 2020, www.nationalgeographic.org/article/why-voting-important/.</span></p>",
            "image": "https://blog.thegenz.org/media/posts/42/element5-digital-ls8Kc0P9hAA-unsplash.jpg",
            "author": {
                "name": "Ishan Vepa"
            },
            "tags": [
                   "#vote",
                   "#society",
                   "#political"
            ],
            "date_published": "2020-09-04T09:10:02-04:00",
            "date_modified": "2020-09-04T09:10:02-04:00"
        },
        {
            "id": "https://blog.thegenz.org/energy-vampires-and-their-impact-on-biodiversity.html",
            "url": "https://blog.thegenz.org/energy-vampires-and-their-impact-on-biodiversity.html",
            "title": "Energy Vampires and their Impact on Biodiversity",
            "summary": "Our planet is undergoing a massive wave of extinction. Most of it is because of our doing. In order to help fix the problems that we are creating, increasing biodiversity will be a huge factor. What is biodiversity? It is the size of each population&hellip;",
            "content_html": "<p class=\"msg msg--highlight  align-center\"><strong><em>Our planet is undergoing a massive wave of extinction. Most of it is because of our doing. In order to help fix the problems that we are creating, increasing biodiversity will be a huge factor. </em></strong></p>\n<p><span style=\"font-weight: 400;\">What is biodiversity? It is the size of each population of each species on Earth. The higher amount of diversity in an ecosystem, the more biodiversity there is in an area. This also helps the food web, since more animals would have more food sources, increasing the population number.</span></p>\n<p><span style=\"font-weight: 400;\">There are many ways that you can help the environment. One way is by reducing Vampire Power Drains around your household. Vampire power drains are when power is being used by objects that are plugged in, even when they are not being used. These objects include the TV, lamps and even the charger to the phone (regardless if you still have your phone plugged in).</span></p>\n<p><span style=\"font-weight: 400;\">This method of helping biodiversity because it not only helps the environment, but it also helps your electricity bill (more on that later). Also, it is easy to do and not time consuming. It does not take much energy to unplug the things around you when you don't use them. Plus, there is no time limit to do it in, as it does not require many lifestyle changes. </span></p>\n<p><span style=\"font-weight: 400;\">There is no time frame, so if you think about the choices you are making, this method works well. Even if you forget to do this once or twice, you can always do this method without prior commitments.</span></p>\n<p><span style=\"font-weight: 400;\">As I said in the beginning, this method helps both you and the environment. The small amount of energy that is being used every time you keep a plug into an outlet without using it costs you some money. Over time the amount of money adds up, saving you a ton! In America, $3 billion could be saved each year just from Vampire Energy! This also equates to a small amount of carbon dioxide in the atmosphere. It also adds up to be a lot of carbon dioxide in the atmosphere.</span></p>\n<p><span style=\"font-weight: 400;\">The carbon dioxide helps warm the atmosphere (also called global warming), which warms the oceans. This kills many organisms that need a specific temperature to survive. The carbon dioxide is absorbed into the oceans, making them acidic, which kills even more organisms. Trying to lessen the amount of carbon dioxide would help this problem. Your electricity bill would also be helped, as the small amount of money saved each time you don't use the energy adds up. </span></p>\n<p><span style=\"font-weight: 400;\">There are many different problems that vampire energy solves. For example the 25% of energy use is from the things that are plugged in, even when they are not used. Most electronics are kept in a standby mode, which allows you to use them quickly. These things suck the energy from your house, causing you to lose money. The United States consumes 26% of the world's energy! And 5% of that huge amount is JUST from the vampire energy. The huge amount could be reduced from unplugging the things you don't use!</span></p>\n<p><span style=\"font-weight: 400;\">Being mindful of vampire energy can help both your daily life and the environment. It saves you money and it helps decrease the amount of carbon dioxide in the atmosphere. In your daily life, keep a lookout for these vampire energy drains! Your bank account and the environment will thank you!</span></p>\n<hr>\n<p class=\"align-center\"><span style=\"font-weight: 400;\"><em>Citations</em></span></p>\n<p><span style=\"font-weight: 400;\"><br></span><a href=\"https://www.khanacademy.org/computer-programming/link_redirector?url=https%3A%2F%2Fwww.energy.gov%2Fenergysaver%2Farticles%2Fenergy-vampires-are-attacking-your-home-here-s-how-stop-them\"><span style=\"font-weight: 400;\">“Energy Vampires Are Attacking Your Home – Here's How to Stop Them.” Energy.gov, </span></a><a href=\"http://www.energy.gov/energysaver/articles/energy-vampires-are-attacking-your-home-here-s-how-stop-them\"><span style=\"font-weight: 400;\">www.energy.gov/energysaver/articles/energy-vampires-are-attacking-your-home-here-s-how-stop-them</span></a><a href=\"https://www.khanacademy.org/computer-programming/link_redirector?url=https%3A%2F%2Fwww.energy.gov%2Fenergysaver%2Farticles%2Fenergy-vampires-are-attacking-your-home-here-s-how-stop-them\"><span style=\"font-weight: 400;\">.</span></a></p>\n<p><a href=\"https://www.khanacademy.org/computer-programming/link_redirector?url=https%3A%2F%2Felectronics.howstuffworks.com%2Feveryday-tech%2Fvampire-power.htm\"><span style=\"font-weight: 400;\">Lamb, Robert. “How Vampire Power Works.” HowStuffWorks, HowStuffWorks, 4 June 2008, electronics.howstuffworks.com/everyday-tech/vampire-power1.htm.</span></a></p>\n<p><a href=\"https://www.khanacademy.org/computer-programming/link_redirector?url=https%3A%2F%2Fmedium.com%2F%40heoegema%2Fcoding-for-absolute-beginners-choose-your-own-adventure-tutorial-3613182c6097\"><span style=\"font-weight: 400;\">Oegema, Holly. “Coding For Absolute Beginners: Choose Your Own Adventure Tutorial.” Medium, Medium, 2 Dec. 2017, medium.com/@heoegema/coding-for-absolute-beginners-choose-your-own-adventure-tutorial-3613182c6097.</span></a></p>\n<p><a href=\"https://www.khanacademy.org/computer-programming/link_redirector?url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DjgjQJdsySrM\"><span style=\"font-weight: 400;\">sfdungeon. “RACING EXTINCTION.” YouTube, YouTube, 30 June 2017, www.youtube.com/watch?v=jgjQJdsySrM.</span></a></p>",
            "image": "https://blog.thegenz.org/media/posts/41/plug-socket-electric-electricity-energy-power-cord-outlet-hand.jpg",
            "author": {
                "name": "Ishan Vepa"
            },
            "tags": [
                   "#tech",
                   "#energy"
            ],
            "date_published": "2020-09-04T09:10:02-04:00",
            "date_modified": "2020-09-04T09:10:02-04:00"
        },
        {
            "id": "https://blog.thegenz.org/puppets-no-longer-the-hypocrisy-of-political-parties.html",
            "url": "https://blog.thegenz.org/puppets-no-longer-the-hypocrisy-of-political-parties.html",
            "title": "Puppets No Longer: The Hypocrisy of Political Parties",
            "summary": "Hypocrisy: a feigning to be what one is not or to believe what one does not: behavior that contradicts what one claims to believe or feel (Merriam Webster) In the political climate that is the United States of America, we are no strangers to political&hellip;",
            "content_html": "<p class=\"post__lead dropcap\"><span style=\"font-weight: 400;\">Hypocrisy: </span><span style=\"font-weight: 400;\">a feigning to be what one is not or to believe what one does not: behavior that contradicts what one claims to believe or feel (Merriam Webster)</span></p>\n<p><span style=\"font-weight: 400;\">In the political climate that is the United States of America, we are no strangers to political parties (nominally the two major ones; Republicans and Democrats) being quite divisive on an array of issues. Ranging from gun control to welfare to immigration to mask-wearing to you name it. Often we find if Republicans believe one thing, Democrats are inclined to believe the opposite, and vice versa. While most can not see it at face value, this is very much a dangerous thing as this can cause political parties to contradict themselves in what they say and do and be hypocritical in what they believe in order to be divisive, because divisiveness is what keeps party loyalty and gets the votes. </span></p>\n<p><span style=\"font-weight: 400;\">It is important to note that it is quite easy for these divisive political ideologies to infect the minds of the people. We live in a world where it seems you have to choose a side because Republicans and Democrats are “sworn enemies” on every issue. We are told to pick a side and if we do not pick a side and believe in everything that side believes in, we are automatically traitors to the political party we align ourselves with and to America as a whole. </span></p>\n<p><span style=\"font-weight: 400;\">Generalizations can help and can hurt. We should never generalize a person or a group of people based on any factor, we should always hear out. For example, just because someone is a registered Republican that does not mean they are not for more gun control or a Democrat could be pro-life. However, certain generalizations must be concluded about these political parties and their ideologies as it points out their hypocritical nature. It is this hypocritical nature that is derived from the fact that these political parties must be “sworn enemies” and divisive on every issue, even at the expense of compromising and contradicting themselves and being hypocritical. This is all done in order to get the vote, to make Americans choose a side lest they be traitors to party and to America itself. It is this hypocritical, divisive mindset that is tearing America apart and harming more than helping. </span></p>\n<p><span style=\"font-weight: 400;\">And no better an example to discuss this is the abortion debate.</span></p>\n<p><span style=\"font-weight: 400;\">As a pro-life American whose pro-lifeness is hinged on my relationship with Christ (I am a Christian), I will point out the hypocrisy of the Republican party first when it comes to this debate. </span></p>\n<p><span style=\"font-weight: 400;\">Typically, Republican ideology tilts towards the pro-life side of this debate. They argue for the sanctity of life and how life in the womb matters and must be preserved. They argue it is murderous and vile. Yet, the same party that argues for the sanctity of life has a leader that wants to build a wall to keep life out. They argue for the sanctity of life in the womb, only as long as that womb or person is a U.S. citizen. Who cares about the people trying to find safety and life from drug cartels or violence or to just have a better life than the one they came from? The only precious life is the one within the borders of the U.S. </span></p>\n<p><span style=\"font-weight: 400;\">Being pro-life means being pro-immigrant lives, pro-black lives, pro-”anything that is a human life”. Anyways, let us move on…. </span></p>\n<p><span style=\"font-weight: 400;\">Before I discuss the Democratic view, I would like to point out a stat I read from a New York Times article where it was found that “</span><span style=\"font-weight: 400;\"> black women continue to have the highest abortion rate at 27.1 per 1,000 women compared with 10 per 1,000 for white women, </span><a href=\"https://ajph.aphapublications.org/doi/10.2105/AJPH.2017.304042\"><span style=\"font-weight: 400;\">according to a study</span></a><span style=\"font-weight: 400;\"> published in the American Journal of Public Health.” (Eligon) As to why this is? Another quote from the same article gives some insight, “</span><span style=\"font-weight: 400;\">In many black communities, the abortion debate is inextricably tied to race in ways that white communities seldom confront. Social and economic disparities that are particularly challenging to African-Americans, from mass incarceration to maternal and infant mortality, are crucial parts of that discussion,” (Eligon). </span></p>\n<p><span style=\"font-weight: 400;\">Democrats tend to be pro-choice in the abortion debate, meaning they tend to advocate for abortion and the right to have one. As well, it is typically Democrats who are more progressive in their thinking and they spearhead social justice movements in our democracy, especially when it comes to race. However, there is an issue. The same party that spearheads social justice for black Americans also advocates for a practice that affects black women at a rate of almost 3 to 1. In the same breath, they advocate for ways to end systemic racism but also advocate for a practice that feeds off of systemic racism and is killing the future black leaders of American more than the white ones. </span></p>\n<p><span style=\"font-weight: 400;\">These political parties are willing to contradict themselves in what they say and believe and be hypocritical in order to appear divisive. They claim and appear to be the protectors of “life and justice”, but contradict themselves and are another thing entirely. This is all done to be divisive, to get the vote, and make Americans pick a side and believe everything that side believes, lest they be traitors to party and to country.</span></p>\n<p><span style=\"font-weight: 400;\">I say these things not out of hate nor anger, but out of love for country and love for every human in and outside this country. As a Christ-follower, it is my humble belief that I put Christ first in my life and in doing so I show love to as many people as possible. </span></p>\n<p><span style=\"font-weight: 400;\">We as Americans are being politically divided, and it is doing a lot more harm than good. </span></p>\n<p><span style=\"font-weight: 400;\">We as American people must be able to think as individuals and come up with opinions that are based on facts and our love and care for other humans, not based on political allegiance. And in doing so we must reach a place where we do not hate each other for our opinions. A Republican should be able to believe in gun control, a Democrat should be able to be pro-life, and both not be hated for it. People should be able to make opinions on issues based on facts and love for one another and not based on whether they say Biden or Trump 2020 and not have to be hated for it.  And in making these opinions, we must reach a place where we can discuss such opinions in a loving, caring, gentle, respectful manner in where we can make compromises that help as many people as possible. Where we can disagree with one another, but still have a respectful conversation about our disagreement. </span></p>\n<p><span style=\"font-weight: 400;\">Our goal should be able to come up with opinions on issues as individuals who care for and love their country and care for and love people as a whole, to make opinions while considering the facts and how this may positively or negatively affect people in real life, to respectfully and gently discuss our opinions and try to come up with solutions and compromises that help as many people as possible, and to not be puppets for these political machines any longer.</span></p>\n<hr>\n<p class=\"align-center\"><em>Citations</em></p>\n<p><span style=\"font-weight: 400;\">Eligon, John. “When ‘Black Lives Matter’ Is Invoked in the Abortion Debate.” The New York Times, 6 July. 2019, </span><a href=\"https://www.nytimes.com/2019/07/06/us/black-abortion-missouri.html\"><span style=\"font-weight: 400;\">https://www.nytimes.com/2019/07/06/us/black-abortion-missouri.html</span></a></p>\n<p><span style=\"font-weight: 400;\">Merriam Webster. “Definition of Hypocrisy.” </span><a href=\"https://www.merriam-webster.com/dictionary/hypocrisy\"><span style=\"font-weight: 400;\">https://www.merriam-webster.com/dictionary/hypocrisy</span></a><span style=\"font-weight: 400;\">. Accessed August 15, 2020</span></p>",
            "image": "https://blog.thegenz.org/media/posts/40/partisan_voters-2e3fb6e73c661b938f4003c9fc8669e7be01010e-s800-c85.jpg",
            "author": {
                "name": "Ishan Vepa"
            },
            "tags": [
                   "#political",
                   "#oped"
            ],
            "date_published": "2020-09-04T09:10:02-04:00",
            "date_modified": "2020-09-04T09:10:02-04:00"
        },
        {
            "id": "https://blog.thegenz.org/climate-change-is-affecting-our-health.html",
            "url": "https://blog.thegenz.org/climate-change-is-affecting-our-health.html",
            "title": "Climate Change is Affecting Our Health",
            "summary": "When you hear “climate change”, you might think about polar bears and melting icebergs. And you’re right. Climate change is occurring because of the effects of global warming. We see changes in ecosystems and sea levels. But climate change affects so many more aspects of&hellip;",
            "content_html": "<p><span style=\"font-weight: 400;\">When you hear “climate change”, you might think about polar bears and melting icebergs. And you’re right. Climate change is occurring because of the effects of global warming. We see changes in ecosystems and sea levels. But climate change affects so many more aspects of society. </span></p>\n<p><span style=\"font-weight: 400;\">For example, extreme heat is a major problem in Florida, including Tallahassee. If you’ve gone outside at all this summer, you can understand what I’m talking about. Why is extreme heat a problem? Heat-related illnesses such as heat exhaustion and heat stroke are exacerbated because of global warming. These illnesses can be fatal, so it is best to avoid dangerously high temperatures. Unfortunately, Florida is expected to have many more “danger days”, where temperatures are above 103℉, in the coming years. Furthermore, there are people that cannot avoid the heat. Those who rely on public transportation, biking, or walking may not have access to cooler areas. Last summer, I had to take the bus pretty much everywhere: the gym, school, Publix. It was definitely hard to find shade, and I tried to avoid standing in the sun for too long.</span></p>\n<p><span style=\"font-weight: 400;\">Also, construction workers, farmers, and athletes face the same struggle, because their jobs are outdoors in the heat. I’m in my high school’s marching band, and the season usually starts in July. We have to be careful when we rehearse because of the risk of heat-related illness. </span></p>\n<p><span style=\"font-weight: 400;\">Another result of extreme heat is the increase in vectors. Vectors are organisms that commonly transmit diseases, such as malaria and Ebola. Mosquitoes, ticks, and other vectors thrive in warmer, more humid weather. Seeing an increase in these vectors would cause an increase in vector-borne diseases. This directly impacts poor communities, because they are the most vulnerable to outbreaks and less access to good healthcare. I remember the Zika Virus arriving in Florida in 2016, and this is a vector-borne disease. While its impact then was minimal, the effects of global warming would change the outcome if Zika was to make a comeback. Seeing how the U.S. poorly handled this coronavirus pandemic, I worry about prevention and preparedness of future virus outbreaks.</span></p>\n<p><span style=\"font-weight: 400;\">Speaking of coronavirus, respiratory diseases are definitely made worse because of climate change. Poor air quality and air pollution makes breathing a lot harder than it should be, and so do respiratory illnesses. Myself, my family members, and many friends of mine have asthma, so it is pretty common. The combination of poor air quality and respiratory disease creates unfortunate living situations for many. Minority and low-income communities are especially vulnerable. Black and Hispanic children are much more likely to be affected by asthma, and also are more likely to be living near air pollution. Not to mention the lack of access to quality healthcare in these same communities. </span></p>\n<p><span style=\"font-weight: 400;\">There are solutions to the problems that I have mentioned. Tackling climate change head on requires commitment to decreasing fossil fuel emissions and transitioning to renewable energy sources, like solar and wind power. Florida has great potential for both of these. Also, increased tree canopy or shade coverings in biking areas, parks, and bus stops would be ideal for summertime. Tallahassee’s bus system is due for an update. Finally, making good healthcare more accessible for all people is absolutely necessary. </span></p>\n<p class=\"align-center msg msg--highlight \"><em><strong>All of these solutions are feasible, and we must let our elected officials know about the issues at hand.</strong></em></p>",
            "image": "https://blog.thegenz.org/media/posts/39/pexels-jeanchristophe-andre-2574983.jpg",
            "author": {
                "name": "Ishan Vepa"
            },
            "tags": [
                   "#science",
                   "#oped",
                   "#environment",
                   "#climatechange",
                   "#climate"
            ],
            "date_published": "2020-09-04T09:10:02-04:00",
            "date_modified": "2020-09-04T09:10:02-04:00"
        },
        {
            "id": "https://blog.thegenz.org/the-cultural-appropriation-of-yoga.html",
            "url": "https://blog.thegenz.org/the-cultural-appropriation-of-yoga.html",
            "title": "The Cultural Appropriation of Yoga",
            "summary": "Yoga. Most of us have heard of it by now. Practiced by nearly thirty-six million Americans and celebrities to the likes of Robert Downey Junior, Matthew McConaughey, and Madonna, Yoga has become a quintessential and popular lexicon of American popular culture and life. A twelve-billion-dollar&hellip;",
            "content_html": "<div class=\"freebirdFormviewerViewNumberedItemContainer\">\n<div class=\"freebirdFormviewerViewItemsItemItem freebirdFormviewerViewItemsTextTextItem\" role=\"listitem\" data-required=\"true\" data-item-id=\"2103454292\">\n<div class=\"freebirdFormviewerViewItemsTextTextItemContainer\">\n<div class=\"freebirdFormviewerViewItemsTextLongText freebirdFormviewerViewItemsTextDisabledText freebirdThemedInput\">\n<p><span style=\"font-weight: 400;\">Yoga. Most of us have heard of it by now. Practiced by nearly thirty-six million Americans and celebrities to the likes of Robert Downey Junior, Matthew McConaughey, and Madonna</span><span style=\"font-weight: 400;\">, Yoga has become a quintessential and popular lexicon of American popular culture and life. A twelve-billion-dollar industry and growing, </span><span style=\"font-weight: 400;\">Yoga is no doubt a massive part of America's fitness industry and of our economy. Yet as the popularity of Yoga has continued to grow, the true essence and purpose of it has begun to deteriorate.</span></p>\n<hr>\n<p><span style=\"font-weight: 400;\">Yoga originated in the Indian subcontinent thousands of years ago. An important aspect of Hindu and later Jain and Buddhist Culture, Yoga was described in the Vedas and later in the Patanjali Yoga Sutra as a method to attain mental clarity and self-realization. The west was introduced to Yoga in the late 19th century by the Hindu monk Swami Vivekananda</span><span style=\"font-weight: 400;\">. A disciple of the mystic Sri Ramakrishna, Vivekananda eloquently described the prowess one could gain through the diligence and practice of physical Yoga as well as things such as Bhakti Yoga, Jnana Yoga and Karma Yoga, the yoga of devotion, knowledge and work respectively.</span></p>\n<hr>\n<p><span style=\"font-weight: 400;\">Yoga is intrinsically a pillar of Hinduism, as stated by the journal Hinduism Today</span><span style=\"font-weight: 400;\"> \"The roots of yoga, its scriptural origins, are Hindu. The stem of yoga, its practice, is Hindu; and the flower of yoga, mystical union with God, is Hindu. Yoga, in its full glory, is entirely Hindu.\" This reality has been accepted by leaders of religious institutions, but the behemoth that is the American fitness industry has taken a different approach to market yoga— rebranding it.</span></p>\n<p><span style=\"font-weight: 400;\">The United States has thousands of Yoga Studios, yet of these studios very few acknowledge the origins of Yoga. My mother, a certified Yoga teacher and member of a national yoga teacher association</span><span style=\"font-weight: 400;\">, indicated that her course content stated that Yoga was an \"ancient\" practice. No mention of India. No mention of Hinduism and no mention of the significance the practice of Yoga has to billions of Hindus. Apparently, the course had gone on to discuss explicitly Hindu ideas such as those of the \"Chakras\" yet again referred to them as \"ancient.\" This is what is the most concerning. Practicing Yoga and refusing to acknowledge the roots of it is cultural appropriation, plain and simple.</span></p>\n<p><span style=\"font-weight: 400;\">Just like many aspects of African American and Black Culture, Yoga has been taken and repurposed to serve a different audience all while forgetting to attribute proper credit. Yet as Sanskrit words such as \"Mukha Svanasana\" and \"Ananda Balasana\" are appropriated into terms such as \"downward dog\" and \"happy baby\" we must remember that erasing something doesn’t make it our own. Instead, let’s try to recognize the contributions made in our life not just by the Hindu monks that developed the practice of Yoga thousands of years ago, but also by the people of all cultures and backgrounds who have developed the things that shape our lives. </span></p>\n<hr>\n<p class=\"align-center\"><em>Citations</em></p>\n<p><span style=\"font-weight: 400;\"> </span><span style=\"font-weight: 400;\"><a href=\"https://www.womenshealthmag.com/uk/fitness/a708863/celebrities-who-do-yoga/\">https://www.womenshealthmag.com/uk/fitness/a708863/celebrities-who-do-yoga/</a><a href=\"https://www.womenshealthmag.com/uk/fitness/a708863/celebrities-who-do-yoga/\"></a></span></p>\n<p><span style=\"font-weight: 400;\"><a href=\"https://www.ibisworld.com/united-states/market-research-reports/pilates-yoga-studios-industry/#:~:text=trends%20outlined%20above.-,Pilates%20%26%20Yoga%20Studios%20in%20the,industry%20trends%20(2014%2D2019)&amp;text=Furthermore%2C%20an%20estimated%2080.0%20million,of%205.1%25%20to%20%2412.8%20billion\">https://www.ibisworld.com/united-states/market-research-reports/pilates-yoga-studios-industry/#:~:text=trends%20outlined%20above.-,Pilates%20%26%20Yoga%20Studios%20in%20the,industry%20trends%20(2014%2D2019)&amp;text=Furthermore%2C%20an%20estimated%2080.0%20million,of%205.1%25%20to%20%2412.8%20billion</a><a href=\"https://www.ibisworld.com/united-states/market-research-reports/pilates-yoga-studios-industry/#:~:text=trends%20outlined%20above.-,Pilates%20%26%20Yoga%20Studios%20in%20the,industry%20trends%20(2014%2D2019)&amp;text=Furthermore%2C%20an%20estimated%2080.0%20million,of%205.1%25%20to%20%2412.8%20billion.\">.</a></span></p>\n<p><span style=\"font-weight: 400;\"><a href=\"https://www.bbc.com/news/magazine-21045281\">https://www.bbc.com/news/magazine-21045281</a><a href=\"https://www.bbc.com/news/magazine-21045281\"></a></span></p>\n<p><span style=\"font-weight: 400;\"><a href=\"https://www.hinduismtoday.com/modules/smartsection/item.php?itemid=5673\">https://www.hinduismtoday.com/modules/smartsection/item.php?itemid=5673</a><a href=\"https://www.hinduismtoday.com/modules/smartsection/item.php?itemid=5673\"></a></span></p>\n<p><a href=\"https://www.yogaalliance.org/\"><span style=\"font-weight: 400;\">https://www.yogaalliance.org/</span></a></p>\n</div>\n</div>\n</div>\n</div>",
            "image": "https://blog.thegenz.org/media/posts/38/Yoga-Ananda-Chatterjee.jpg",
            "author": {
                "name": "Ishan Vepa"
            },
            "tags": [
                   "#popculture",
                   "#infrastructure",
                   "#culture"
            ],
            "date_published": "2020-09-04T09:10:02-04:00",
            "date_modified": "2020-09-04T09:10:02-04:00"
        },
        {
            "id": "https://blog.thegenz.org/shedding-racism-in-america-one-layer-at-a-time.html",
            "url": "https://blog.thegenz.org/shedding-racism-in-america-one-layer-at-a-time.html",
            "title": "Shedding Racism in America, One Layer at a Time",
            "summary": "Simply put, it is impossible to support racist actions and behavior because of how racism presents itself. Racism is one of the most unjustifiable qualities of humankind since the dawn of time. It is nothing but a generalization of hatred and discrimination against people of&hellip;",
            "content_html": "<p class=\"msg msg--highlight \"><em><strong>Simply put, it is impossible to support racist actions and behavior because of how racism presents itself. </strong></em></p>\n<p><span style=\"font-weight: 400;\">Racism is one of the most unjustifiable qualities of humankind since the dawn of time. It is nothing but a generalization of hatred and discrimination against people of a race based on information untrue to most people in that race. For example, non-black people may view blacks as inferior because they see multiple scenarios of blacks being culprits of crimes on the news. These scenarios become general stereotypes which only make up a small percentage of that race. Arguably the worst instances of racism are when authoritative or crucial decisions are made against people of a certain race, especially when said people are punished harshly for petty crimes, or even, no real crime at all. For the past few months, police brutality against blacks has become one of America’s greatest issues, sparking multiple riots nationwide. </span></p>\n<p><i><span style=\"font-weight: 400;\">But after all these centuries of discrimination against blacks, why does police brutality still exist in society today?</span></i></p>\n<p><span style=\"font-weight: 400;\">To answer this question, it is necessary to understand how racism came to be and how its analogous “layers” have been shed over time. Up until the Renaissance period, there had not actually been nearly as much racism found in comparison to the highly racist future that would soon come to be. In the early seventeenth century, Europeans started coming into contact with people of darker skin during the Renaissance, which was how they first came across the idea of colored people being inferior. They kidnapped several Africans and exploited them to work as servants, with the first slaves arriving in the American colonies in 1619. For over two hundred years, the number of slaves in the nation grew to four million.</span></p>\n<p><span style=\"font-weight: 400;\">It wasn’t until the Civil War in the 1860s when slavery was abolished. President Lincoln’s Emancipation Proclamation essentially gave the four million slaves freedom once the Union won the war against the pro-slavery Confederates. But while this was the end of slavery, this was absolutely </span><i><span style=\"font-weight: 400;\">not</span></i><span style=\"font-weight: 400;\"> the end of racism, especially towards blacks. For another one hundred years, whites and people of color were segregated in nearly every aspect of life, including education, seating on public buses, public bathrooms, and more. In the 1960s, segregation was finally put to an end. Since then, people of all colors and races in America were made equal. But, yet again, this was not the end of racism.</span></p>\n<p><span style=\"font-weight: 400;\">While everyone in America has been </span><i><span style=\"font-weight: 400;\">technically</span></i><span style=\"font-weight: 400;\"> considered equal (in the sense that everyone in the US or is a citizen has equal voting rights, same laws to follow, etc.) the stigma against blacks still remains inside certain people’s minds, and is yet another layer that must be shed. Unfortunately, that includes people in law enforcement. For so many years, blacks have been taking worse punishments (and even getting killed) by the police far more often than other races for similar crimes, and it absolutely should not be the case. At that point, everyone’s equality doesn’t matter if certain people are being killed by the police for trivial crimes--and the more horrifying truth--</span><i><span style=\"font-weight: 400;\">no crime at all</span></i><span style=\"font-weight: 400;\">.</span></p>\n<p><span style=\"font-weight: 400;\">Essentially, police (especially white ones) are trying to take care of problems by generalizing blacks as the enemy. Perhaps the most prominent incident was George Floyd’s death on May 25, 2020, where Floyd was arrested after passing a counterfeit $20 bill at a grocery store, and was killed by officer Derek Chauvin later. Chauvin killed him by inflicting eight minutes and forty-six seconds of complete torture to Floyd and everyone watching. For that amount of time, Floyd couldn’t breathe as Chauvin put his knee to Floyd’s neck.</span></p>\n<p><span style=\"font-weight: 400;\">Seeing as how many similar incidents there were and the countless riots and protests across the nation, it is clear these acts of police brutality are supposed to be a problem of the past. They do not and did not have any justifiable place in our society. So, in order to get rid of these acts forever, should the police be defunded? That is a very controversial topic, but ultimately, defunding the police would allow for a fresh start with a brand new law enforcement system. Also, the money that once went to police can now be used to help other causes.</span></p>\n<p><span style=\"font-weight: 400;\">Now, you may be wondering, </span><i><span style=\"font-weight: 400;\">what does police brutality have to do with America’s history of slavery and segregation?</span></i><span style=\"font-weight: 400;\"> Essentially, police brutality is just another unjustifiable form of racism that has no right nor reason to exist in the modern world. Slavery and racial segregation are two forms of racism that have been long gone in America. It’s like a layer of racism that remains after the more racist layer surrounding it was removed. The core of racism is something that cannot be destroyed, unfortunately, because there will </span><i><span style=\"font-weight: 400;\">always</span></i><span style=\"font-weight: 400;\"> be racist people out there (albeit the core has no real impact on an entire society). But just for right now, America needs to find out a way that would ultimately shed the layer of police brutality. Once that happens, it will be just as important and iconic as the moments in history when slavery was abolished and when America became desegregated. Slavery, racial segregation, and police brutality are three layers of unjustifiable racism that shall never be seen in America (and hopefully, the rest of the world) again.</span></p>\n<hr>\n<p class=\"align-center\"><em>Citations</em></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">Fredrickson, George M. “RACE - The Power of an Illusion . Background Readings.” </span><i><span style=\"font-weight: 400;\">PBS</span></i><span style=\"font-weight: 400;\">, Public Broadcasting Service, 2003, www.pbs.org/race/000_About/002_04-background-02-01.htm.</span></p>\n<p><span style=\"font-weight: 400;\">History.com Editors. “Slavery in America.” </span><i><span style=\"font-weight: 400;\">History.com</span></i><span style=\"font-weight: 400;\">, A&amp;E Television Networks, 12 Nov. 2009, </span><a href=\"http://www.history.com/topics/black-history/slavery#section_4\"><span style=\"font-weight: 400;\">www.history.com/topics/black-history/slavery#section_4</span></a><span style=\"font-weight: 400;\">.</span></p>\n<p><span style=\"font-weight: 400;\">Ray, Rashawn. “What Does 'Defund the Police' Mean and Does It Have Merit?” Brookings, 19 June 2020, </span><a href=\"http://www.brookings.edu/blog/fixgov/2020/06/19/what-does-defund-the-police-mean-and-does-it-have-merit/\"><span style=\"font-weight: 400;\">www.brookings.edu/blog/fixgov/2020/06/19/what-does-defund-the-police-mean-and-does-it-have-merit/</span></a><span style=\"font-weight: 400;\">.</span></p>\n<p><span style=\"font-weight: 400;\">Taylor, Steve. “The Psychology of Racism.” </span><i><span style=\"font-weight: 400;\">Psychology Today</span></i><span style=\"font-weight: 400;\">, Sussex Publishers, 19 Jan. 2018, www.psychologytoday.com/us/blog/out-the-darkness/201801/the-psychology-racism.</span></p>",
            "image": "https://blog.thegenz.org/media/posts/37/GettyImages-1216621108CROP-1024x683-Ahvan-Misra.jpg",
            "author": {
                "name": "Ishan Vepa"
            },
            "tags": [
                   "#society",
                   "#inequality",
                   "#community",
                   "#blacklivesmatter",
                   "#BLM"
            ],
            "date_published": "2020-09-04T09:10:02-04:00",
            "date_modified": "2020-09-04T09:10:02-04:00"
        },
        {
            "id": "https://blog.thegenz.org/social-comparison-and-social-media-helpful-or-harmful.html",
            "url": "https://blog.thegenz.org/social-comparison-and-social-media-helpful-or-harmful.html",
            "title": "Social Comparison and Social Media: Helpful or Harmful?",
            "summary": "Social comparison, primarily in social media, is an issue that youth have to tackle everyday. Not only have I heard about this topic, I have experienced it. Social media often portrays unrealistic beauty and lifestyle standards that kids and teens think they are expected to&hellip;",
            "content_html": "<p><span style=\"font-weight: 400;\">Social comparison, primarily in social media, is an issue that youth have to tackle everyday. Not only have I heard about this topic, I have experienced it. Social media often portrays unrealistic beauty and lifestyle standards that kids and teens think they are expected to live up to. Along with social media there are major comparisons in school, sports, economic status, and more. I believe that there are things we can do to lessen this comparison and therefore relieve stress and anxiety. </span></p>\n<p><span style=\"font-weight: 400;\">Social media is arguably one of the biggest influences in a teenager and young adult's life. Although there are other aspects of comparison in today's fast paced society, I believe that social media has the greatest effect on youth. Everyday there is a new “trend” or style that gets millions of views in a matter of seconds. Fun TikTok dances or new makeup styles are great examples. It can be damaging to a developing mind to constantly be compared to people who have millions of followers or what society says is the “perfect body type”. I am not trying to take away from the positive opportunities on these platforms however, I think that there are ways we can improve these platforms to be more positive and welcoming rather than judgmental and comparable. Whether it is the clothes you wear, the sports you play, or the vacations you go on, people will see those posts and compare you to someone or something without even intending to. Seeing posts about a party you weren’t invited to could have negative effects on your mental health. I think that we have grown up to compare people based on what we see and hear about them rather than making our own opinions about them. Studies have shown that about 25% of teens have said that the effects of social media are mostly negative. This needs to change.</span></p>\n<p><span style=\"font-weight: 400;\">To lessen the stress and anxiety that are caused by comparison we need to change how we think. We are raised to be competitive in today's society and that is okay. Posting to put others down, however, is far from okay. On social media if you see something, say something! These platforms are also a great place to boost each other's confidence and encourage positivity. Together we can create a society to decrease the social comparison in youth today.</span></p>\n<hr>\n<p class=\"align-center\"><span style=\"font-weight: 400;\"><em>Citations</em></span></p>\n<p><span style=\"font-weight: 400;\">Anderson M, Jiang J. Teens, social media &amp; technology 2018. Pew Research Center. 2018; 31:2018.</span></p>\n<p><span style=\"font-weight: 400;\">Mir, Elina, et al. “Social Media and Adolescents' and Young Adults' Mental Health.” </span><i><span style=\"font-weight: 400;\">National Center for Health Research</span></i><span style=\"font-weight: 400;\">, 16 July 2020, www.center4research.org/social-media-affects-mental-health/.</span></p>",
            "image": "https://blog.thegenz.org/media/posts/36/op-ed-image-Maya-Bubolz.jpg",
            "author": {
                "name": "Ishan Vepa"
            },
            "tags": [
                   "#youth",
                   "#society",
                   "#socialmedia",
                   "#mentalhealth",
                   "#global"
            ],
            "date_published": "2020-09-04T09:10:02-04:00",
            "date_modified": "2020-09-04T09:10:02-04:00"
        },
        {
            "id": "https://blog.thegenz.org/americas-problem-with-race-an-in-depth-look-at-racism-and-the-civil-rights-movement-in-america.html",
            "url": "https://blog.thegenz.org/americas-problem-with-race-an-in-depth-look-at-racism-and-the-civil-rights-movement-in-america.html",
            "title": "America&#x27;s Problem with Race: An In-depth Look at Racism and the Civil Rights Movement in America",
            "summary": "This took a long time to write. I wanted this article to be as unbiased as possible and to appropriately and correctly explain and represent the views of the groups involved in the recent events. “On Memorial Day, the police in Minneapolis killed George Floyd,&hellip;",
            "content_html": "<p class=\"msg msg--highlight  align-center msg--info\"><em><strong>This took a long time to write. I wanted this article to be as unbiased as possible and to appropriately and correctly explain and represent the views of the groups involved in the recent events.</strong></em></p>\n<hr>\n<p><span style=\"font-weight: 400;\">“On Memorial Day, the police in Minneapolis killed George Floyd, a 46-year-old black man.” writes the New York Times. “The killing has...prompted renewed calls to address brutality, racial disparities and impunity in American policing....”. But the story doesn’t begin there. And it certainly doesn’t end there either.  Calls for social and political change have prompted a push for reform and overhaul of law enforcement.  However, it is impossible to discuss proper reform of policing and law enforcement in the United States as a whole without properly discussing the prominent issues surrounding the discussion. Some believe that the response from activist groups such as Black Lives Matter and their ever-increasing following are disproportionate to recent events. Others believe that prominent supporters of the Black Lives Matter movement aren’t going far enough. But where does all this tension come from? And how will all this affect us in the future?</span></p>\n<p class=\"msg msg--highlight  align-center\"><strong><em>What is Systemic Racism?</em></strong></p>\n<p><span style=\"font-weight: 400;\">The United States has had a long and terrible history with racism and racial inequality. In his book, “Racist America: Roots, Current Realities, and Future Reparations” sociologist Joe Feagin states that systemic racism is a popular way of explaining, within the social sciences and humanities, the significance of race and racism both historically and in today's world. Feagin claims that the United States was founded in racism since the Constitution classified black people as the property of whites. Feagin illustrates that the legal recognition of racialized slavery is a cornerstone of a racist social system in which resources and rights were and are unjustly given to white people and unjustly denied to people of color. In summation, the theory of systemic racism accounts for individual, institutional, and structural forms of racism.</span></p>\n<p><span style=\"font-weight: 400;\">  </span></p>\n<p class=\"align-center msg msg--highlight \"><em><strong>The History of Black Lives Matter and The Civil Rights Movement </strong></em></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">Today, Black Lives Matter is a phrase that no longer simply refers to the activist organization, but is used to refer to the greater civil rights movement as a whole. Because of recent events, people conjoin the two as simply “The Black Lives Matter Movement”.  However, it is also important to consider that Black Lives Matter (the organization) and the greater Civil Rights movement have separate histories. </span></p>\n<p><span style=\"font-weight: 400;\">The Civil Rights Movement began in the 1940s after the World War II, with the National Association for the Advancement of Colored People (NAACP) began by fighting against segregation, discrimination in public recreational facilities, and restrictive covenants in transportation and housing. In 1954, the US Supreme Court made a historic ruling, outlawing segregation in the public school system. This caused backlash from racist groups of white Southern citizens, who used economic pressure, legal maneuvers and violence to strike against the Civil Rights Movement. </span></p>\n<p><span style=\"font-weight: 400;\">It would be impossible to discuss the Civil Rights Movement without mentioning Martin Luther King Jr… He organized the 1955-1956 bus boycott in Montgomery, Alabama. It was a peaceful protest brought on by Rosa Parks’ arrest after she refused to give up her seat to a white passenger on a segregated bus. In 1956, the Supreme Court ruled segregation of public transport unconstitutional. King would later go on to leave several successful sit-ins and marches in Birmingham, Alabama, and Washington, D.C. He won the Nobel Peace Prize in 1964 at the age of 35 and gave all his prize money to the Civil Rights Movement. The activist Malcolm X founded the Organization of Afro-American Unity in the early 1960s, pushing a less than peaceful message of  Black Power. He was assassinated in 1965. Just three years later, Martin Luther King Jr. would die in the same way. Even after their deaths, their message continues to resonate with people around the world, and this inspired many to form their own organizations to fight injustice wherever it may occur. </span></p>\n<p><span style=\"font-weight: 400;\">The Black Lives Matter Foundation was formed by Alicia Garza, Patrisse Cullors, and Opal Tometi in response to the killing of 17-year old Trayvon Martin. According to the organization’s website, their mission is to “eradicate white supremacy and build local power to intervene in violence inflicted on Black communities by the state and vigilantes.” Black Lives Matter also actively advocates for Black innovation and pushes for greater amounts of Black representation in politics and culture. Their focus also includes women and a portion of the LGBTQ+ community, who may not have organizations available to represent them. The Black Lives Matter Foundation does not have a central structure of a hierarchy and instead works through local chapters with individual leadership. The organizations regularly organize protests to speak out against issues such as  inequality, racial profiling, police brutality, and the killing of blacks. It is also important to note that Black Lives Matter activists tend to fall on the more radical side of social change. For example, One of Black Lives Matter’s staple chants is “no justice, no peace”, and after the acquittal and total exoneration of police officer Darren Wilson, 300 Black Lives Matter activists were arrested after protests turned violent and multiple fires broke out in the city of  Ferguson, Missouri. In 2015, A radio host that was affiliated with Black Lives Matter agreed with an anonymous caller suggesting that black people should murder whites people, quoting that they should “hang them from a tree, take pictures of it and send it to mother f*ckers.” In November 2015, Black Lives Matter members at the University of Missouri demanded a “blacks only healing space” where white “allies” and sympathizers of their cause were kicked out. This form of segregation was  in response to perceived “racial injustices” and “white privilege” at the college. In 2016, at a Black Lives Matter Protest in Portland, Oregon protesters began advocating the killing of cops, quoting “You pull out your pistol and you bust them”. In response to the death of Eric Garner at the hands of Daniel Pantaleo, a New York City Police Officer,  Black Lives Matter protesters chanted “What do we want? Dead cops. When do we want them? Now!”. In July 2016, members of Black Lives Matter refused to sell a white supporter a Black Lives Matter because the t-shirts were reserved for blacks only. Despite these moments of controversy, Black Lives Matter still claims that its overall mission has not changed, a claim which is supported by their success in spreading awareness about the issues that black people face. </span></p>\n<p><span style=\"font-weight: 400;\">On May 25, 2020, 46-year-old George Floyd, a black man, was killed by  Minneapolis police officer Derek Chauvin, who pressed his knee into the neck of the complacent and handcuffed George Floyd, killing him, but not before Floyd cried out several times that he was unable to breathe. The tragedy resulted in several protests breaking out across the world. While the majority of the protests were peaceful, many turned into riots, causing violence, arson, and widespread looting. As a response, US cities implemented curfews, and certain cities even called in the National Guard. Of course, these riots are not without casualty. On June 2, a Las Vegas police officer was shot. On the same day, a 77-year-old retired St. Louis police captain was killed by looters at a pawn shop. In Indianapolis, 2 people were killed during the riots, one of which was former Indiana University lineman Chris Beaty.  A 21-year-old man died in Detroit after shooting began during a riot.</span></p>\n<p><span style=\"font-weight: 400;\">Overall, these events have provoked multiple instances of protests and calls for action all over the world. The Black Lives Matter Foundation has taken this opportunity to pursue a new goal, which is a nation-wide defunding of the police. </span></p>\n<p> </p>\n<p><em><span style=\"font-weight: 400;\">But what exactly does it mean to ‘“defund the police?\"</span></em></p>\n<p> </p>\n<p class=\"msg msg--highlight align-center\"><strong><em>Defund the Police?</em></strong></p>\n<p><span style=\"font-weight: 400;\">To begin with, there are many misconceptions about the widespread call to “Defund the Police”. Some believe that it calls for total removal of the police force in certain cities and districts. Politicians such as Alexandra Ocasio Cortez have explained that ”Defund the Police” only entails the shifting of funding away from police and instead investing it in poorer communities and towns who were victims of racist practices in the past (more on that later). “Defund the police” may be the most popular solution to police brutality, but it certainly isn't the only one. Less radical political groups and figures have shown support for increased police training and harsher punishments for police officers who violate police code. Doing so would result in increased accountability and awareness about police misconduct on the line of duty. Rep. Jim Clyburn, Democrat  from South Carolina explained that despite calls defunding the police, it would not happen. Instead, he called on his fellow members of Congress to work with him on a “reimagining” of the police system. “I would simply say, as I have always said, nobody is going to defund the police,” Clyburn said on CNN’s “State of the Union.” “We can restructure the police forces, restructure, reimagine policing,” Clyburn said. “That is what we are going to do. The fact of the matter is, the police have a role to play. What we have got to do is make sure that their role is one that meets the times, one that responds to these communities that they operate in.” Clybrun’s words are in line with what the rest of Congress is planning to do, which is reforming police without defunding it. That being said, just why is “Defund the Police” so hotly debated?</span></p>\n<p><span style=\"font-weight: 400;\">The issue at hand is that police represent such an integral part of society. The responsibilities of the average police officer go far beyond catching criminals. When someone suggests defunding them, it’s easy to assume that the police will become less capable of fulfilling their responsibilities. Defunding the police is not a simple matter and requires careful planning and implementation, that when done correctly could result in impactful support and social change for people who were victims of institutionalized racism. However, every city in the United States is different, and each local government handles its budget differently. People who support the Black Lives Matter movement tend to advocate for defunding the police, but do not consider the fact that not all police departments are “overfunded” and that all poorer neighborhoods who may need financial support are the direct result of institutionalized racism. Lastly, it can not be overstated that not all cops contribute to police brutality. Many cops have stood in solidarity with the Black Lives Matter movement, giving support to the calls for reform. Despite all this, there are still those who deny that radical change demanded organizations like the Black Lives Matter Foundation is needed. </span></p>\n<p class=\"msg msg--highlight  align-center\"><strong><em>All Lives Matter</em></strong></p>\n<p><span style=\"font-weight: 400;\">While the Black Lives Matter Foundation was created with a specific goal in mind as an activist organization, the same cannot be said for  #AllLivesMatter. The hashtag began appearing as soon as the popularity of Black Lives Matter began to skyrocket in response to the death of George Floyd. It was used as a sort of response to people spreading #BlackLivesMatter all over the internet. #AllLivesMatter stems from a misconception- that the statement ‘Black Lives Matter’ means that ONLY black lives matter. When in reality, that is not what the statement entails. The statement is meant to highlight the injustice and mistreatment faced by black people throughout history and campaign for social and political change that will help put an end to racism once and for all.</span></p>\n<p class=\"msg msg--highlight  align-center\"><strong><em>Social Media and Activism</em></strong></p>\n<p><span style=\"font-weight: 400;\">A positive side of the recent events is that many celebrities, politicians, and ordinary people young and old alike have taken to social media as a method of activism. Thanks to the rise of the internet, it is now easier than ever to spread the word about petitions and rallies to foment change in our communities. With silence being frowned upon by all sides, calls for people to express their views are louder than ever, resulting in large instances of messages being shared and debated online. However, the question still remains as to whether these messages plastered all over social media can be considered activism. Former President Barack Obama spoke about social media and activism, saying “there is this sense that 'the way of me making change is to be as judgmental as possible about other people and that's enough.... That's not activism. That's not bringing about change. If all you're doing is casting stones, you're probably not going to get that far. That's easy to do.”</span></p>\n<p><span style=\"font-weight: 400;\">Anyone with an Instagram account can post a five-second story with the hashtag: </span><i><span style=\"font-weight: 400;\">BlackLivesMatter</span></i><span style=\"font-weight: 400;\">. But how many have gone out of their way to organize a protest, or a letter writing campaign? Ever since the rise of social media, the way that our society deals with current events has changed. Apps like Twitter and YouTube have ‘trending’ sections. Much of what people see and interact with has to do with whether it is trending. </span></p>\n<p><span style=\"font-weight: 400;\">That being said, social media is still a potent method of spreading awareness about a topic. Controversy is one of the most common ways that something can go viral, especially considering the heated political climate of the United States. </span></p>\n<p class=\"msg msg--highlight  align-center\"><strong><em>The Politics of  Racism</em></strong></p>\n<p><span style=\"font-weight: 400;\">Though many would argue that the issues raised by Black Lives Matter and other such institutions do not necessarily need to be political and should instead be regarded as societal, it is also important to consider that much of the changes demanded by organizations like Black Lives Matter and Antifa are analogous with that of political change, and require political support to be turned into law. The most important discrepancy occurs when considering the issues on the racism of the past, and how it may still have an impact today. Many conservatives argue that systemic racism is not an issue. They use statistics to show that police are more likely to shoot white people than black people and that police are also less likely to shoot unarmed black suspects than unarmed suspects.  According to American Free Press’s Peter Papaherakles, “For every black killed by a white police officer in the U.S. every year, there are about 71 blacks killed by other blacks.” This data was backed up by FBI data from 2007-2012 as well as the </span><i><span style=\"font-weight: 400;\">Wall Street Journal</span></i><span style=\"font-weight: 400;\">. Many attribute the leftist claims about systemic racism to the practice of “redlining”. </span></p>\n<p><span style=\"font-weight: 400;\">Redlining is a process in which institutions such as banks will refuse to offer mortgages or offer worse rates to customers in certain predetermined neighborhoods selected on the basis of their racial and ethnic composition. This is clearly an example of institutionalized racism in the United States. However, this practice was outlawed in 1968. Despite this, some argue that black people today still feel the effects of Redlining, pointing to the lack of government resources and support in order to make up for the utter lack of basic health and services like banking, healthcare, transportation and job opportunities. Conservatives address these claims by saying that government vouchers exist to help those in need, while liberals insist on a more widespread solution, calling for the government to spend more on neighborhoods that may have been affected by red-lining. Such arguments can be traced back to the differences between party platforms concerning the role of government as a whole. Many hoped that the United States would pull together to put an end to the numerous crises that the country is facing, but if anything, we are more divided than ever. </span></p>\n<p class=\"align-center msg msg--highlight \"><em><strong>The Future: What’s Next for America</strong></em></p>\n<p><span style=\"font-weight: 400;\">This is a difficult time for all of us. All around the world, the loss of stability, security, and human life, seems to affect every single community. </span></p>\n<p><span style=\"font-weight: 400;\">Everyone wants to return to their normal lifestyle, but analysts assure us that things won’t ever be the same. What exactly do they mean?</span></p>\n<p><span style=\"font-weight: 400;\">While this is  a time of great instability, it is also a time in need of great reform. It is easy to see that we are far from the “status quo”, but we must come to terms with the fact that the “status quo” is at least partially, responsible for our dire situation. Things cannot go back to the way they were. The Constitution of the United States was written as a living document for a reason. It was Abraham Lincoln who said “A house divided against itself cannot stand.” Now more than ever, that is true. If we continue to politicize every single issue and become outraged at everything we disagree with, our nation will continue to be divided. We can attain a prosperous future only through cooperation and compromise. For this reason, I urge that we forget our party affiliations, that for just a moment, we forget our rage and our hate, that for just a moment we can negotiate and find a solution that will work for us. We must stop seeing what makes us different and start looking for solutions, because this is more than a fight against injustice or a pandemic. This is a fight for America, and if we lose, we have only ourselves to blame.</span></p>\n<hr>\n<p class=\"align-center\"><em><span style=\"font-weight: 400;\">Citations</span></em></p>\n<p><span style=\"font-weight: 400;\">Bazelon, Emily. “Police Reform Is Necessary. But How Do We Do It?” The New York Times, The New York Times, 13 June 2020, </span><a href=\"http://www.nytimes.com/interactive/2020/06/13/magazine/police-reform.html\"><span style=\"font-weight: 400;\">www.nytimes.com/interactive/2020/06/13/magazine/police-reform.html</span></a><span style=\"font-weight: 400;\">.</span></p>\n<p><span style=\"font-weight: 400;\">Mitchell, Alissa Zhu and Justin. “They Love the Rebel Flag and Are Protesting at Ole Miss. Who Is Confederate 901?” Ledger, Mississippi Clarion Ledger, 19 Feb. 2019, </span><a href=\"http://www.clarionledger.com/story/news/2019/02/19/who-confederate-901-pro-confederate-groups-protest-ole-miss-rebel-flag-hiwaymen/2919957002/\"><span style=\"font-weight: 400;\">www.clarionledger.com/story/news/2019/02/19/who-confederate-901-pro-confederate-groups-protest-ole-miss-rebel-flag-hiwaymen/2919957002/</span></a><span style=\"font-weight: 400;\">.</span></p>\n<p><span style=\"font-weight: 400;\">Nicki Lisa Cole, Ph.D. “Understanding Systemic Racism.” ThoughtCo, </span><a href=\"http://www.thoughtco.com/systemic-racism-3026565\"><span style=\"font-weight: 400;\">www.thoughtco.com/systemic-racism-3026565</span></a><span style=\"font-weight: 400;\">.</span></p>\n<p><span style=\"font-weight: 400;\">Kershner, Ellen. “What Is The Black Lives Matter Movement?” WorldAtlas, WorldAtlas, 4 June 2020, </span><a href=\"http://www.worldatlas.com/articles/what-is-the-black-lives-matter-movement.html\"><span style=\"font-weight: 400;\">www.worldatlas.com/articles/what-is-the-black-lives-matter-movement.html</span></a><span style=\"font-weight: 400;\">.</span></p>\n<p><span style=\"font-weight: 400;\">O'Reilly, Andrew. “Clyburn Says 'Nobody Is Going to Defund the Police,' Calls for 'Reimagining' of Law Enforcement.” Fox News, FOX News Network, 14 June 2020, </span><a href=\"http://www.foxnews.com/politics/clyburn-nobody-defund-police-george-floyd\"><span style=\"font-weight: 400;\">www.foxnews.com/politics/clyburn-nobody-defund-police-george-floyd</span></a><span style=\"font-weight: 400;\">.</span></p>\n<p><span style=\"font-weight: 400;\">Bandler, Aaron. “7 Statistics That Show That 'Systemic Racism' Doesn't Exist In Policing.” The Daily Wire, The Daily Wire, 11 July 2016, </span><a href=\"http://www.dailywire.com/news/7-statistics-show-systemic-racism-doesnt-exist-aaron-bandler\"><span style=\"font-weight: 400;\">www.dailywire.com/news/7-statistics-show-systemic-racism-doesnt-exist-aaron-bandler</span></a><span style=\"font-weight: 400;\">.</span></p>\n<p><span style=\"font-weight: 400;\">Prestigiacomo, Amanda. “5 Things You Need To Know About Black Lives Matter.” The Daily Wire, The Daily Wire, 11 July 2016, </span><a href=\"http://www.dailywire.com/news/5-things-you-need-know-about-black-lives-matter-amanda-prestigiacomo\"><span style=\"font-weight: 400;\">www.dailywire.com/news/5-things-you-need-know-about-black-lives-matter-amanda-prestigiacomo</span></a><span style=\"font-weight: 400;\">.</span></p>\n<p><span style=\"font-weight: 400;\">“324,000 U.S. Blacks Killed by Blacks In Only 35 Years.” American Free Press, americanfreepress.net/in-just-35-years-232000-u-s-blacks-killed-by-other-blacks/.</span></p>\n<p><span style=\"font-weight: 400;\">Lockwood, Beatrix. “The US Government Used These Maps to Keep Neighborhoods Segregated.” ThoughtCo, </span><a href=\"http://www.thoughtco.com/redlining-definition-4157858\"><span style=\"font-weight: 400;\">www.thoughtco.com/redlining-definition-4157858</span></a><span style=\"font-weight: 400;\">.</span></p>\n<p><span style=\"font-weight: 400;\">Stuart, Tessa. “A Practical Guide to Defunding the Police.” Rolling Stone, Rolling Stone, 10 June 2020, </span><a href=\"http://www.rollingstone.com/politics/politics-news/defund-the-police-1007254/\"><span style=\"font-weight: 400;\">www.rollingstone.com/politics/politics-news/defund-the-police-1007254/</span></a><span style=\"font-weight: 400;\">.</span></p>\n<p><br><br></p>",
            "image": "https://blog.thegenz.org/media/posts/35/ooop-Sebastian-Maniac-Sanchez.jpg",
            "author": {
                "name": "Ishan Vepa"
            },
            "tags": [
                   "#society",
                   "#oped",
                   "#generations",
                   "#community",
                   "#blacklivesmatter",
                   "#advocacy",
                   "#BLM"
            ],
            "date_published": "2020-09-04T09:10:02-04:00",
            "date_modified": "2020-09-04T09:10:02-04:00"
        }
    ]
}
