{
    "version": "https://jsonfeed.org/version/1",
    "title": "The Generation Z Blog",
    "description": "",
    "home_page_url": "https://blog.thegenz.org",
    "feed_url": "https://blog.thegenz.org/feed.json",
    "user_comment": "",
    "icon": "https://blog.thegenz.org/media/website/gen-z-logo-refined.png",
    "author": {
        "name": "Ishan Vepa"
    },
    "items": [
        {
            "id": "https://blog.thegenz.org/water-conservation-and-what-we-can-do-to-help.html",
            "url": "https://blog.thegenz.org/water-conservation-and-what-we-can-do-to-help.html",
            "title": "Water Conservation and What We Can Do to Help",
            "summary": "Water is an important and necessary part of everyday life. 60% of the human body is made up of water and 71% of the Earth’s surface consists of water as well, according to the USGS. With such an important resource, it is surprising that many&hellip;",
            "content_html": "<p class=\"msg msg--highlight  align-center\"><strong>Water is an important and necessary part of everyday life. 60% of the human body is made up of water and 71% of the Earth’s surface consists of water as well, according to the USGS. With such an important resource, it is surprising that many people do not know that fresh water is not a renewable source.</strong></p>\n<p><span style=\"font-weight: 400;\">You may be thinking, ‘How can water not be renewable? After all, the water cycle is a repeated process, so therefore water must be a renewable resource.’ Even though there is a water cycle, the use of fresh water should be considered a nonrenewable resource. Even though so much of the Earth’s surface is made up of water, only 3% is fresh water, according to National Geographic. And of that 3%, only 1% can be used as drinking water (the other 2% is frozen) according to Sorcatic.org. The rest is saltwater, which can’t be used in our daily life. </span></p>\n<p><span style=\"font-weight: 400;\">Saltwater can be purified into freshwater, however, it does take energy. One way is through a process called reverse osmosis. This process takes saltwater and forces it through a permeable membrane, which removes the larger particles of unwanted material and leaves behind clean water. However, this process does take energy, as stated previously, which means that the process can’t be used as evidence for freshwater being renewable.</span></p>\n<p><span style=\"font-weight: 400;\">Some areas don’t even have access to freshwater locally, so it takes a lot of energy to get it to them. Many places around the world are not near freshwater naturally, which would mean that water would have to be transported there, which contributes to the increasing usage of energy throughout the world.</span></p>\n<p><span style=\"font-weight: 400;\">When reading these statistics, you may wonder why you should worry about it. It’s not like what you do has any control over how much water is available in the world, right? Well, you do have a lot of control over how you use your water. Americans use around 80 to 100 gallons of water a day (USGS). Imagine the amount of water you can save once you become aware of the number of gallons you use daily! Here are some tips on how you can save water in your day to day life right now!</span></p>\n<ul>\n<li style=\"font-weight: 400;\"><strong>Taking shorter showers: </strong><span style=\"font-weight: 400;\">Did you know that a 20-minute shower uses around 50 gallons (the Sacramento Bees)? Instead of taking a long shower, try to shorten the amount of time you are showering for!</span></li>\n<li style=\"font-weight: 400;\"><strong>Turn off the water when brushing:</strong><span style=\"font-weight: 400;\"> While you are brushing your teeth, you don’t need to have the faucet running. This eliminates the wastage of water when you aren’t even using it! This tip saves around 4 gallons of water each time you brush your teeth (the San Diego Union-Tribune)!</span></li>\n<li style=\"font-weight: 400;\"><strong>Don’t use your toilet to throw away tissues: </strong><span style=\"font-weight: 400;\">Using the toilet to throw away tissues and other types of garbage wastes around 5 to 7 gallons of water (the City of Santa Cruz). Instead, use a trash can, which does not need water to function!</span></li>\n<li style=\"font-weight: 400;\"><strong>Use your laundry machine when full:</strong><span style=\"font-weight: 400;\"> These appliances use a ton of water! The laundry machine uses 23 gallons, according to the water footprint calculator. By using them when they are full, you are saving water by not using the machines in excess.</span></li>\n</ul>\n<p> </p>\n<p><span style=\"font-weight: 400;\">There are also other ways you can save water! One way freshwater is lost is through runoff. Runoff harms the environment by increasing the amount of pollution in water systems (and therefore decreasing the amount of fresh water available). Runoff carries what is on the road while it is raining, for example, fertilizers and litter. It then carries these things into the sewer drains and other large bodies of water. The following ideas are ways you can prevent runoff and that you may need an adult before doing:</span></p>\n<ul>\n<li style=\"font-weight: 400;\"><strong>Rain Garden: </strong><span style=\"font-weight: 400;\">A rain garden is part of a landscape and is put in areas where water accumulates. This helps prevent runoff (when rainwater goes into sewer drains), helping the environment.</span></li>\n<li style=\"font-weight: 400;\"><strong>Green Roof:</strong><span style=\"font-weight: 400;\"> A green roof is when the roof of a building is covered with plants. This helps collect rainwater that usually accumulates on the roofs of buildings.</span></li>\n<li style=\"font-weight: 400;\"><strong>Permeable Pavement: </strong><span style=\"font-weight: 400;\">Permeable pavement is a type of pavement that absorbs rainwater, instead of allowing it to go into the sewer drains. This also helps prevent runoff.</span></li>\n<li style=\"font-weight: 400;\"><strong>Rain Barrel: </strong><span style=\"font-weight: 400;\">A rain barrel helps collect rainwater, which allows you to use it for other uses, such as watering gardens!</span></li>\n</ul>\n<p> </p>\n<p><span style=\"font-weight: 400;\">If you and the people around you use these tips to conserve the fresh water on Earth, you would be saving an abundance of water. This would help save the amount of water that is left for future generations too!</span></p>\n<p><br><br><br></p>",
            "image": "https://blog.thegenz.org/media/posts/22/waterpic-Anika-Mathur.jpeg",
            "author": {
                "name": "Ishan Vepa"
            },
            "tags": [
                   "#science",
                   "#infrastructure",
                   "#environment"
            ],
            "date_published": "2020-07-15T11:22:45-04:00",
            "date_modified": "2020-07-15T11:22:45-04:00"
        },
        {
            "id": "https://blog.thegenz.org/student-led-organizations-get-involved.html",
            "url": "https://blog.thegenz.org/student-led-organizations-get-involved.html",
            "title": "Student-Led Organizations: Get Involved",
            "summary": "Seven years ago, my elementary guidance counselor suggested I join the school's student government. I have been a member ever since. Three years ago, a community leader approached me during one of my school's student government meetings. She offered me a position on the city&hellip;",
            "content_html": "<p><span style=\"font-weight: 400;\">Seven years ago, my elementary guidance counselor suggested I join the school's student government. I have been a member ever since. Three years ago, a community leader approached me during one of my school's student government meetings. She offered me a position on the city government's youth advisory board. Five months ago, through that local board, I was made aware of a state program, and eventually applied and got accepted into the program. This is where I met Ananda Chatterjee, who invited me to become a project member on Generation Z Media. </span></p>\n<p><span style=\"font-weight: 400;\">Among all of these occurrences, there is one common denominator—a single shared factor—that opened the doors for building new connections, and paved the way for creating many valuable opportunities. It was this one unique underlying influence that has shaped the entirety of my school career and my academic outcomes. Do you have any guess as to what it may be? </span></p>\n<p><strong>Student-led organizations. </strong></p>\n<p><span style=\"font-weight: 400;\">Student-led organizations have helped me expand my social circle and build a successful academic portfolio. And, more importantly, they have taught me necessary character skills toward being successful as an individual. To name just a few skills: </span></p>\n<p><strong>Collaboration and leadership. </strong></p>\n<p><span style=\"font-weight: 400;\">Student-led organizations challenge students to work together to tackle relevant issues. It was during the Vietnam War that a common goal for peace united students in battling a legal challenge dragging out to the highest court of the land, and eventually ended in a hard-earned victory for the unwavering youth movement. Through bold leadership and collaboration with community leaders, the five-member student movement fought for their right to freedom of expression, and preserved that right for themselves and the entire nation's public schooling. </span></p>\n<p><strong>Creativity.</strong></p>\n<p><span style=\"font-weight: 400;\">Students leading organizations often come together under a common goal. Advocacy of peace in Vietnam (and by extension, freedom of expression) was the common goal of the students in the example of Tinker v. Des Moines. However, it is not necessarily usual for student-led organizations to have a national goal to guide their ambitions. Goals for student-led organizations need to resonate with youth, meaning talented and intelligent students must cautiously consider appropriate goals, requiring out-of-the-box thinking. Student-led organizations push for creativity in youth. </span></p>\n<p><span style=\"font-weight: 400;\">Junior State of America, for example, is a relatively new student-led organization that advocates for youth participation in democracy.  Organized in all parts of the country, students collaborate to brainstorm creative methods of expanding voting in local, state, and national elections to all up-and-coming voters. Chapters of the organization coordinate voter-registration drives in schools and host conferences for students to discuss pressing issues at all levels of democracy. Since its creation, Junior State of America has over 500,000 student members and has been supported by the likes of personalities such as Colin Powell and Ralph Nader. In another example, Generation Z Media, founded and led by students, aims to shine light on pressing and unique issues facing youth to encourage informed and involved Generation Z'ers. Founded less than a year ago, the organization has already begun a successful campaign to spread awareness on youth poverty in Florida’s state capital, and has since expanded operations to both coasts of Florida as well as three other states.</span></p>\n<p><strong>Get Involved.</strong></p>\n<p><span style=\"font-weight: 400;\">The importance of student-led organizations is undeniable. The number of clubs in schools, social media groups, and community gatherings all geared toward students is evident of our instinct as youth for desiring to organize as a collective. Unity is strength; division is weakness.  </span></p>\n<p><span style=\"font-weight: 400;\">If you're looking to speak out, or to advocate for a goal, or to simply get involved in your school or community, do not go at it alone. Reach out to friends, siblings, or classmates. Lead a coalition that will help spearhead your organization. You may end up building a movement that goes on to change the world.</span></p>",
            "image": "https://blog.thegenz.org/media/posts/21/New-Africa-Shutterstock-Bertell-Butler.jpg",
            "author": {
                "name": "Ishan Vepa"
            },
            "tags": [
                   "#youth",
                   "#society",
                   "#education",
                   "#community",
                   "#advocacy"
            ],
            "date_published": "2020-07-15T11:22:45-04:00",
            "date_modified": "2020-07-15T11:22:45-04:00"
        },
        {
            "id": "https://blog.thegenz.org/voter-turnout.html",
            "url": "https://blog.thegenz.org/voter-turnout.html",
            "title": "Voter Turnout",
            "summary": "Voter registration and turnout have been historically prominent topics. The election of 1920, which gave Warren Harding his first (and only) term, was the first time that voter turnout was recorded dipping below 50%. Our recent presidential election had a voter turnout at of 55.7%.",
            "content_html": "<p>Voter registration and turnout have been historically prominent topics. The election of 1920, which gave Warren Harding his first (and only) term, was the first time that voter turnout was recorded dipping below 50%. Our recent presidential election had a voter turnout at of 55.7%. From the first election, including women's suffrage to the first billionaire president, we're going to break down voter turnout and see just why America isn't getting back up to that 70% voter mark, a significant number which is widely agreed to represent a good portion of the country.</p>\n<p> </p>\n<p><strong>The Election of 1920</strong></p>\n<p>The election of 1920 presented, for the first time, women with the right to vote. With the 19th amendment, which was ratified on August 18th, 1920, women finally were granted voting rights, changing the potential voter turnout on its head. The electorate instantly diversified and thanks to mistakes made by incumbent Woodrow Wilson (D), the Republican Party took the lead. The introduction of women to the electorate nearly doubled the voting age population (VAP), but it didn't increase voter turnout much. Small local polls in urban and suburban Chicago note that most women didn't vote due simply to ignorance or lack of interest in politics. Warren Harding's \"Return to Normalcy\" couldn't register with enough of the revised electorate, and the nation registered a record low voter turnout at 49.2%. This staggering 12.4% drop between 1916 and 1920 remains the largest drop in voter turnout between two presidential elections, and the third lowest voter turnout in Americ  an history. For the first time, less than half of America was represented in the popular vote.</p>\n<p> </p>\n<p><strong>The Election of 1924</strong></p>\n<p>I promise we will not go through all the elections, but the election of 1924 presents an even more astonishing statistic - 48.9%. The lowest percentage of voter turnout in U.S. history. The reasons for lack of voter turnout are largely the same as the last election, but this time in greater effect. Parties, especially the Republican party, were breaking into factions, only making the election harder to follow. The diversifying views likely made people, especially women of the new electorate, feel more ignorant. This idea is especially important as America was now well into the Roaring Twenties, a time of economic expansion and cultural explosion. The clash of new ideas with more conservative ones split the nation in such a way, that for the last time, a president would win the election without taking any former confederate states. </p>\n<p> </p>\n<p><strong>The Election of 1972</strong></p>\n<p>In elections leading up to that of 1972, America saw a general rise in voter turnout. In 1972, however, incumbent Richard Nixon was running seemingly unopposed. Largely a favorite among Americans across the country, the democratic nominee, George McGovern, stood little chance of winning. So why the drop in voter turnout? The election of 1972 was the first where the voting age was lowered to 18. Just like in 1920, the expansion of the electorate did not translate to much of an increase in voter turnout. Many of these young adults, especially young males just coming back from Vietnam or still stuck in Vietnam, had an anti-government sentiment, and Nixon won the election with ease. From '72 to modern day, we haven't seen an election with a 60% voter turnout. In fact, for the next 4 elections, the voter turnout would stagnate and then even dip into the 40% range.</p>\n<p> </p>\n<p><strong>The Election of 1996</strong></p>\n<p>The final election we're covering is the election in 1996. This election is the last time America has hit the 40% range, voter turnout reaching 49.0%. The political toxicity of the time had reached Americans. Politics had become more about mud-slinging your opponent than telling the public what you offered. Incumbent Bill Clinton (D) ran against Bob Dole (R) in a tight race. Voters lost interest despite the best efforts of groups like Rock the Vote, a non-profit group whose mission is \"to engage and build the political power of young people.\" While groups like this targeted the growing young generation, people of all ages had lost interest in voting for candidates who spent their billions on television ads rather than grassroots campaigning.</p>\n<p> </p>\n<p>Voter turnout is still a problem today, especially among younger voters. While states are starting to mandate civics courses in classrooms, voter turnout isn't reaching 70% or higher anymore. For all our first time voters, and even our more experienced ones, we encourage you to vote this election season. While it is nearly impossible to find a candidate who meets all your expectations, by not voting for anyone, you might have given the advantage to a candidate you completely disagree with. Regardless of how insignificant a single vote may seem, everyone's votes count. <br>Now that we have gone over historic votes and the highs and lows of voter turnout, I think it’s important to acknowledge modern day voter suppression, and how we as a country can eliminate it. </p>\n<p> </p>\n<p>The first step to helping fix this problem? Identify signs of the problem. Voter suppression is the legal, active pursuit of stopping groups of people from voting by creating laws applied to everyone, but that only affects stereotypes. Breakdown: The party in control at any given point does not want to give that control up. Because the two major parties in the U.S. are often voted by opposite stereotypes, the party in control tries to bar stereotypes that fit each group from attending the polling stations. These laws apply to everybody in the state, but only really affect one group of people.</p>\n<p> </p>\n<p>“But that’s not fair! The majority can get blocked out by minority voices!” Absolutely. This is why we need to address voter suppression fast. Some present day examples of voter suppression include barriers in voter registration, early voting, and voter ID requirements. As noted by the ACLU, in many states, including Florida, early voting time was decreased, nearly cut in half. By eliminating early voting, groups of people who cannot leave their jobs to vote lose their voice. These voters tend to be minority races and groups. </p>\n<p> </p>\n<p>Additionally, some states choose to pass laws relating to voter I.D., often mandating a government issued I.D. while 1/10 of all Americans do not have a government issued I.D., 1/4 of all African American voters have no government issued I.D. which effectively hurts the overall minority vote. 15% of minorities making less than $35,000/year do not have government issued I.D.s. For more information on minority statistics look <a href=\"https://www.aclu.org/facts-about-voter-suppression\">here (ACLU website)</a>. </p>\n<p> </p>\n<p>So what can we do about this? It seems like sometimes the system is overbearing. The system seems like it can stop you from voting. </p>\n<p> </p>\n<ol>\n<li>Get your friends and family to vote. Even of the available electorate, as I outlined, not everybody votes, so get everyone of the available electorate to vote. </li>\n<li>Double check to make sure you are registered to vote.</li>\n<li>Cover shifts for each other so you can vote. </li>\n<li>Petition to open more testing centers and extend early voting.</li>\n</ol>\n<p> </p>\n<p class=\"align-center msg msg--highlight \"><strong>History has shown us how voters can become unconcerned with their political representatives. While the system is flawed, it’s the system we must abide by, and to throw away our voice would be nothing short of dishonoring our own values.</strong></p>",
            "image": "https://blog.thegenz.org/media/posts/20/voter_turnout_pic.jpg",
            "author": {
                "name": "Ishan Vepa"
            },
            "tags": [
                   "#vote",
                   "#society"
            ],
            "date_published": "2020-07-15T11:22:45-04:00",
            "date_modified": "2020-07-15T11:22:45-04:00"
        },
        {
            "id": "https://blog.thegenz.org/road-infrastructure-and-improvements-to-preserve-the-environment.html",
            "url": "https://blog.thegenz.org/road-infrastructure-and-improvements-to-preserve-the-environment.html",
            "title": "Road Infrastructure and improvements to preserve the environment",
            "summary": "Road Infrastructure: Infrastructure is the essential structure of different branches of society that provides value and benefit to our society. Specifically, road infrastructure focuses on our road transportation systems. This specific branch of infrastructure develops new methods and models on transportation, as well as developing&hellip;",
            "content_html": "<p><strong>Road Infrastructure:</strong></p>\n<p><strong>           </strong>Infrastructure is the essential structure of different branches of society that provides value and benefit to our society. Specifically, road infrastructure focuses on our road transportation systems. This specific branch of infrastructure develops new methods and models on transportation, as well as developing new roads to help transport items. However, research has shown that the current road infrastructure can be hazardous to the environment.</p>\n<p><strong>Environmental Impacts:</strong></p>\n<p><strong>         </strong>In our transportation systems, we utilize automobiles and trucks to transport people and goods. It is both efficient and convenient to our society. However, our transportation systems have been proven to be harmful to the environment.</p>\n<p>       In most automobiles, gasoline is the primary source of fuel. Gasoline is produced from oil which is derived from petroleum. Petroleum is made of various hydrocarbons; basically hydrogen bonding with carbons that is found in the compound. Hydrocarbons make up the composition of various crude oils and other gases. The production of these compounds promotes the greenhouse effect by creating holes in the ozone layer. The ozone layer is essentially used as a shield against the UV rays generated by the sun. This then causes the radiation from the sun to ultimately warm up the surface, harming biodiversity.</p>\n<p>     With transportation, there is also the issue with our road systems. For instance, when we build roads, we use asphalt that has the potential to damage the environment. Since asphalt helps with the runoff system on the roads, it has the potential to introduce pollutants into the environment.</p>\n<p>     For instance, cars with a damaged engine may end up leaking motor oil. Thus, it has potential to contaminate sources of drinking water. There is also an issue with salting our roads. During winter, roads will usually be salted to prevent roads from freezing. This in turn can cause potential harm to biodiversity, especially aquatic biodiversity. Like with potential motor oil spills, salts can also traverse into aquatic habitats and cause dead zones due to high salt concentrations.</p>\n<p><strong>How it can be improved:</strong></p>\n<p><strong>        </strong>The solutions presented will address the issue of gas emission from cars, roads, and other feasible methods of transportation.</p>\n<p>         When looking at our automobiles, energy for the car is created by an engine. The fuel used to help generate work for the car to move consists of hydrocarbons. By an exhaust hose, the excess CO2 is expelled by the car. The most logical material to replace gasoline would be another material that has the ability to combust via air. Recently, there has been research on using organic material as an alternative for gasoline. Specifically, oil derived from plants may be used as an alternative to gasoline. While CO2 would still be produced regardless, it would be lower due to CO2 being used to cultivate the plants.</p>\n<p>      This method may be hard to implement since it would be more costly and require many plants to be harvested for their oil. That said, a more realistic approach would be to limit the usage of cars and utilize public transport. However with the current situation of social distancing, it may be difficult to use public transport. That said, we should now focus on driving less and not using a car when going to a place close by.</p>\n<p>     The result of doing this would decrease the amount of Carbon Dioxide that ends up in the atomsphere. The greenhouse effect would also gradually decrease and the ozone layer would be able to heal. This would then allow for the planet’s temperature to stabilize.</p>\n<p>    With the issue of salting roads and asphalt, it would still continue to be there in the long term. However, a potential solution to this would be to build better drainage systems near forests and bodies of water to prevent runoff and salts from entering the ecosystem. This may be expensive, but has potential to prevent hazardous agents from affecting the environment.</p>\n<p> </p>",
            "image": "https://blog.thegenz.org/media/posts/19/junction-984045_1920.jpg",
            "author": {
                "name": "Ishan Vepa"
            },
            "tags": [
                   "#urban",
                   "#infrastructure",
                   "#environment"
            ],
            "date_published": "2020-07-15T11:22:45-04:00",
            "date_modified": "2020-07-15T11:22:45-04:00"
        },
        {
            "id": "https://blog.thegenz.org/why-is-racism-a-political-debate.html",
            "url": "https://blog.thegenz.org/why-is-racism-a-political-debate.html",
            "title": "Why is Racism a Political Debate?",
            "summary": "In American history, time and time again we have seen political parties shift on their thoughts and ideologies on social issues and racism is no different. In the 1860s and ’70s, it was the Republican Party leading the way in reconstruction in an attempt to&hellip;",
            "content_html": "<p class=\"msg msg--highlight  align-center\"><em>In American history, time and time again we have seen political parties shift on their thoughts and ideologies on social issues and racism is no different.</em></p>\n<p><span style=\"font-weight: 400;\">In the 1860s and ’70s, it was the Republican Party leading the way in reconstruction in an attempt to help the black community and lift them up coming out of the Civil War. In that time, shortly after the Civil War, former Confederate States, such as South Carolina and Mississippi, started to enact so-called “black codes” that would limit the freedoms of African Americans so that they could not vote, enacted vagrancy laws (laws that said black people must have jobs and permanent residence, and through the vagrancy laws “labor contracts” would be legalized which would institutionalize a second form of slavery. The people who enacted these laws were white Southerners and Ex-Confederates that pushed these black codes. These white southerners would also go on to constitute the “Solid South”, which was when the Democratic Party rose to popularity in the South in response to the Republicans that controlled them in the North. (Sources 1-4, I highly recommend reading them for further information on American history. If we do not learn about the past it is bound to repeat itself.)</span></p>\n<p><span style=\"font-weight: 400;\">The Democratic Party is also the same party whose presidents in the 60’s advocated for Civil Rights and signed into law the 1964 Civil Rights act. </span></p>\n<p><span style=\"font-weight: 400;\">And there are examples upon examples where I could give where both political parties have been on the right and wrong side of the history of Civil Rights for African Americans in this country. Clearly, in America, politics has played a huge role in either enabling or eradicating racism in America. </span></p>\n<p class=\"msg msg--highlight \"><strong>I must ask the question, why do we make racism a political debate? </strong></p>\n<p><span style=\"font-weight: 400;\">In history, it can be clearly seen that both political parties are ever-changing in their efforts in either enabling or eradicating racism, so why do we hold so dearly to these flimsy and altering political doctrines of both of our political parties?</span></p>\n<p><span style=\"font-weight: 400;\">It has to do with the simple nature of political parties and our government. That is that these things, these political parties, are social constructs. A social construct defined by Merriam-Webster is “</span><span style=\"font-weight: 400;\">an idea that has been created and accepted by the people in a society” (Source 5). Basically, this means a political party is a group of people in the same society that share the same ideals of how our government (which is also a social construct) should be run. Thus, when they come to a general consensus on their ideals, they will deem themselves a “political party”. </span></p>\n<p><span style=\"font-weight: 400;\">A political party exists because society exists, and society exists because people with ideals and ideas exist. A political party is not like a book. Whether or not a person says a book exists or not it will nonetheless continue to exist in reality. But society could all of a sudden say a political party does not exist and it would cease to exist. </span></p>\n<p><span style=\"font-weight: 400;\">Political parties, being that they are social constructs, are very reliant and susceptible to society. But once the political party or social construct becomes so ingrained in one’s society, this leads to prideful people not willing to put their foot down and disagree with their party. This can be owed to a myriad of factors, but one reason may be that people love to feel like they are “for a cause” and “in power”. This, in the end, leads to pride in one’s party that blinds the person to not being able to see and listen to other political perspectives.</span></p>\n<p class=\"msg msg--highlight \"><strong>As well, in our American society, we have a very racist past that has manifested itself into systemic and structural racism. In America, in all honesty, we have a society in which hate for people is very prevalent. </strong></p>\n<p><span style=\"font-weight: 400;\">Racism can be and is expressed in a variety of ways, as just mentioned as systemic and structural for example. However, we must remember where racism comes from and what it is at its core. Racism is hate, and hate originates from the ideals and ideas of people. The same people who can make up a society and can create social constructs.</span></p>\n<p><span style=\"font-weight: 400;\">And this is where the danger lies. We have political parties that are created by a society that has 100s of years of hate and racism, and for some reason, we irresponsibly think that a social construct, which is created by society as previously said, is not influenced by 100s of years of a racist and hateful past, and I will contend present as well. Then we become so prideful in sticking to our political party’s ideologies that we begin to argue over the very nature of whether or not racism is prevalent in our society when it very much is. We become so entrenched in our political party’s doctrine and ideology that we become too prideful to put our foot down and say “This is enough”.</span></p>\n<p><span style=\"font-weight: 400;\">This is what leads to things like conservatives saying “All Lives Matter” in opposition to Black Lives Matter and Democrats saying “All Cops are Bad” when there are a great number of people out there that represent that badge with integrity, honor, and most importantly love for one’s community. </span></p>\n<p class=\"msg msg--highlight  align-center\"><strong>It is important to remember that we should not generalize people, no matter if they are Republican or Democrat. We should treat each person as an individual.</strong></p>\n<p><span style=\"font-weight: 400;\">However, I point all of this out because the purpose in saying all this is not to generalize Republicans or Democrats, but is to call out these infectious political doctrines and how they are imbuing, injecting, and infecting dangerous and hateful ideals into people. </span></p>\n<p><span style=\"font-weight: 400;\">We have become so prideful in our political affiliations we are not willing to say, “Black Lives Matter”, and we are not willing to say there are many good cops as well. We blindly pledge our allegiance to social constructs that have been indecisive on whether or not they want to enable or eradicate racism. </span></p>\n<p><span style=\"font-weight: 400;\">It is time we put aside our pride and political affiliations and all come together and admit that racism is very real. And that healing must not start with politics, but with our own minds, our own hearts. We need to create a society in which we remember our hateful past as a lesson to never go back there, we renounce these past hateful ways and stop glorifying our hate (stop glorifying Confederate leaders/statues) in the present, and live for a hopeful future filled with justice for all. </span></p>\n<p><span style=\"font-weight: 400;\">Maybe then we can build social constructs that are unwavering on their promise to eradicate racism on a society filled with hope for a future full of justice, not on a society full of a hateful past. </span></p>\n<hr>\n<p class=\"align-center\"><em>Citations</em></p>\n<ol>\n<li><span style=\"font-weight: 400;\"> Constitutional Rights Foundation. “Southern Black Codes”. Constitutional Rights Foundation, </span><span style=\"font-weight: 400;\"><a href=\"https://www.crf-usa.org/brown-v-board-50th-anniversary/southern-black-codes.html\">https://www.crf-usa.org/brown-v-board-50th-anniversary/southern-black-codes.html</a><br><br><a href=\"https://www.crf-usa.org/brown-v-board-50th-anniversary/southern-black-codes.html\"></a></span></li>\n<li><span style=\"font-weight: 400;\"> Foner, Eric. “Reconstruction”. Britannica Encyclopædia, April 3, 2020, </span><span style=\"font-weight: 400;\"><a href=\"https://www.britannica.com/event/Reconstruction-United-States-history/The-end-of-Reconstruction\">https://www.britannica.com/event/Reconstruction-United-States-history/The-end-of-Reconstruction</a><br><br><a href=\"https://www.britannica.com/event/Reconstruction-United-States-history/The-end-of-Reconstruction\"></a></span></li>\n<li><span style=\"font-weight: 400;\"> Gustainis, J. Justin. “Solid South”. </span><i><span style=\"font-weight: 400;\">Dictionary of American History</span></i><span style=\"font-weight: 400;\">, found on Encyclopedia.com, entry on the website updated on May 27, 2020, </span><a href=\"https://www.encyclopedia.com/history/united-states-and-canada/us-history/solid-south\"><span style=\"font-weight: 400;\">https://www.encyclopedia.com/history/united-states-and-canada/us-history/solid-south</span></a></li>\n</ol>\n<ol start=\"4\">\n<li><a href=\"https://www.britannica.com/editor/The-Editors-of-Encyclopaedia-Britannica/4419\"><span style=\"font-weight: 400;\">The Editors of Encyclopaedia Britannica</span></a><span style=\"font-weight: 400;\">. “Black Code”.Britannica Encyclopædia, August 20, 2019, </span><span style=\"font-weight: 400;\"><a href=\"https://www.britannica.com/topic/black-code\">https://www.britannica.com/topic/black-code</a><br><br><a href=\"https://www.britannica.com/topic/black-code\"></a></span></li>\n<li>“Social Construct”. Merriam Webster, <a href=\"https://www.merriam-webster.com/dictionary/social%20construct\" style=\"font-family: var(--font-base); font-size: inherit; font-weight: var(--font-weight-normal);\">https://www.merriam-webster.com/dictionary/social%20construct</a><span style=\"font-weight: 400;\">, Accessed June 13, 2020</span></li>\n</ol>",
            "image": "https://blog.thegenz.org/media/posts/18/henry-be-4KDngW9vWwo-unsplash.jpg",
            "author": {
                "name": "Ishan Vepa"
            },
            "tags": [
                   "#society",
                   "#inequality",
                   "#community",
                   "#blacklivesmatter",
                   "#BLM"
            ],
            "date_published": "2020-07-15T11:22:45-04:00",
            "date_modified": "2020-07-15T11:22:45-04:00"
        },
        {
            "id": "https://blog.thegenz.org/systemic-racism-in-healthcare.html",
            "url": "https://blog.thegenz.org/systemic-racism-in-healthcare.html",
            "title": "Systemic Racism in Healthcare",
            "summary": "On May 25, 2020, George Floyd, a 46-year-old black man, was killed by a Minneapolis police officer who already had 18 previous complaints regarding excessive force. Derek Chauvin, the police officer, pressed his knee into the complying and already handcuffed George Floyd, killing him. This&hellip;",
            "content_html": "<p class=\"msg msg--highlight  align-center\"><em><strong>On May 25, 2020, George Floyd, a 46-year-old black man, was killed by a Minneapolis police officer who already had 18 previous complaints regarding excessive force. Derek Chauvin, the police officer, pressed his knee into the complying and already handcuffed George Floyd, killing him.</strong></em></p>\n<hr>\n<p>This murder has had a profound impact on the United States and numerous other nations where protests have been going on for weeks. The Black Lives Matter movement has gained traction as individuals across the globe have decided enough is enough and that change needs to happen.</p>\n<p>No matter what your stance is on this major issue, it has unarguably started a wider conversation on systemic racism and how our society has subtly and not so subtly allowed for racism to continue in the United States. Since this discussion hit its boiling point with the unethical treatment of Floyd, the discussion about systemic racism has been primarily centered around the justice system, and the political climate of the United States. This discussion about the justice system has been very controversial. One area in which systemic racism has been recognized by nearly everyone in the field is in public health and safety, even more specifically the roots of modern-day medicine.</p>\n<p class=\"msg msg--highlight  align-center\">Medical professionals have a very unique perspective: people go to them for help, and as people in a position of power, patients are likely to take their advice and trust them.</p>\n<p><span style=\"color: var(--text-editor-body-color); font-family: var(--font-base); font-size: inherit; font-weight: var(--font-weight-normal);\">This unique and important relationship that medical professionals have with their patients is really a delicate balance in which doctors have an ethical duty to help individuals no matter their race, personal beliefs, and sexual orientation. In modern times, discrimination against people of color still occurs and this might have something to do with the roots of medicine and misconceptions that have been spread.</span></p>\n<p>One of the more obvious cases of discrimination against people of color dates back to 1932 during the Tuskegee Experiment. The purpose of this experiment was to see the effects of untreated syphilis on the human body, however, black men were used as the test subjects for this experiment. Out of the 600 black men that took part at the beginning of the experiment. The 399 men with syphilis were not told of their status and were only told that they were being treated for “bad blood” (a phrase that was often used to describe numerous illnesses.) These men did not know they were ill with syphilis and were told that they were being cured when in reality they were only given placebos such as aspirin. Many men passed it to family members because they were not told of their status. Because the study was to see the effects of untreated syphilis many participants suffered from side effects, such as blindness, insanity, and death.</p>\n<p>The men were told that the experiment would only last six months but it went on for an additional 40 years without the men even being fully aware of their diagnosis. Researchers even continued the experiment despite knowing that in 1947, penicillin was a common treatment for syphilis. In the 1960s, a disease detective known as Peter Buxton recognized the unethical treatment that was going on and brought it to the attention of a public health services board that ultimately allowed the study to continue until all patients died. Buxton leaked the story and by doing so he was able to get the study shut down. Congress recognized the issue and paid 10 million dollars for an out of court settlement with survivors.</p>\n<p>The government has tried to make amends with victims and family members. However, this did not change the little trust that African Americans had with the public health system. It is apparent how little was done for the black community as the first public apology from a U.S. official was from Bill Clinton in 1997 when he announced the creation of Tuskegee University’s National Center for Bioethics in Research and Health Care. This might be the most apparent instance of discrimination against people of color but there are certainly dozens more which are reflected in the high mortality rates people of color face when in medical care. A 2016 study done on medical students showed that nearly 50 percent of medical students and residents believed there were biological differences between white and black people and that black people feel less pain because they have “thicker skin.” Black women are four times more likely to die during childbirth than white women and black people are 22% less likely to receive proper pain management medication.</p>\n<p>A lot has been going on in recent weeks and it is very important for us to do our research and learn about these disparities that have been going on for centuries in our country.</p>",
            "image": "https://blog.thegenz.org/media/posts/17/Cover_grace.png",
            "author": {
                "name": "Ishan Vepa"
            },
            "tags": [
                   "#society",
                   "#inequality",
                   "#healthcare",
                   "#community",
                   "#blacklivesmatter",
                   "#BLM"
            ],
            "date_published": "2020-07-15T11:22:45-04:00",
            "date_modified": "2020-07-15T11:22:45-04:00"
        },
        {
            "id": "https://blog.thegenz.org/sanity.html",
            "url": "https://blog.thegenz.org/sanity.html",
            "title": "Sanity",
            "summary": "In light of the recent outbreak of the novel coronavirus, COVID-19, many governments and researchers have recommended that people practice social distancing. As defined by John Hopkins Medicine, “Social Distancing is deliberately increasing the physical space between people to avoid spreading illness.” Please follow the&hellip;",
            "content_html": "<p><span style=\"font-weight: 400;\">In light of the recent outbreak of the novel coronavirus, COVID-19, many governments and researchers have recommended that people practice social distancing.</span></p>\n<hr>\n<p><span style=\"font-weight: 400;\">As defined by </span><a href=\"https://www.hopkinsmedicine.org/health/conditions-and-diseases/coronavirus/coronavirus-social-distancing-and-self-quarantine\"><span style=\"font-weight: 400;\">John Hopkins Medicine</span></a><span style=\"font-weight: 400;\">, “Social Distancing </span><span style=\"font-weight: 400;\">is deliberately increasing the physical space between people to avoid spreading illness.” Please follow the guidelines</span><span style=\"font-weight: 400;\"> outlined </span><a href=\"https://www.cdc.gov/coronavirus/2019-ncov/prevent-getting-sick/prevention.html\"><span style=\"font-weight: 400;\">here</span></a> <span style=\"font-weight: 400;\">by the Center for Disease Control and Prevention (CDC) to help prevent the spread of sickness. In these trying times, it becomes easy to lose ourselves to anxiety and loneliness. Many of us or our loved ones may struggle with mental health illnesses. </span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">The CDC has developed a </span><a href=\"https://www.cdc.gov/coronavirus/2019-ncov/daily-life-coping/managing-stress-anxiety.html?CDC_AA_refVal=https%3A%2F%2Fwww.cdc.gov%2Fcoronavirus%2F2019-ncov%2Fprepare%2Fmanaging-stress-anxiety.html\"><span style=\"font-weight: 400;\">page</span></a><span style=\"font-weight: 400;\"> filled with tips for how to maneuver mental health during this pandemic, but the two aspects I am focusing on here are loneliness as a symptom and skin hunger. Loneliness is often a symptom of mental disorders such as depression, but can often be the most harmful symptom. In an </span><a href=\"https://www.ncbi.nlm.nih.gov/pubmed/25910392\"><span style=\"font-weight: 400;\">analytic review</span></a><span style=\"font-weight: 400;\"> at Brigham Young University, researchers concluded that loneliness can reduce immunity, increase inflammation, and spur heart disease. During a time where a virus seems to target elder and weaker people, loneliness will only do more damage. </span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">This goes hand-in-hand (Socially Distanced hands) with another aspect of mental health: skin hunger. While skin hunger hasn’t been researched as widely, we do know a few things. Some people crave human touch, even as much as a handshake or a hug. Day to day proceedings often brush over these basic touches, but due to social distancing, people have started to feel the effects of these cravings. Isolation and loneliness only add to the troubles, and combined, can lead to depression. Research shows that skin hunger can also lead to more troubling illnesses such as alexithymia, a condition which stops people from interpreting or feeling emotions. </span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">So what can we, as social beings, do to help? </span></p>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Use video chatting! Call your family, friends, neighbors and just talk. Remind them that you care.</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Write letters! Letters are personal and can help convey a lot of emotion.</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Prepare meals to share! Make sure the meal can be microwaved for at least a few seconds to kill any potential trace virus.</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Send pictures and tips! Sending tips and pictures of what you’re doing throughout the day can make someone feel like they’re interacting alongside you.</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Share an article! Articles like this help spread the word and can help save lives</span></li>\n</ul>\n<p> </p>\n<p><span style=\"font-weight: 400;\">Don’t be afraid to reach out to a loved one. Even just a simple check-in might make someone’s day, and in pressing times like these, we cannot afford to leave anyone behind.</span></p>",
            "image": "https://blog.thegenz.org/media/posts/16/social_distancing04-01.jpg",
            "author": {
                "name": "Ishan Vepa"
            },
            "tags": [
                   "#socialdistancing",
                   "#covid19",
                   "#coronavirus"
            ],
            "date_published": "2020-07-15T11:22:45-04:00",
            "date_modified": "2020-07-15T11:22:45-04:00"
        },
        {
            "id": "https://blog.thegenz.org/we-live-in-a-society-comedians-vs-cancel-culture-and-the-need-for-satire.html",
            "url": "https://blog.thegenz.org/we-live-in-a-society-comedians-vs-cancel-culture-and-the-need-for-satire.html",
            "title": "We Live in a Society: Comedians Vs Cancel Culture and the Need for Satire",
            "summary": "What is Cancel Culture? During the last few years, we’ve been seeing the rise of a new idea concerning the way that the public interacts with celebrities and media. More specifically this is the idea of “canceling” someone. The idea of “canceling” someone means that&hellip;",
            "content_html": "<p class=\"msg msg--info align-center msg--highlight \"><strong>What is Cancel Culture?</strong></p>\n<hr>\n<p>During the last few years, we’ve been seeing the rise of a new idea concerning the way that the public interacts with celebrities and media. More specifically this is the idea of “canceling” someone. The idea of “canceling” someone means that they are being culturally blocked from having a prominent public platform or career. It occurs when a celebrity or a public figure says or does something that is considered offensive. This results in public backlash, usually headed by politically progressive social media groups, which then in turn cause calls to “cancel” the person, which according to Vox, means to effectively end their career or remove their cultural significance, through methods such as boycotts of their work or petitions for disciplinary action from an employer. From this comes the phrase “Cancel Culture”. This phrase refers to the idea that “canceling” people has become a part of our culture and anyone who says or does anything offensive to a particular group will be “canceled” will be canceled. However, to this day, people debate whether there really is a “cancel culture” in our society.</p>\n<p> </p>\n<p>In 2019, there were multiple examples of celebrities who faced being “canceled” such as, R. Kelly, Kanye West, Scarlett Johansson, and Gina Rodriguez, who made offensive statements, as well as comedians such as Kevin Hart and Shane Gills who had made some jokes that were perceived as racist and homophobic in the past, and received backlash after the jokes were found out by the general public.</p>\n<p> </p>\n<p>However, the majority of people who have been “canceled” do not have their careers ended. For example, Kevin Hart withdrew from hosting the Oscars, but his movies and comedy shows were still successful after the wave of backlash against him passed. Shane Gills lost his position in <em>Saturday Night Live, </em>but he has been received well by the public at shows, and he has even been defended by fellow comedians like Ricky Gervais and David Spade. </p>\n<p> </p>\n<p>The phrase “Cancel Culture” is a loaded one, which gives way to a much larger discussion. Even if you do not know what it means in its entirety, you have probably seen it on your social media, or have heard others discuss it. Discussions about “Cancel Culture” can really be found all over the internet, and many people have spoken up about it, and whether they are arguing in favor of it, arguing against it, or questioning its existence or legitimacy as a whole, “Cancel Culture” has become a major source of social conflict and tension. Supporters of “Cancel Culture” believe it will discourage immoral behavior of celebrities and influencers by punishing people who behave in ways that are seen as inappropriate. However, those who disagree believe that the idea limits the freedom of speech by telling society that they have a right to erase anything and anyone that they personally disagree with. </p>\n<p> </p>\n<p>However, one of the most controversial aspects of “Cancel Culture” is how the movement in general tends to deal with jokes and satire that they find offensive. Most people aren’t offended by satire and jokes. Most comedians and stand-up antics are welcome by audiences in general. But the problem arises when comedians and entertainers tread along the lines of satire and joke about taboo subjects.  Important questions that need to be addressed still remain: How far is too far? Why is satire important? What exactly constitutes a “Cancel Culture”?  </p>\n<p> </p>\n<p><strong><u>Origins</u></strong></p>\n<p class=\"msg msg--highlight \">Today in the US we live in a divided society. Politics, class, and religion: these and many more act as lines in the sand against unity. Together we can cross those lines in the sand, but first we must go back to where it all began.</p>\n<p> </p>\n<p>The phrase originates from the 1991 film <em>New Jack City</em>, in which one of the characters says the line “Cancel that b*tch. I’ll buy another one.” In 2010, Lil Wayne uses the line in his song “I’m Single”, where he sings: “Yeah, I’m single / n***a had to cancel that b*tch like Nino.” But the phrase really gained popularity on an episode of VH1’s reality show Love and Hip-Hop New York that aired in December 2014, where cast member Cisco Rosado tells his love interest during a fight, “you’re canceled.” From then on, the phrase could be found all over Twitter in 2015, being used as a reaction to someone doing something you disapproved of- regardless of whether you were serious.</p>\n<p> </p>\n<p>As time went on, the phrase began to correlate with civil rights movements and took advantage of social media platforms like Twitter to give a louder voice to black citizens and other marginalized groups within society. Anne Charity Hudley, the chair of linguistics of African America for the University of California Santa Barbara, can be quoted as saying “Canceling is a way to acknowledge that you don’t have to have the power to change structural inequality, … You don’t even have to have the power to change all of public sentiment. But as an individual, you can still have power beyond measure.... When you see people canceling Kanye, canceling other people, it’s a collective way of saying, ‘We elevated your social status, your economic prowess, [and] we’re not going to pay attention to you in the way that we once did. ... ‘I may have no power, but the power I have is to [ignore] you” </p>\n<p> </p>\n<p><strong><u>Cancel Culture Today</u></strong></p>\n<p> </p>\n<p>The problem arises when people see “Cancel Culture” as a substitute for activism. It is every person’s right to have an opinion, and social media provides a platform for every voice to be heard- regardless of political correctness. But going on social media and “canceling” someone does not foment social change. Being ‘woke’ on social media does not foment political reform. In our modern society, it has become too easy to simply go on social media, see something we believe is wrong, make a post about why we believe it is wrong, and we go on with our day, satisfied that what we just did counts as activism. Former President Barack Obama spoke about the issue, saying “there is this sense that 'the way of me making change is to be as judgmental as possible about other people and that's enough.... That's not activism. That's not bringing about change. If all you're doing is casting stones, you're probably not going to get that far. That's easy to do.” If we simply “cancel” everything that we believe is wrong and leave nothing in its place, we are fixing nothing.</p>\n<p> </p>\n<p class=\"msg msg--highlight \">It may seem as if we are eliminating hate, but when we offer no solutions, no means of changing things, no olive branches or chances at peace, we simply create more division, more conflict, and more hate. </p>\n<p> </p>\n<p><strong><u>What is the Importance of Satire?</u></strong></p>\n<p> </p>\n<p>It should be said that the general public has a few misconceptions about how comedy works in general. Laughter is a positive emotion; we feel good when we laugh. For that reason, people see laughter and comedy as a ‘happy’ thing. But the truth is, oftentimes jokes have their roots in very dark subject matter. The ability to take pain and turn it into a source of joy through laughter is part of what makes comedy so powerful and positive. “Robust satire is often a sign of crisis and the ability to share and consume it is a sign of a free society,” said Sophia McClennen, professor of international affairs and comparative literature and director of Penn State’s Center for Global Studies. “We see satire emerge when political discourse is in crisis and when it becomes important to use satirical comedy to put political pressure on misinformation, folly, and the abuse of power.”</p>\n<p> </p>\n<p>Often, comedy and satire were used as methods of political activism, often used to criticize political leaders and institutions as a whole. In America, this use of politicized satire can be traced to the American colonists in the form of satirical cartoons to mock King George and depict him as an idiot. “The Founders didn’t just enjoy humor—they believed it was politically important,” write McClennen and Remy Maisel, a recent Penn State undergraduate in media studies, who worked together on the book<em> <u>Is Satire Saving Our Nation?</u></em> “And so, they employed the pen and the sword, using satirical works as ‘weapons in a literary and ideological war to decide the future of the new Republic.'”</p>\n<p> </p>\n<p>Today, thanks to the internet, satire is more accessible than ever to the average citizen. But satire is just as important in our modern age as it was at the birth of the USA. After the 9/11 terrorist attacks, television satirists, such as Jon Stewart, who hosted the<em> Daily Show</em>, and Stephen Colbert, who hosted the <em>Colbert Report</em>, were some few people who spoke out and criticized US government officials through the use of political satire. It is important that the general public understand the greater purpose of satire in society. Satire is more than simple entertainment or ridicule. The goal of good satire is not simple mockery, but to incite larger and more in-depth conversation about controversial subjects. It’s difficult to begin a meaningful conservation about sensitive topics. Sometimes it takes controversy to break the silence.</p>\n<p> </p>\n<p>It’s easy to look at a joke or a passing comment and just think “Wow that’s offensive”. But sometimes that just may be the goal. If people don’t talk about subjects that they find offensive and break the silence on something considered taboo, it just becomes easier for injustices and acts of oppression to continue. “The point is this—and it has to be emphasized again and again—satire only reminds us of the sad state of affairs; it doesn’t create it, it can’t mock what doesn’t exist,” McClennen and Maisel write. “But, as we’ve explained, satire’s goal is not demoralizing mockery; its goal is to invigorate public debate, encourage critical thinking, and call on citizens to question the status quo.”</p>\n<p> </p>\n<p><strong><u>A Message for the People of Today</u></strong></p>\n<p> </p>\n<p>In these challenging times, stress and panic become common occurrences of our daily lives. We may not always feel it, but those feelings tend to stick around in the back of our minds. The negative psychological effects of confinement on the human mind have already been scientifically proven. Now more than ever, the need for human communication is at an all-time high. Conflict, controversy and injustice will never cease to exist. For the sake of our families, our communities, and our countries, I urge you to communicate. Now that we are more divided than ever, we must continue to communicate and discuss. We must debate and disagree, but never stay silent.  Isolation has taught us the value of human connection and I urge you to make use of the technology available to us and spread your messages. Now is not the time to censor things because we disagree. Now is the time to focus and learn how we can make real change in our communities. The future is in our own hands. We don’t live in a dystopia where we must cancel anything and everything we disagree with.</p>\n<p> </p>\n<p><em>We live in a society...</em></p>\n<p> </p>\n<p><span style=\"text-decoration: underline;\">Copyright Disclaimer:</span></p>\n<p>Under Section 107 of the Copyright Act 1976, allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.</p>\n<p><em>Images, likeness, and branding in this article are used for purposes protected under the Copyright Act of 1976 Section 107, as they fall under “fair use”.</em></p>\n<hr>\n<p class=\"align-center\"><em>Citations</em></p>\n<p>“Why We Need Satire When Times Are Tough.” Futurity, 28 Jan. 2015, www.futurity.org/satire-politics-845712/.</p>\n<p>Romano, Aja. “Why We Can't Stop Fighting about Cancel Culture.” Vox, Vox, 30 Dec. 2019, www.vox.com/culture/2019/12/30/20879720/what-is-cancel-culture-explained-history-debate.</p>\n<p>Cillizza, Chris. “What Barack Obama Gets Exactly Right about Our Toxic 'Cancel' Culture.” CNN, Cable News Network, 30 Oct. 2019, www.cnn.com/2019/10/30/politics/obama-cancel-culture/index.html.</p>\n<p>Khazan, Olga. “The Dark Psychology of Being a Good Comedian.” The Atlantic, Atlantic Media Company, 1 Mar. 2014, www.theatlantic.com/health/archive/2014/02/the-dark-psychology-of-being-a-good-comedian/284104/.</p>",
            "image": "https://blog.thegenz.org/media/posts/14/Satire-and-Cancel-Culture-1-Sebastian-Sanchez-Gui.png",
            "author": {
                "name": "Ishan Vepa"
            },
            "tags": [
                   "#society",
                   "#culture",
                   "#cancelculture"
            ],
            "date_published": "2020-07-15T11:22:45-04:00",
            "date_modified": "2020-07-15T11:22:45-04:00"
        },
        {
            "id": "https://blog.thegenz.org/educational-inequality.html",
            "url": "https://blog.thegenz.org/educational-inequality.html",
            "title": "Educational Inequality",
            "summary": "Throughout the US, education is considered one of the most valuable resources. Federal, state, and local governments work in conjunction to develop funding plans that allow students to receive at least an adequate education. Some states have developed plans to distribute funding in a way&hellip;",
            "content_html": "<p><span style=\"font-weight: 400;\">Throughout the US, education is considered one of the most valuable resources. Federal, state, and local governments work in conjunction to develop funding plans that allow students to receive at least an adequate education. Some states have developed plans to distribute funding in a way that some students receive the best education. While adequate might previously have been enough for students, it’s time to develop a system of funding that provides all students with the best education, spreading the funding equally in that manner.</span></p>\n<p><strong> Education inequality is real, and it’s dividing the upper and lower classes further and further.</strong></p>\n<p><span style=\"font-weight: 400;\">To understand the systematic problems, we must first understand the basic outline of the system. 90% of states and counties use the same method to fund their schools. The first thing determined is a minimum amount of money each school will receive per student. The state provides that much money to each school, collected through taxes. Then, the federal government provides the state a lump sum, earmarked for education. These funds are much less than those provided directly by the state, but are often directed towards lower income and minority regions. So far, it seems like minority students and lower income students are getting equal or more funding, especially with the federal funding. But this federal funding only makes up 9-10 percent of education funding.</span></p>\n<p><span style=\"font-weight: 400;\">Local funding is sourced from property taxes, and in the state of Florida, all the property tax rates fall between 0.59% and 1.26%. Most counties, however, have property tax rates between 0.85% and 1.15%, meaning most counties are receiving the same percentage of funding. The problem is there are a few counties in Florida that contain much of Florida’s wealth. Those counties receive much more funding than the rest of Florida’s schools. Because of this increased funding, they attract top teachers and are able to provide amenities not available to students in less funded schools.</span></p>\n<p><span style=\"font-weight: 400;\">The biggest issues with this funding system is it leaves kids in underfunded schools unmotivated and/or unable to perform. These students are unable to break the shackles of economic inequality, leaving them in a vicious cycle. On the other hand, students who attend well funded schools leave motivated and prepared to take on other challenges presented. Data collected by The Brookings Institution</span><a href=\"https://www.brookings.edu/research/eight-economic-facts-on-higher-education/\"><span style=\"font-weight: 400;\"> finds </span></a><span style=\"font-weight: 400;\">that a quarter of low-income students drops out of college by their second semester, a rate that is less than 10% for  higher income students. The State of Florida must come together to determine a way to lessen educational inequality.</span></p>\n<p><span style=\"font-weight: 400;\">One idea proposed is to lessen the amount of funding provided by the state, and not provide any state aid for counties which can already provide more than the minimum amount per student. These counties can fund their schools without state aid, and allow the state to send that aid into school districts which cannot meet that amount. This can be done without lowering tax rates in any county and  still providing more than adequate education to every student.</span></p>\n<p><span style=\"font-weight: 400;\">Another idea proposed taking any extra money from schools meeting the minimum per student, and put it to a “recapture pool”. This “recaptured” money is then distributed evenly among all counties regardless of their economic standing. The economic counterpoint provided to this argument is that property values will fall in the areas from which “recapture” money is collected, which has prevented southern lawmakers from boosting Florida’s education system. </span></p>\n<p><span style=\"font-weight: 400;\">We need to come together as a state and determine how to rearrange our school system. We can no longer rely on students getting a barely adequate education. Students need more support from their school to help break the bonds of economic insecurities. The harsh truth of this situation: Florida is failing most of their students, but watching as a few select students widen the economic gap.</span></p>",
            "image": "https://blog.thegenz.org/media/posts/13/Cover_ishrit.jpg",
            "author": {
                "name": "Ishan Vepa"
            },
            "tags": [
                   "#wealthgap",
                   "#inequality",
                   "#gap",
                   "#education",
                   "#class"
            ],
            "date_published": "2020-07-15T11:22:45-04:00",
            "date_modified": "2020-07-15T11:22:45-04:00"
        },
        {
            "id": "https://blog.thegenz.org/lets-go-nuclear.html",
            "url": "https://blog.thegenz.org/lets-go-nuclear.html",
            "title": "Let&#x27;s Go Nuclear!",
            "summary": "On March 28, 2019, the President of the United Nations General Assembly, Maria Fernanda Espinosa stated that the international community had about 11 years until the effects of climate change were completely irreversible. Since then the emphasis on creating a more sustainable society has been&hellip;",
            "content_html": "<p><span style=\"font-weight: 400;\">On March 28, 2019, the President of the United Nations General Assembly, Maria Fernanda Espinosa stated that the international community had about 11 years until the effects of climate change were completely irreversible. Since then the emphasis on creating a more sustainable society has been even greater than it has ever been before. In places like Florida, climate strikes occurred and had large followings. In this time of environmental consciousness, many look towards energy production and ponder as to how we can reform it to have less of an environmental strain. While options like wind energy, hydroelectric energy, and solar energy are commonly mentioned in discussions regarding alternative energy sources, however, one form that is usually ignored is nuclear energy. </span></p>\n<p><span style=\"font-weight: 400;\">Nuclear power as a concept originated in the 1930s with Enrico Fermi’s research on neutrons and their ability to split atoms. Since then, nuclear power has been improved upon and implemented in many nations as a form of creating energy. Nuclear energy is a clean, zero-emission source of energy (U.S Department of Energy), and it has avoided the emission of about 476.2 metric tons of carbon dioxide in the United States in the year 2019 alone (Nuclear Energy Institute). It is also a powerful source of energy. The Ginna nuclear power plant in New York produces about 4,689,440 MWh (U.S Energy Information Administration) In comparison, most wind turbines in the U.S produce a max of 10,000 MW (U.S Energy Information Administration). Not only is it powerful, but it is also highly used in several foreign nations. In Hungary, nuclear energy accounts for about 50.6% of all electricity produced, in Ukraine it is about 53.0%, in France it is as high as 71.7% (International Atomic Energy Agency). Nuclear energy is a highly clean and efficient form of energy production, however it does come with certain flaws. </span></p>\n<p><span style=\"font-weight: 400;\">Despite nuclear energy being a clean source of energy, it is not a renewable source of energy. According to phys.org, at the current rate at which we use uranium, it will be used up in about 80 years. However, uranium is not the only viable option for nuclear fuel. Other nuclear fuels like plutonium can be used in lieu of uranium and still result in large sums of energy. Another flaw that comes with nuclear energy is the fear of nuclear accidents. Many people envision Chernobyl-Esque disasters when they discuss nuclear energy, however, disasters like these are fairly rare. The most recent nuclear disaster was the Fukushima Daiichi nuclear disaster in 2011, which was most likely caused by the tsunami which occurred in days before the disaster. Most nuclear accidents occurred because of human error or poor machinery, which we have evolved past. </span></p>\n<p><span style=\"font-weight: 400;\">The switch to nuclear energy may not be the be-all-end-all solution to clean energy production, however, it certainly has potential. From its reliability to its lack of major environmental strain, it seems to have a lot going for it and should be discussed more in conversations regarding alternative energy sources. </span></p>",
            "image": "https://blog.thegenz.org/media/posts/12/nuclear-power-plant-4535760_1920.jpg",
            "author": {
                "name": "Ishan Vepa"
            },
            "tags": [
                   "#science",
                   "#oped",
                   "#environment",
                   "#energy"
            ],
            "date_published": "2020-07-15T11:22:45-04:00",
            "date_modified": "2020-07-15T11:22:45-04:00"
        }
    ]
}
