{
    "version": "https://jsonfeed.org/version/1",
    "title": "The Generation Z Blog",
    "description": "",
    "home_page_url": "https://blog.thegenz.org",
    "feed_url": "https://blog.thegenz.org/feed.json",
    "user_comment": "",
    "icon": "https://blog.thegenz.org/media/website/GenZLogoTransparent.png",
    "author": {
        "name": "Ishan Vepa"
    },
    "items": [
        {
            "id": "https://blog.thegenz.org/generalizing-for-generations.html",
            "url": "https://blog.thegenz.org/generalizing-for-generations.html",
            "title": "Generalizing for Generations",
            "summary": "<blockquote>\n<p><span style=\"font-weight: 400;\">to infer or form (a general principle, opinion, conclusion, etc.) from only a few facts, examples, or the like.</span></p>\n</blockquote>\n<hr>\n<p><span style=\"font-weight: 400;\">This is the definition of the word “generalize” according to Dictionary.com</span><span style=\"font-weight: 400;\">. I believe this definition is one of the most important ones that we as a society must commit to memory in order to assure that in the future we can stand hand in hand, whether those hands are black or white. </span></p>\n<p><span style=\"font-weight: 400;\">Generalizations are important, they help us to develop stereotypes that can save our lives. I am sure when somebody first met a tiger and it did not end well, the news got around and the generalization from one example that tigers will harm you was made. This led to the stereotype that tigers are ferocious and can and will eat you. This probably has saved many lives. </span></p>\n<p><span style=\"font-weight: 400;\">But, what about when generalizations which have been generations in the making create dangerous stereotypes that infect our society and create fear amongst ourselves?</span></p>\n",
            "content_html": "<blockquote>\n<p><span style=\"font-weight: 400;\">to infer or form (a general principle, opinion, conclusion, etc.) from only a few facts, examples, or the like.</span></p>\n</blockquote>\n<hr>\n<p><span style=\"font-weight: 400;\">This is the definition of the word “generalize” according to Dictionary.com</span><span style=\"font-weight: 400;\">. I believe this definition is one of the most important ones that we as a society must commit to memory in order to assure that in the future we can stand hand in hand, whether those hands are black or white. </span></p>\n<p><span style=\"font-weight: 400;\">Generalizations are important, they help us to develop stereotypes that can save our lives. I am sure when somebody first met a tiger and it did not end well, the news got around and the generalization from one example that tigers will harm you was made. This led to the stereotype that tigers are ferocious and can and will eat you. This probably has saved many lives. </span></p>\n<p><span style=\"font-weight: 400;\">But, what about when generalizations which have been generations in the making create dangerous stereotypes that infect our society and create fear amongst ourselves?</span></p>\n\n<p><span style=\"font-weight: 400;\">In a study done from 2011-2014 by doctoral student in anthropology at the University of California, Cody T. Ross, found that an unarmed black man was 3.5 times more likely to be shot when compared to a white unarmed man </span><span style=\"font-weight: 400;\">2</span><span style=\"font-weight: 400;\">. </span></p>\n<p><span style=\"font-weight: 400;\">In a study done on the Oakland Police Department from 2013-2014 by Rebecca C. Hetey, Benoît Monin, Amrita Maitreyi, Jennifer L. Eberhardt at Stanford University, it was found that the African Americans were overstopped. They also found this effect “was more pronounced when officers indicated that they could determine the race of the person before making the stop”</span><span style=\"font-weight: 400;\">3</span><span style=\"font-weight: 400;\">. They also found that African Americans were handcuffed more and searched more than white people even though white and black people had the same probability to have contraband on them. This statistic was still higher after excluding instances in which an arrest was actually made and contraband was actually found </span><span style=\"font-weight: 400;\">3</span><span style=\"font-weight: 400;\">. </span></p>\n<p><span style=\"font-weight: 400;\">Just recently, I had a discussion with someone after they said they would unfollow me because I posted on my social media that #blacklivesmatter and along the way in this conversation he brought up the dangerous stereotype that most black fathers leave their families often. </span></p>\n<p><span style=\"font-weight: 400;\">In America, there are dangerous generalizations at play that lead to dangerous stereotypes of whole groups and/or races of people. Oftentimes (if not all the time) these generalizations are unfair and are the ramifications of our racist past. This has spanned generations, for 100s of years unfair generalizations of black people have led to dangerous stereotypes. For generations we (white people) have viewed black people as lesser, as if they are inherently evil or bad, as if all black fathers leave their children, we have allowed unfair generalizations to span generations. Generalizations that were made off of untrue rumors, false testimonies, lying eye witnesses, wrongful convictions, and unfair examples. Generalizations of a whole race from a few false and/or unfair examples. These generalizations have led to unfair stereotypes in which we are seeing the ramifications of in the form police brutality and many other injustices. </span></p>\n<p><span style=\"font-weight: 400;\">The same goes for the police. We are making generalizations of the horrendous acts of a few to characterize a whole group of people. </span></p>\n<p><span style=\"font-weight: 400;\">We, as a society, must stop making generalizations on whole groups and races of people because these lead to stereotypes that make us fear each other. This fear is what leads to racial profiling, police brutality, and is what empowers white privilege. </span></p>\n<p><span style=\"font-weight: 400;\">First, we must admit making generalizations of whole groups of people off of a few people is entirely unfair and leads to dangerous stereotypes. The first step to solving a problem is admitting there is a problem. </span></p>\n<p><span style=\"font-weight: 400;\">Second, to the few people that want to do hateful, awful things, we must not condone their actions. To the murderers of the unarmed black men in America, we must not let them have the power to disrespect the police badge in America. We must vigorously detest these actions and make it known these actions are not okay. And this voice must not only be heard in the black community, but as well among the police officer and white communities also. </span></p>\n<p><span style=\"font-weight: 400;\">However, justice must be served in a loving way. We can do this by listening, by protesting, by genuinely saying “I am here, and I am listening, and I do care.” If we respond hate with hate, violence with violence, we are no better than the people that did the hateful thing in the first place. </span></p>\n<p><span style=\"font-weight: 400;\">Finally, and this is the most important, let us make every effort to serve one another humbly in love. Let’s listen to each other. Let’s stand hand in hand with each other. Let’s peacefully protest with each other. Let's see our different races, and let’s say “this is beautiful”.</span></p>\n<p><span style=\"font-weight: 400;\">Listen, we are not tigers, we are people. Our different colors of skin should not inspire fear and hatred, but instead it should inspire love. My white friend is just as beautiful as my black friend who is just as beautiful as my Indian friend who is just as beautiful Asian friend who is just as beautiful as my Latino friend and so on and so forth.</span></p>\n<p><span style=\"font-weight: 400;\">But the only way we can be beautiful is if we are beautiful together, standing hand in hand together in love. </span></p>\n<hr>\n<p class=\"align-center\"><em>Citations</em></p>\n<p>CitationsDictionary.com, “Generalize Definition.” Dictionary.com, accessed May 31, 2020</p>\n<p class=\"align-left\">Weir, Kirsten. “Policing in black &amp; white”. Monitor on Psychology vol 47, no. 11, (December 2016): pg. 36, <a href=\"https://www.apa.org/monitor/2016/12/cover-policing\">https://www.apa.org/monitor/2016/12/cover-policing</a></p>\n<p class=\"align-left\">Hetey, R. C., Monin, B., Maitreyi, A., &amp; Eberhardt, J. L. “Data for change: A statistical analysis of police stops, searches, handcuffings, and arrests in Oakland, Calif., 2013-2014.”  Stanford University, SPARQ: Social Psychological Answers to Real-World Questions, June 23, 2016, <a href=\"https://stanford.app.box.com/v/Data-for-Change\">https://stanford.app.box.com/v/Data-for-Change</a></p>",
            "image": "https://blog.thegenz.org/media/posts/9/Cover_hayden.JPG",
            "author": {
                "name": "Ishan Vepa"
            },
            "tags": [
            ],
            "date_published": "2020-05-31T19:41:57-04:00",
            "date_modified": "2020-05-31T19:42:35-04:00"
        },
        {
            "id": "https://blog.thegenz.org/remembering-the-selma-voting-rights-movement.html",
            "url": "https://blog.thegenz.org/remembering-the-selma-voting-rights-movement.html",
            "title": "Remembering the Selma Voting Rights Movement",
            "summary": "Fifty-five years ago, the raging fire of the African American Civil Rights movement found itself among the black residents of Selma, Alabama. Six hundred people attempted to march from Selma to Montgomery to demand equal voting rights and protest the murder of Jimmie Lee Jackson,&hellip;",
            "content_html": "<p>Fifty-five years ago, the raging fire of the African American Civil Rights movement found itself among the black residents of  Selma, Alabama.</p>\n<hr>\n<p style=\"font-weight: 400;\">Six hundred people attempted to march from Selma to Montgomery to demand equal voting rights and protest the murder of Jimmie Lee Jackson, a peaceful black demonstrator shot  by an Alabama State trooper. The marchers led by U.S. Representative John Lewis and Hosea Williams attempted to get past the Edmund Pettus Bridge, where they were met by a wall of Alabama State troopers. The peaceful protestors were brutally tear gassed and charged with Billie Clubs and Nightsticks. 67 people were injured critically, and the eyes of the world were on Selma, Alabama. The event that is today remembered as Bloody Sunday was one of the most disgraceful moments in our history, a day in which American values were questioned by the forces of hate, and ignorance.  This historic event occurred only 235 miles from Tallahassee, Florida.</p>\n<p style=\"font-weight: 400;\">I had the privilege of interviewing several participants in the Selma Voting Rights movement, in a recent trip to Selma.  Ms. Jo Ann Bland, a participant in several of the Selma-Montgomery marches, speaking about Bloody Sunday, stated, “I hope no one ever has to relive that moment.”  Ms. Diane Harris, another demonstrator during the event,  added how state troopers arrested people regardless of their age, and noted children as young as nine also found themselves being taken to prison.</p>\n<p style=\"font-weight: 400;\">The efforts of the demonstrators  were not in vain. Their work saw the passage of the Voting Rights Act of 1965,  a landmark piece of legislation that ensured voting rights to all people regardless of the color of their skin. Today, as the voting season comes upon us, it is important for us to remember the blood, sweat, and tears that went into the creation of legislation to protect the rights of all voters.  By voting, not only can we do our civic responsibility as citizens of the United States of America, we can honor the efforts of the activists, demonstrators, and leaders that helped make America a better place.</p>",
            "image": "https://blog.thegenz.org/media/posts/8/SelmaMonteMarch1.jpg",
            "author": {
                "name": "Ishan Vepa"
            },
            "tags": [
            ],
            "date_published": "2020-05-30T17:00:40-04:00",
            "date_modified": "2020-05-30T17:00:40-04:00"
        },
        {
            "id": "https://blog.thegenz.org/a-high-school-students-take-on-appreciating-teachers-during-covid-19.html",
            "url": "https://blog.thegenz.org/a-high-school-students-take-on-appreciating-teachers-during-covid-19.html",
            "title": "A High School Student&#x27;s Take on Appreciating Teachers During COVID-19",
            "summary": "<p> </p>\n<p>The purpose of this article is to serve as a reminder to my fellow students to appreciate our teachers during Teacher Appreciation Week, and for all the weeks after.</p>\n<hr>\n<p>I am not the quintessential “ideal student.” I procrastinate a lot. My handwriting is not the greatest. Just recently, one of my teachers jokingly (I hope) told me that it was easier to decipher handwriting from the 19th century than mine. And much to the chagrin of my teachers, I often forget including the date, and class period, at the top right corner of my sheet of lined paper. But as I sit and reflect on these gaffes, I also realize that our teachers are some of the most pivotal people in our lives. They do not just teach us. They mentor us, they guide us, and most importantly they look out for us. This week is teacher appreciation week, and we need to remember the hard work teachers do, and the sacrifices they make for us students.<br>Despite everything teachers do for us, we occasionally forget that our teachers are “normal human beings.” Often, we evade out teachers at a neighborhood grocery or look in awe if we see them at a movie theater. However, we need to remember that our teachers too, have children, family, loved ones, and pets, like the rest of us. They are doing their jobs, while going through the same hardships that we all are facing currently. Just a few days back my math teacher’s dog passed away, yet the next day, she was on Microsoft Teams, checking in with us, and making sure that we were understanding lesson content. My aunt, a high school teacher, is taking care of her husband-- a cancer patient, while teaching programming languages to her students through Zoom. Our teachers, like front line workers across the nation, are selflessly doing their job, so that we, as students, can be better prepared for challenges that are yet to come.</p>\n",
            "content_html": "<p> </p>\n<p>The purpose of this article is to serve as a reminder to my fellow students to appreciate our teachers during Teacher Appreciation Week, and for all the weeks after.</p>\n<hr>\n<p>I am not the quintessential “ideal student.” I procrastinate a lot. My handwriting is not the greatest. Just recently, one of my teachers jokingly (I hope) told me that it was easier to decipher handwriting from the 19th century than mine. And much to the chagrin of my teachers, I often forget including the date, and class period, at the top right corner of my sheet of lined paper. But as I sit and reflect on these gaffes, I also realize that our teachers are some of the most pivotal people in our lives. They do not just teach us. They mentor us, they guide us, and most importantly they look out for us. This week is teacher appreciation week, and we need to remember the hard work teachers do, and the sacrifices they make for us students.<br>Despite everything teachers do for us, we occasionally forget that our teachers are “normal human beings.” Often, we evade out teachers at a neighborhood grocery or look in awe if we see them at a movie theater. However, we need to remember that our teachers too, have children, family, loved ones, and pets, like the rest of us. They are doing their jobs, while going through the same hardships that we all are facing currently. Just a few days back my math teacher’s dog passed away, yet the next day, she was on Microsoft Teams, checking in with us, and making sure that we were understanding lesson content. My aunt, a high school teacher, is taking care of her husband-- a cancer patient, while teaching programming languages to her students through Zoom. Our teachers, like front line workers across the nation, are selflessly doing their job, so that we, as students, can be better prepared for challenges that are yet to come.</p>\n\n<p><br>During this crisis, lesson plans have gone awry, and teachers have had to adapt to virtual teaching platforms often at very short notice, overcoming hurdles that would have seemed insurmountable a few months ago. Across the country, teachers have responded with remarkable alacrity and resolve; they are following up with us, ensuring that we stay safe, and have offered us their thoughts and personal cell numbers to reach out to.<br>As a student attending a Title I school, I know that many of my peers are struggling to access digital resources. Yet, undaunted by this digital divide, my teachers are going out of their way to print out packets and are often personally delivering them to their students. Our teachers did not sign up to serve as human shields during school shootings, but they did that. Our teachers did not sign up to teach in the middle of a global pandemic, yet they are doing just that. Their strength of character, and willingness to help us under all circumstances is visible and tangible in our lives.<br>Despite this, we students complain about mundane things. Even now, I noticed how my peers and I were whining about extra credit opportunities. In retrospect, I can realize how petty that is. We simply cannot take our teachers for granted. Sometimes we forget the time a teacher helped us out when we faced a stressful situation, or when they stayed after school, just to make sure that we understood a concept. Sure, we can recognize our teachers for the hard work they are doing in a specific week meant for “teacher appreciation,” but let us resolve to appreciate our teachers regardless of the time. When we get back to school, let us remember how our teachers scheduled individual calls with us to make sure that we were alright. Let us remember how our teachers had to discard lesson plans that they made months in advance and become proficient in software applications that they would have rarely used otherwise.<br>Next time, when you are turning in your assignment, type a small thank you note for your teacher, or ask them if they are doing well. Our teachers do everything for us but ask for little in return. They could have been anything they wanted to, yet they chose to be teachers, so that they could help us achieve our dreams. Our teachers have invested more in the future of our country, than any hedge fund, or investment bank. The least we students can do… is to appreciate them.</p>\n<p> </p>",
            "image": "https://blog.thegenz.org/media/posts/7/classroom.jpg",
            "author": {
                "name": "Ishan Vepa"
            },
            "tags": [
            ],
            "date_published": "2020-05-30T16:50:35-04:00",
            "date_modified": "2020-05-30T17:24:49-04:00"
        }
    ]
}
