{
    "version": "https://jsonfeed.org/version/1",
    "title": "The Generation Z Blog",
    "description": "",
    "home_page_url": "https://blog.thegenz.org",
    "feed_url": "https://blog.thegenz.org/feed.json",
    "user_comment": "",
    "icon": "https://blog.thegenz.org/media/website/gen-z-logo-refined.png",
    "author": {
        "name": "Ishan Vepa"
    },
    "items": [
        {
            "id": "https://blog.thegenz.org/the-new-reality-of-sports.html",
            "url": "https://blog.thegenz.org/the-new-reality-of-sports.html",
            "title": "The New Reality of Sports",
            "summary": "At the start of quarantine, the world was in an odd place. School closures, followed by stay-at-home orders, all ensued internationally throughout the months of March and April. “Six feet” became a common phrase, summer plans hindered, and most importantly, life for many became dull&hellip;",
            "content_html": "<p class=\"msg msg--highlight \"><span style=\"font-weight: 400;\"><em><strong>At the start of quarantine, the world was in an odd place. School closures, followed by stay-at-home orders, all ensued internationally throughout the months of March and April. “Six feet” became a common phrase, summer plans hindered, and most importantly, life for many became dull and uneventful without the existence of televised sports. I fell into the latter. </strong></em> </span></p>\n<p><span style=\"font-weight: 400;\">Fast forward to nearly a month, George Floyd is killed by a Minneapolis policeman. This sparks passionate anti-racism protests across the United States. Feuling these calls for action is the </span><i><span style=\"font-weight: 400;\">Black Lives Matter</span></i><span style=\"font-weight: 400;\"> movement. Voicing to put an end to racially targeted violence and white supremacy. </span></p>\n<p><span style=\"font-weight: 400;\">Now as nations begin to reopen, the pandemic’s pace is quickening worldwide, and the Black Lives Matter movement is continuing to gain traction, we see how these factors all intertwine with the return of sports. </span></p>\n<p><strong><span style=\"text-decoration: underline;\">NASCAR &amp; PGA Tour</span></strong></p>\n<p><span style=\"font-weight: 400;\">The Professional Golfers Association Tour returned on June 11. NASCAR returned on May 17. Both including an abundance of testing and safety measures. Both had no spectators.</span></p>\n<p><span style=\"font-weight: 400;\">A point speaking against systemic racism, for both sports, had been set.  Every morning of the PGA Tour officials dedicate the 8:46 am tee time to a minute of silence to “amplify the voices and efforts underway to end system issue of racial and social injustices impacting our country”. NASCAR driver Bubba Wallace raced a car with a </span><i><span style=\"font-weight: 400;\">Black Lives Matter</span></i><span style=\"font-weight: 400;\"> paint scheme. The hood and rear bumper presenting a painting of a black and white hand clasped with the saying “compassion, love, understanding.”  </span></p>\n<p><strong>“Listening and learning. Educating ourselves. So people will look up what this hashtag means. And hopefully, get a better understanding.” Says Wallace, the first Black driver in the Cup Series since 1971.</strong></p>\n<p><span style=\"text-decoration: underline;\"><strong>Soccer</strong></span></p>\n<p><span style=\"font-weight: 400;\">Soccer was one of the first major sports to return since the coronavirus crisis. German Bundesliga became the first league to return on May, 16. Followed by Spain’s La Liga on June 11 and English Premier Leauge on June 17. All returning as a continuation of the season before the coronavirus.  Major League Soccer returned in North America as a new tournament cup-style competition on July 8. </span></p>\n<p><span style=\"font-weight: 400;\">All returning leagues had no fans and social distancing among the bench players was enforced.</span></p>\n<p><span style=\"font-weight: 400;\">Watching top-level footballers play with almost complete silence rather than the passionate roar of the crowd is an odd adjustment for many, but it’s still soccer. </span></p>\n<blockquote>\n<p><strong>“It’s strange and unfamiliar, it makes your heart bleed,” Borussia Dortmund’s sporting director Micheal Zorc said after the first game of the Bundesliga kicked off.</strong></p>\n</blockquote>\n<p><span style=\"font-weight: 400;\">The </span><i><span style=\"font-weight: 400;\">Black Lives Matter</span></i><span style=\"font-weight: 400;\"> movements’ solidarity proves to not only be within the United States as its global implications are seen with the restart of these various soccer leagues. </span><i><span style=\"font-weight: 400;\">Black Lives Matter</span></i><span style=\"font-weight: 400;\"> support dominates the Premier League start, as all 20 teams wear “Black Lives Matter” on the backs of their shirts, replacing their names, for the first 12 matches. Even more powerful of an image, at the start of each match, following the first whistle, all players on the field simultaneously take a knee to send a clear message that the league stands as one in the fight against racism and inequality. This powerful sentiment doesn’t stop within England. Support for BLM is also seen within Germany’s Bundesliga. </span></p>\n<p><span style=\"text-decoration: underline;\"><strong>Basketball </strong></span></p>\n<p><span style=\"font-weight: 400;\">The National Basketball Association is set to return on July 30. All games will be played at the ESPN Wide World of Sports complex in Orlando, Florida.</span><strong> </strong></p>\n<p><span style=\"font-weight: 400;\">Similar to soccer, fans will not be allowed to attend any of the games and social distancing rules will be strict. A 113-page health-and-safety document details everything from proper ways to disinfect the basketballs used in individual workouts to the protocol set once teams arrive in Orlando.</span></p>\n<p><span style=\"font-weight: 400;\">Many players in the NBA have been vocal about the importance of racial equality and social justice being a central part of the NBA and WNBA’s return. The National Basketball Players Association is planning to paint “Black Lives Matter” on the court inside both sidelines of all three Orlando arenas. President of the NBA Player’s Union, Chris Paul, told ESPN that the league and union were collaborating to allow players to replace the names with personalized messages linked to social justice on the backs of their jersey’s. </span></p>\n<p><strong><span style=\"text-decoration: underline;\">Takeaway</span></strong></p>\n<p><span style=\"font-weight: 400;\">With the new protocol concerning the coronavirus being implemented with the return of sports, it is proven that they are not looking the same way they did before the pandemic. Yes, they’re back but adjustments have been made to harmonize with the state of the world. </span></p>\n<p><span style=\"font-weight: 400;\">Similarly, the sports world’s involvement and connection to social change are just as significant. As a viewer and supporter of these powerful sports teams and leagues, I have their attention and respect. Not only for me but for millions of other individuals like me, these athletes are role models. The usage of this power that athletes and sports organizations have on society is meaningful and necessary.</span></p>\n<p><span style=\"font-weight: 400;\"> Especially in these times of confusion and adversity. Now we are understanding that sports are more than just entertainment. Sports leagues, teams, and athletes have platforms with the power to invoke positive change and discussion. All things considered, I believe this is why something as simple as the replacement of an athlete’s name to the phrase “Black Lives Matter” onto their jerseys, speaks volumes. And can later pave the way for deeper underlying issues, for example, the lack of black coaching or directors in many sports leagues.</span></p>\n<hr>\n<p class=\"align-center\"><i><span style=\"font-weight: 400;\">Citations</span></i></p>\n<p><span style=\"font-weight: 400;\">Creditor, Avi. “Details of Premier League's Return Come Further Into Focus.” </span><i><span style=\"font-weight: 400;\">Sports Illustrated</span></i><span style=\"font-weight: 400;\">, 4 June 2020, </span><a href=\"http://www.si.com/soccer/2020/06/04/premier-league-return-fixtures-substitute-rules-details\"><span style=\"font-weight: 400;\">www.si.com/soccer/2020/06/04/premier-league-return-fixtures-substitute-rules-details</span></a><span style=\"font-weight: 400;\"> </span></p>\n<p><span style=\"font-weight: 400;\">Blumenthal, E., 2020. NBA Restart: Everything You Need To Know About Basketball's 2020 Return. CNET. Available at: </span><a href=\"https://www.cnet.com/news/nba-restart-everything-you-need-to-know-about-basketballs-2020-return/\"><span style=\"font-weight: 400;\">https://www.cnet.com/news/nba-restart-everything-you-need-to-know-about-basketballs-2020-return/</span></a></p>\n<p><span style=\"font-weight: 400;\">Games, &amp;., League, N., Sports, O., BB, R., FB, R., Olympics, S. and Games, X., 2020. Sources: NBA Plans 'Black Lives Matter' On Courts. ESPN.com. Available at: </span><a href=\"https://www.espn.com/nba/story/_/id/29384944/nba-plans-paint-black-lives-matter-courts-orlando\"><span style=\"font-weight: 400;\">https://www.espn.com/nba/story/_/id/29384944/nba-plans-paint-black-lives-matter-courts-orlando</span></a><span style=\"font-weight: 400;\"> </span></p>\n<p><span style=\"font-weight: 400;\">Golf Channel. 2020. After Moment Of Silence, PGA Tour Knows It Can't Stay Silent On Race. Available at: </span><a href=\"https://www.golfchannel.com/news/after-moment-silence-pga-tour-knows-it-cant-stay-silent-race\"><span style=\"font-weight: 400;\">https://www.golfchannel.com/news/after-moment-silence-pga-tour-knows-it-cant-stay-silent-race</span></a><span style=\"font-weight: 400;\"> </span></p>\n<p><span style=\"font-weight: 400;\">Amir Vera and Steve Almasy, C., 2020. NASCAR's Bubba Wallace Will Have Black Lives Matter Paint Scheme On Car At Martinsville Speedway Race. CNN. Available at: </span><a href=\"https://www.cnn.com/2020/06/09/us/bubba-wallace-confederate-flag-trnd/index.html\"><span style=\"font-weight: 400;\">https://www.cnn.com/2020/06/09/us/bubba-wallace-confederate-flag-trnd/index.html</span></a><span style=\"font-weight: 400;\"> </span></p>\n<p><span style=\"font-weight: 400;\">ESPN.com. 2020. Sources: NBA Plans 'Black Lives Matter' On Courts. [online] Available at: </span><a href=\"https://www.espn.com/nba/story/_/id/29384944/nba-plans-paint-black-lives-matter-courts-orland\"><span style=\"font-weight: 400;\">https://www.espn.com/nba/story/_/id/29384944/nba-plans-paint-black-lives-matter-courts-orland</span></a><span style=\"font-weight: 400;\"> </span></p>\n<p><span style=\"font-weight: 400;\">Wbur.org. 2020. Athletes Take A Leading Role In Black Lives Matter Protests. Available at: </span><a href=\"https://www.wbur.org/onlyagame/2020/06/05/black-lives-matter-protests-ken-shropshire\"><span style=\"font-weight: 400;\">https://www.wbur.org/onlyagame/2020/06/05/black-lives-matter-protests-ken-shropshire</span></a><span style=\"font-weight: 400;\"> </span></p>\n<p><span style=\"font-weight: 400;\">Liew, J., 2020. Black Lives Matter Has Exposed Sport's Underlying Failure To Deal With Racism | Jonathan Liew. the Guardian. Available at: </span><a href=\"https://www.theguardian.com/sport/2020/jun/13/black-lives-matter-sports-underlying-failure-racism\"><span style=\"font-weight: 400;\">https://www.theguardian.com/sport/2020/jun/13/black-lives-matter-sports-underlying-failure-racism</span></a><span style=\"font-weight: 400;\"> </span></p>\n<p><br><br><br><br><br><br><br><br><br><br></p>",
            "image": "https://blog.thegenz.org/media/posts/25/pasted-image-0-GenerationZ-Chronicle.png",
            "author": {
                "name": "Ishan Vepa"
            },
            "tags": [
                   "#sportsnow",
                   "#sports",
                   "#society",
                   "#socialdistancing",
                   "#covid19",
                   "#coronavirus",
                   "#blacklivesmatter",
                   "#advocacy"
            ],
            "date_published": "2020-07-20T09:44:00-04:00",
            "date_modified": "2020-07-20T09:44:00-04:00"
        },
        {
            "id": "https://blog.thegenz.org/mental-health-stigmatized.html",
            "url": "https://blog.thegenz.org/mental-health-stigmatized.html",
            "title": "Mental Health: Stigmatized",
            "summary": "The topic of mental health in today's society has been stigmatized for decades: no one is open to talk about it. You or someone you know may have a mental disorder, and the person affected might not even know due to how the media has&hellip;",
            "content_html": "<p class=\"align-center msg msg--highlight \"><em><strong>The topic of mental health in today's society has been stigmatized for decades: no one is open to talk about it.</strong></em></p>\n<hr>\n<p><span style=\"font-weight: 400;\">You or someone you know may have a mental disorder, and the person affected might not even know due to how the media has portrayed mental health. The news has cast a shadow over mental health, speaking of crimes committed and murders caused by mental illnesses, but the truth of the matter is that 50 percent of all people on Earth will be diagnosed with a mental illness/disorder in their lifetimes, not including the millions of non-documented cases or the millions of people not actually aware that they may actually have a mental disorder at all. These kinds of diseases plague our day to day lives, and most people never even notice them.</span></p>\n<p><strong>What is Mental Health?</strong></p>\n<p><span style=\"font-weight: 400;\">The Centers for Disease Control describes mental health like this: “Our emotional, psychological, and social wellbeing.” If that sounds like a very large portion of our lives, that’s because it is. Our mental health is everything that goes on in our minds, whether it be our daily emotions or a deep-rooted state of depression. Our minds are what keep us conscious and alive, so it is important to address mental illnesses no matter how hard it may be to speak about the topic.</span></p>\n<p><strong>Depression and Anxiety.</strong></p>\n<p><span style=\"font-weight: 400;\">Perhaps one of our most stigmatized mental disorders, depression is a disorder that millions of people must endure every year. Anxiety, on the other hand, has improved in how it has been addressed in the general public, now it being fairly easy to self-diagnose and is easy to receive treatment for. These two may seem very different, but they are deeply intertwined with each other. Almost half of those affected by depression also are also diagnosed with an anxiety disorder as stated by The Anxiety and Depression Association of America. </span></p>\n<p><strong>Warning Factors of Mental Disorders.</strong></p>\n<p><span style=\"font-weight: 400;\">Here are some causes of mental disorders. Keep in mind if you fall into one of these categories, it just means you have a higher probability of being affected by a mental illness, not that you are.</span></p>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Trauma from previous events, possibly of abuse</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Family members being affected</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Experience with serious medical conditions</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">The feeling of loneliness, even if not alone</span></li>\n</ul>\n<p><strong>Symptoms.</strong></p>\n<p><span style=\"font-weight: 400;\">Here are a few common symptoms of mental illnesses. If you notice that you fit into one or more of these, please contact your healthcare provider to get diagnosed and treated. Remember, mental health isn’t a joke, mental illnesses can very easily cause death.</span></p>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Lack of the ability to concentrate</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Extreme feelings of guilt, anger, sadness, etc.</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Suicidal thinking</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Changes in eating habits</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Low energy</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Large mood-swings</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Trouble relating to people</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Constant paranoia </span></li>\n</ul>\n<p><strong>In Conclusion...</strong></p>\n<p><span style=\"font-weight: 400;\">If you notice that someone you know may have a mental disorder based upon the warning signs and symptoms described above, don’t hesitate to speak with them about it. If they don’t, it’s better safe than sorry. If they do, you may have saved a life. Also, take a look at the sources listed below for more information on depression, anxiety, and mental health in general.</span></p>\n<ul>\n<li style=\"font-weight: 400;\"><a href=\"https://adaa.org/about-adaa/press-room/facts-statistics\"><span style=\"font-weight: 400;\">Adaa.org</span></a></li>\n<li style=\"font-weight: 400;\"><a href=\"https://www.cdc.gov/mentalhealth/learn/index.htm\"><span style=\"font-weight: 400;\">cdc.gov</span></a></li>\n</ul>",
            "image": "https://blog.thegenz.org/media/posts/24/Mental-Health-Rohan-Thapliyal.jpg",
            "author": {
                "name": "Ishan Vepa"
            },
            "tags": [
                   "#youth",
                   "#society",
                   "#mentalhealth",
                   "#health",
                   "#advocacy"
            ],
            "date_published": "2020-07-20T09:44:00-04:00",
            "date_modified": "2020-07-20T09:44:00-04:00"
        },
        {
            "id": "https://blog.thegenz.org/the-fight-to-end-the-global-water-crisis.html",
            "url": "https://blog.thegenz.org/the-fight-to-end-the-global-water-crisis.html",
            "title": "The fight to END the Global Water Crisis",
            "summary": "Millions of people in Africa and all over the world do not have access to clean, safe, drinking water. They have to walk up to 3 miles just to drink water that is contaminated with animal feces, bugs, dirt, and much more. What is the&hellip;",
            "content_html": "<p class=\"msg msg--highlight \"><em><span style=\"font-weight: 400;\"><strong>Millions of people in Africa and all over the world do not have access to clean, safe, drinking water. They have to walk up to 3 miles just to drink water that is contaminated with animal feces, bugs, dirt, and much more.</strong> </span></em></p>\n<hr>\n<p><strong><i>What is the Global Water Crisis:</i></strong></p>\n<p><span style=\"font-weight: 400;\">Did you know that 663 million people on this planet lack access to safe drinking water? This number is growing as water becomes more scarce around the world. Many people know that there is a shortage of water in places like Africa. However, they do not understand the effects of the Global Water Crisis and the extent of how bad it actually is. You might be wondering...well how is dirty water really that bad? The water that people in Africa have to drink is not only filled with dirt and other natural products, but it contains a lot of bacteria. This bacteria causes many different waterborne illnesses. Every 21 Seconds, a child dies from a water-related illness. In Africa, the most common type of illness is HIV and AIDS. This disease is spread through dirty water and is passed around the area.</span></p>\n<p><strong><i>What are the Effects of Not Having Clean Water:</i></strong></p>\n<p><span style=\"font-weight: 400;\">Aside from getting many different waterborne diseases like HIV/AIDS, there are many effects. For instance, many kids have to miss school to help their families get water. As previously stated, the average distance that many families walk to get water is 3.75 miles. This takes a long time, and in many families, the kids and the women are the ones that have to take this long journey. When a 5-gallon jerrycan gets filled with water, it weighs about 44 pounds. Women and kids have to carry that jerrycan back and forth from the muddy lake water. The effects of drinking contaminated water not only hurt your health, but it also affects your lifestyle and mental well-being. Kids are not able to play or talk to other kids because they are too busy getting water for their family and friends. </span></p>\n<p><strong><i>How Can You Help:</i></strong></p>\n<p><span style=\"font-weight: 400;\">There are many ways to help this cause and END the Global Water Crisis. One of the best ways to help is to spread awareness. By spreading awareness, more people will know about the cause and feel more inclined to donate! You can spread awareness by posting on social media explaining what the problem is and how they can help. You can also share about the Global Water Crisis with friends and family members and convince them to donate. Another good way to help this issue is to set up an online fundraising page where people can donate. You can share this with people on social media or let them know by talking about it in person. Especially, in today’s world, everything is digital. Setting up an online platform makes it easy for people to donate! The last and one of the most effective ways to help END the Global Water Crisis is to host a fundraiser at your school, church, or another organization in your community. A fundraiser is one of the best ways to help this issue because it brings awareness and forces people to donate. Also, a fundraiser is super fun! They can range anywhere from a pasta dinner to a football game, it’s up to you! The most important thing is that you take action on this cause and do your part to put the global water crisis into the</span></p>",
            "image": "https://blog.thegenz.org/media/posts/23/Kid_enjoying_with_clean_water-Tia-Guay.jpg",
            "author": {
                "name": "Ishan Vepa"
            },
            "tags": [
                   "#science",
                   "#environment",
                   "#energy",
                   "#climate"
            ],
            "date_published": "2020-07-20T09:44:00-04:00",
            "date_modified": "2020-07-20T09:44:00-04:00"
        },
        {
            "id": "https://blog.thegenz.org/water-conservation-and-what-we-can-do-to-help.html",
            "url": "https://blog.thegenz.org/water-conservation-and-what-we-can-do-to-help.html",
            "title": "Water Conservation and What We Can Do to Help",
            "summary": "Water is an important and necessary part of everyday life. 60% of the human body is made up of water and 71% of the Earth’s surface consists of water as well, according to the USGS. With such an important resource, it is surprising that many&hellip;",
            "content_html": "<p class=\"msg msg--highlight  align-center\"><strong>Water is an important and necessary part of everyday life. 60% of the human body is made up of water and 71% of the Earth’s surface consists of water as well, according to the USGS. With such an important resource, it is surprising that many people do not know that fresh water is not a renewable source.</strong></p>\n<p><span style=\"font-weight: 400;\">You may be thinking, ‘How can water not be renewable? After all, the water cycle is a repeated process, so therefore water must be a renewable resource.’ Even though there is a water cycle, the use of fresh water should be considered a nonrenewable resource. Even though so much of the Earth’s surface is made up of water, only 3% is fresh water, according to National Geographic. And of that 3%, only 1% can be used as drinking water (the other 2% is frozen) according to Sorcatic.org. The rest is saltwater, which can’t be used in our daily life. </span></p>\n<p><span style=\"font-weight: 400;\">Saltwater can be purified into freshwater, however, it does take energy. One way is through a process called reverse osmosis. This process takes saltwater and forces it through a permeable membrane, which removes the larger particles of unwanted material and leaves behind clean water. However, this process does take energy, as stated previously, which means that the process can’t be used as evidence for freshwater being renewable.</span></p>\n<p><span style=\"font-weight: 400;\">Some areas don’t even have access to freshwater locally, so it takes a lot of energy to get it to them. Many places around the world are not near freshwater naturally, which would mean that water would have to be transported there, which contributes to the increasing usage of energy throughout the world.</span></p>\n<p><span style=\"font-weight: 400;\">When reading these statistics, you may wonder why you should worry about it. It’s not like what you do has any control over how much water is available in the world, right? Well, you do have a lot of control over how you use your water. Americans use around 80 to 100 gallons of water a day (USGS). Imagine the amount of water you can save once you become aware of the number of gallons you use daily! Here are some tips on how you can save water in your day to day life right now!</span></p>\n<ul>\n<li style=\"font-weight: 400;\"><strong>Taking shorter showers: </strong><span style=\"font-weight: 400;\">Did you know that a 20-minute shower uses around 50 gallons (the Sacramento Bees)? Instead of taking a long shower, try to shorten the amount of time you are showering for!</span></li>\n<li style=\"font-weight: 400;\"><strong>Turn off the water when brushing:</strong><span style=\"font-weight: 400;\"> While you are brushing your teeth, you don’t need to have the faucet running. This eliminates the wastage of water when you aren’t even using it! This tip saves around 4 gallons of water each time you brush your teeth (the San Diego Union-Tribune)!</span></li>\n<li style=\"font-weight: 400;\"><strong>Don’t use your toilet to throw away tissues: </strong><span style=\"font-weight: 400;\">Using the toilet to throw away tissues and other types of garbage wastes around 5 to 7 gallons of water (the City of Santa Cruz). Instead, use a trash can, which does not need water to function!</span></li>\n<li style=\"font-weight: 400;\"><strong>Use your laundry machine when full:</strong><span style=\"font-weight: 400;\"> These appliances use a ton of water! The laundry machine uses 23 gallons, according to the water footprint calculator. By using them when they are full, you are saving water by not using the machines in excess.</span></li>\n</ul>\n<p> </p>\n<p><span style=\"font-weight: 400;\">There are also other ways you can save water! One way freshwater is lost is through runoff. Runoff harms the environment by increasing the amount of pollution in water systems (and therefore decreasing the amount of fresh water available). Runoff carries what is on the road while it is raining, for example, fertilizers and litter. It then carries these things into the sewer drains and other large bodies of water. The following ideas are ways you can prevent runoff and that you may need an adult before doing:</span></p>\n<ul>\n<li style=\"font-weight: 400;\"><strong>Rain Garden: </strong><span style=\"font-weight: 400;\">A rain garden is part of a landscape and is put in areas where water accumulates. This helps prevent runoff (when rainwater goes into sewer drains), helping the environment.</span></li>\n<li style=\"font-weight: 400;\"><strong>Green Roof:</strong><span style=\"font-weight: 400;\"> A green roof is when the roof of a building is covered with plants. This helps collect rainwater that usually accumulates on the roofs of buildings.</span></li>\n<li style=\"font-weight: 400;\"><strong>Permeable Pavement: </strong><span style=\"font-weight: 400;\">Permeable pavement is a type of pavement that absorbs rainwater, instead of allowing it to go into the sewer drains. This also helps prevent runoff.</span></li>\n<li style=\"font-weight: 400;\"><strong>Rain Barrel: </strong><span style=\"font-weight: 400;\">A rain barrel helps collect rainwater, which allows you to use it for other uses, such as watering gardens!</span></li>\n</ul>\n<p> </p>\n<p><span style=\"font-weight: 400;\">If you and the people around you use these tips to conserve the fresh water on Earth, you would be saving an abundance of water. This would help save the amount of water that is left for future generations too!</span></p>\n<p><br><br><br></p>",
            "image": "https://blog.thegenz.org/media/posts/22/waterpic-Anika-Mathur.jpeg",
            "author": {
                "name": "Ishan Vepa"
            },
            "tags": [
                   "#science",
                   "#infrastructure",
                   "#environment"
            ],
            "date_published": "2020-07-20T09:44:00-04:00",
            "date_modified": "2020-07-20T09:44:00-04:00"
        },
        {
            "id": "https://blog.thegenz.org/student-led-organizations-get-involved.html",
            "url": "https://blog.thegenz.org/student-led-organizations-get-involved.html",
            "title": "Student-Led Organizations: Get Involved",
            "summary": "Seven years ago, my elementary guidance counselor suggested I join the school's student government. I have been a member ever since. Three years ago, a community leader approached me during one of my school's student government meetings. She offered me a position on the city&hellip;",
            "content_html": "<p><span style=\"font-weight: 400;\">Seven years ago, my elementary guidance counselor suggested I join the school's student government. I have been a member ever since. Three years ago, a community leader approached me during one of my school's student government meetings. She offered me a position on the city government's youth advisory board. Five months ago, through that local board, I was made aware of a state program, and eventually applied and got accepted into the program. This is where I met Ananda Chatterjee, who invited me to become a project member on Generation Z Media. </span></p>\n<p><span style=\"font-weight: 400;\">Among all of these occurrences, there is one common denominator—a single shared factor—that opened the doors for building new connections, and paved the way for creating many valuable opportunities. It was this one unique underlying influence that has shaped the entirety of my school career and my academic outcomes. Do you have any guess as to what it may be? </span></p>\n<p><strong>Student-led organizations. </strong></p>\n<p><span style=\"font-weight: 400;\">Student-led organizations have helped me expand my social circle and build a successful academic portfolio. And, more importantly, they have taught me necessary character skills toward being successful as an individual. To name just a few skills: </span></p>\n<p><strong>Collaboration and leadership. </strong></p>\n<p><span style=\"font-weight: 400;\">Student-led organizations challenge students to work together to tackle relevant issues. It was during the Vietnam War that a common goal for peace united students in battling a legal challenge dragging out to the highest court of the land, and eventually ended in a hard-earned victory for the unwavering youth movement. Through bold leadership and collaboration with community leaders, the five-member student movement fought for their right to freedom of expression, and preserved that right for themselves and the entire nation's public schooling. </span></p>\n<p><strong>Creativity.</strong></p>\n<p><span style=\"font-weight: 400;\">Students leading organizations often come together under a common goal. Advocacy of peace in Vietnam (and by extension, freedom of expression) was the common goal of the students in the example of Tinker v. Des Moines. However, it is not necessarily usual for student-led organizations to have a national goal to guide their ambitions. Goals for student-led organizations need to resonate with youth, meaning talented and intelligent students must cautiously consider appropriate goals, requiring out-of-the-box thinking. Student-led organizations push for creativity in youth. </span></p>\n<p><span style=\"font-weight: 400;\">Junior State of America, for example, is a relatively new student-led organization that advocates for youth participation in democracy.  Organized in all parts of the country, students collaborate to brainstorm creative methods of expanding voting in local, state, and national elections to all up-and-coming voters. Chapters of the organization coordinate voter-registration drives in schools and host conferences for students to discuss pressing issues at all levels of democracy. Since its creation, Junior State of America has over 500,000 student members and has been supported by the likes of personalities such as Colin Powell and Ralph Nader. In another example, Generation Z Media, founded and led by students, aims to shine light on pressing and unique issues facing youth to encourage informed and involved Generation Z'ers. Founded less than a year ago, the organization has already begun a successful campaign to spread awareness on youth poverty in Florida’s state capital, and has since expanded operations to both coasts of Florida as well as three other states.</span></p>\n<p><strong>Get Involved.</strong></p>\n<p><span style=\"font-weight: 400;\">The importance of student-led organizations is undeniable. The number of clubs in schools, social media groups, and community gatherings all geared toward students is evident of our instinct as youth for desiring to organize as a collective. Unity is strength; division is weakness.  </span></p>\n<p><span style=\"font-weight: 400;\">If you're looking to speak out, or to advocate for a goal, or to simply get involved in your school or community, do not go at it alone. Reach out to friends, siblings, or classmates. Lead a coalition that will help spearhead your organization. You may end up building a movement that goes on to change the world.</span></p>",
            "image": "https://blog.thegenz.org/media/posts/21/New-Africa-Shutterstock-Bertell-Butler.jpg",
            "author": {
                "name": "Ishan Vepa"
            },
            "tags": [
                   "#youth",
                   "#society",
                   "#education",
                   "#community",
                   "#advocacy"
            ],
            "date_published": "2020-07-20T09:44:00-04:00",
            "date_modified": "2020-07-20T09:44:00-04:00"
        },
        {
            "id": "https://blog.thegenz.org/voter-turnout.html",
            "url": "https://blog.thegenz.org/voter-turnout.html",
            "title": "Voter Turnout",
            "summary": "Voter registration and turnout have been historically prominent topics. The election of 1920, which gave Warren Harding his first (and only) term, was the first time that voter turnout was recorded dipping below 50%. Our recent presidential election had a voter turnout at of 55.7%.",
            "content_html": "<p>Voter registration and turnout have been historically prominent topics. The election of 1920, which gave Warren Harding his first (and only) term, was the first time that voter turnout was recorded dipping below 50%. Our recent presidential election had a voter turnout at of 55.7%. From the first election, including women's suffrage to the first billionaire president, we're going to break down voter turnout and see just why America isn't getting back up to that 70% voter mark, a significant number which is widely agreed to represent a good portion of the country.</p>\n<p> </p>\n<p><strong>The Election of 1920</strong></p>\n<p>The election of 1920 presented, for the first time, women with the right to vote. With the 19th amendment, which was ratified on August 18th, 1920, women finally were granted voting rights, changing the potential voter turnout on its head. The electorate instantly diversified and thanks to mistakes made by incumbent Woodrow Wilson (D), the Republican Party took the lead. The introduction of women to the electorate nearly doubled the voting age population (VAP), but it didn't increase voter turnout much. Small local polls in urban and suburban Chicago note that most women didn't vote due simply to ignorance or lack of interest in politics. Warren Harding's \"Return to Normalcy\" couldn't register with enough of the revised electorate, and the nation registered a record low voter turnout at 49.2%. This staggering 12.4% drop between 1916 and 1920 remains the largest drop in voter turnout between two presidential elections, and the third lowest voter turnout in Americ  an history. For the first time, less than half of America was represented in the popular vote.</p>\n<p> </p>\n<p><strong>The Election of 1924</strong></p>\n<p>I promise we will not go through all the elections, but the election of 1924 presents an even more astonishing statistic - 48.9%. The lowest percentage of voter turnout in U.S. history. The reasons for lack of voter turnout are largely the same as the last election, but this time in greater effect. Parties, especially the Republican party, were breaking into factions, only making the election harder to follow. The diversifying views likely made people, especially women of the new electorate, feel more ignorant. This idea is especially important as America was now well into the Roaring Twenties, a time of economic expansion and cultural explosion. The clash of new ideas with more conservative ones split the nation in such a way, that for the last time, a president would win the election without taking any former confederate states. </p>\n<p> </p>\n<p><strong>The Election of 1972</strong></p>\n<p>In elections leading up to that of 1972, America saw a general rise in voter turnout. In 1972, however, incumbent Richard Nixon was running seemingly unopposed. Largely a favorite among Americans across the country, the democratic nominee, George McGovern, stood little chance of winning. So why the drop in voter turnout? The election of 1972 was the first where the voting age was lowered to 18. Just like in 1920, the expansion of the electorate did not translate to much of an increase in voter turnout. Many of these young adults, especially young males just coming back from Vietnam or still stuck in Vietnam, had an anti-government sentiment, and Nixon won the election with ease. From '72 to modern day, we haven't seen an election with a 60% voter turnout. In fact, for the next 4 elections, the voter turnout would stagnate and then even dip into the 40% range.</p>\n<p> </p>\n<p><strong>The Election of 1996</strong></p>\n<p>The final election we're covering is the election in 1996. This election is the last time America has hit the 40% range, voter turnout reaching 49.0%. The political toxicity of the time had reached Americans. Politics had become more about mud-slinging your opponent than telling the public what you offered. Incumbent Bill Clinton (D) ran against Bob Dole (R) in a tight race. Voters lost interest despite the best efforts of groups like Rock the Vote, a non-profit group whose mission is \"to engage and build the political power of young people.\" While groups like this targeted the growing young generation, people of all ages had lost interest in voting for candidates who spent their billions on television ads rather than grassroots campaigning.</p>\n<p> </p>\n<p>Voter turnout is still a problem today, especially among younger voters. While states are starting to mandate civics courses in classrooms, voter turnout isn't reaching 70% or higher anymore. For all our first time voters, and even our more experienced ones, we encourage you to vote this election season. While it is nearly impossible to find a candidate who meets all your expectations, by not voting for anyone, you might have given the advantage to a candidate you completely disagree with. Regardless of how insignificant a single vote may seem, everyone's votes count. <br>Now that we have gone over historic votes and the highs and lows of voter turnout, I think it’s important to acknowledge modern day voter suppression, and how we as a country can eliminate it. </p>\n<p> </p>\n<p>The first step to helping fix this problem? Identify signs of the problem. Voter suppression is the legal, active pursuit of stopping groups of people from voting by creating laws applied to everyone, but that only affects stereotypes. Breakdown: The party in control at any given point does not want to give that control up. Because the two major parties in the U.S. are often voted by opposite stereotypes, the party in control tries to bar stereotypes that fit each group from attending the polling stations. These laws apply to everybody in the state, but only really affect one group of people.</p>\n<p> </p>\n<p>“But that’s not fair! The majority can get blocked out by minority voices!” Absolutely. This is why we need to address voter suppression fast. Some present day examples of voter suppression include barriers in voter registration, early voting, and voter ID requirements. As noted by the ACLU, in many states, including Florida, early voting time was decreased, nearly cut in half. By eliminating early voting, groups of people who cannot leave their jobs to vote lose their voice. These voters tend to be minority races and groups. </p>\n<p> </p>\n<p>Additionally, some states choose to pass laws relating to voter I.D., often mandating a government issued I.D. while 1/10 of all Americans do not have a government issued I.D., 1/4 of all African American voters have no government issued I.D. which effectively hurts the overall minority vote. 15% of minorities making less than $35,000/year do not have government issued I.D.s. For more information on minority statistics look <a href=\"https://www.aclu.org/facts-about-voter-suppression\">here (ACLU website)</a>. </p>\n<p> </p>\n<p>So what can we do about this? It seems like sometimes the system is overbearing. The system seems like it can stop you from voting. </p>\n<p> </p>\n<ol>\n<li>Get your friends and family to vote. Even of the available electorate, as I outlined, not everybody votes, so get everyone of the available electorate to vote. </li>\n<li>Double check to make sure you are registered to vote.</li>\n<li>Cover shifts for each other so you can vote. </li>\n<li>Petition to open more testing centers and extend early voting.</li>\n</ol>\n<p> </p>\n<p class=\"align-center msg msg--highlight \"><strong>History has shown us how voters can become unconcerned with their political representatives. While the system is flawed, it’s the system we must abide by, and to throw away our voice would be nothing short of dishonoring our own values.</strong></p>",
            "image": "https://blog.thegenz.org/media/posts/20/voter_turnout_pic.jpg",
            "author": {
                "name": "Ishan Vepa"
            },
            "tags": [
                   "#vote",
                   "#society"
            ],
            "date_published": "2020-07-20T09:44:00-04:00",
            "date_modified": "2020-07-20T09:44:00-04:00"
        },
        {
            "id": "https://blog.thegenz.org/road-infrastructure-and-improvements-to-preserve-the-environment.html",
            "url": "https://blog.thegenz.org/road-infrastructure-and-improvements-to-preserve-the-environment.html",
            "title": "Road Infrastructure and improvements to preserve the environment",
            "summary": "Road Infrastructure: Infrastructure is the essential structure of different branches of society that provides value and benefit to our society. Specifically, road infrastructure focuses on our road transportation systems. This specific branch of infrastructure develops new methods and models on transportation, as well as developing&hellip;",
            "content_html": "<p><strong>Road Infrastructure:</strong></p>\n<p><strong>           </strong>Infrastructure is the essential structure of different branches of society that provides value and benefit to our society. Specifically, road infrastructure focuses on our road transportation systems. This specific branch of infrastructure develops new methods and models on transportation, as well as developing new roads to help transport items. However, research has shown that the current road infrastructure can be hazardous to the environment.</p>\n<p><strong>Environmental Impacts:</strong></p>\n<p><strong>         </strong>In our transportation systems, we utilize automobiles and trucks to transport people and goods. It is both efficient and convenient to our society. However, our transportation systems have been proven to be harmful to the environment.</p>\n<p>       In most automobiles, gasoline is the primary source of fuel. Gasoline is produced from oil which is derived from petroleum. Petroleum is made of various hydrocarbons; basically hydrogen bonding with carbons that is found in the compound. Hydrocarbons make up the composition of various crude oils and other gases. The production of these compounds promotes the greenhouse effect by creating holes in the ozone layer. The ozone layer is essentially used as a shield against the UV rays generated by the sun. This then causes the radiation from the sun to ultimately warm up the surface, harming biodiversity.</p>\n<p>     With transportation, there is also the issue with our road systems. For instance, when we build roads, we use asphalt that has the potential to damage the environment. Since asphalt helps with the runoff system on the roads, it has the potential to introduce pollutants into the environment.</p>\n<p>     For instance, cars with a damaged engine may end up leaking motor oil. Thus, it has potential to contaminate sources of drinking water. There is also an issue with salting our roads. During winter, roads will usually be salted to prevent roads from freezing. This in turn can cause potential harm to biodiversity, especially aquatic biodiversity. Like with potential motor oil spills, salts can also traverse into aquatic habitats and cause dead zones due to high salt concentrations.</p>\n<p><strong>How it can be improved:</strong></p>\n<p><strong>        </strong>The solutions presented will address the issue of gas emission from cars, roads, and other feasible methods of transportation.</p>\n<p>         When looking at our automobiles, energy for the car is created by an engine. The fuel used to help generate work for the car to move consists of hydrocarbons. By an exhaust hose, the excess CO2 is expelled by the car. The most logical material to replace gasoline would be another material that has the ability to combust via air. Recently, there has been research on using organic material as an alternative for gasoline. Specifically, oil derived from plants may be used as an alternative to gasoline. While CO2 would still be produced regardless, it would be lower due to CO2 being used to cultivate the plants.</p>\n<p>      This method may be hard to implement since it would be more costly and require many plants to be harvested for their oil. That said, a more realistic approach would be to limit the usage of cars and utilize public transport. However with the current situation of social distancing, it may be difficult to use public transport. That said, we should now focus on driving less and not using a car when going to a place close by.</p>\n<p>     The result of doing this would decrease the amount of Carbon Dioxide that ends up in the atomsphere. The greenhouse effect would also gradually decrease and the ozone layer would be able to heal. This would then allow for the planet’s temperature to stabilize.</p>\n<p>    With the issue of salting roads and asphalt, it would still continue to be there in the long term. However, a potential solution to this would be to build better drainage systems near forests and bodies of water to prevent runoff and salts from entering the ecosystem. This may be expensive, but has potential to prevent hazardous agents from affecting the environment.</p>\n<p> </p>",
            "image": "https://blog.thegenz.org/media/posts/19/junction-984045_1920.jpg",
            "author": {
                "name": "Ishan Vepa"
            },
            "tags": [
                   "#urban",
                   "#infrastructure",
                   "#environment"
            ],
            "date_published": "2020-07-20T09:44:00-04:00",
            "date_modified": "2020-07-20T09:44:00-04:00"
        },
        {
            "id": "https://blog.thegenz.org/why-is-racism-a-political-debate.html",
            "url": "https://blog.thegenz.org/why-is-racism-a-political-debate.html",
            "title": "Why is Racism a Political Debate?",
            "summary": "In American history, time and time again we have seen political parties shift on their thoughts and ideologies on social issues and racism is no different. In the 1860s and ’70s, it was the Republican Party leading the way in reconstruction in an attempt to&hellip;",
            "content_html": "<p class=\"msg msg--highlight  align-center\"><strong><em>In American history, time and time again we have seen political parties shift on their thoughts and ideologies on social issues and racism is no different.</em></strong></p>\n<p><span style=\"font-weight: 400;\">In the 1860s and ’70s, it was the Republican Party leading the way in reconstruction in an attempt to help the black community and lift them up coming out of the Civil War. In that time, shortly after the Civil War, former Confederate States, such as South Carolina and Mississippi, started to enact so-called “black codes” that would limit the freedoms of African Americans so that they could not vote, enacted vagrancy laws (laws that said black people must have jobs and permanent residence, and through the vagrancy laws “labor contracts” would be legalized which would institutionalize a second form of slavery. The people who enacted these laws were white Southerners and Ex-Confederates that pushed these black codes. These white southerners would also go on to constitute the “Solid South”, which was when the Democratic Party rose to popularity in the South in response to the Republicans that controlled them in the North. (Sources 1-4, I highly recommend reading them for further information on American history. If we do not learn about the past it is bound to repeat itself.)</span></p>\n<p><span style=\"font-weight: 400;\">The Democratic Party is also the same party whose presidents in the 60’s advocated for Civil Rights and signed into law the 1964 Civil Rights act. </span></p>\n<p><span style=\"font-weight: 400;\">And there are examples upon examples where I could give where both political parties have been on the right and wrong side of the history of Civil Rights for African Americans in this country. Clearly, in America, politics has played a huge role in either enabling or eradicating racism in America. </span></p>\n<p class=\"msg msg--highlight \"><strong><em>I must ask the question, why do we make racism a political debate?</em> </strong></p>\n<p><span style=\"font-weight: 400;\">In history, it can be clearly seen that both political parties are ever-changing in their efforts in either enabling or eradicating racism, so why do we hold so dearly to these flimsy and altering political doctrines of both of our political parties?</span></p>\n<p><span style=\"font-weight: 400;\">It has to do with the simple nature of political parties and our government. That is that these things, these political parties, are social constructs. A social construct defined by Merriam-Webster is “</span><span style=\"font-weight: 400;\">an idea that has been created and accepted by the people in a society” (Source 5). Basically, this means a political party is a group of people in the same society that share the same ideals of how our government (which is also a social construct) should be run. Thus, when they come to a general consensus on their ideals, they will deem themselves a “political party”. </span></p>\n<p><span style=\"font-weight: 400;\">A political party exists because society exists, and society exists because people with ideals and ideas exist. A political party is not like a book. Whether or not a person says a book exists or not it will nonetheless continue to exist in reality. But society could all of a sudden say a political party does not exist and it would cease to exist. </span></p>\n<p><span style=\"font-weight: 400;\">Political parties, being that they are social constructs, are very reliant and susceptible to society. But once the political party or social construct becomes so ingrained in one’s society, this leads to prideful people not willing to put their foot down and disagree with their party. This can be owed to a myriad of factors, but one reason may be that people love to feel like they are “for a cause” and “in power”. This, in the end, leads to pride in one’s party that blinds the person to not being able to see and listen to other political perspectives.</span></p>\n<p class=\"msg msg--highlight \"><em><strong>As well, in our American society, we have a very racist past that has manifested itself into systemic and structural racism. In America, in all honesty, we have a society in which hate for people is very prevalent. </strong></em></p>\n<p><span style=\"font-weight: 400;\">Racism can be and is expressed in a variety of ways, as just mentioned as systemic and structural for example. However, we must remember where racism comes from and what it is at its core. Racism is hate, and hate originates from the ideals and ideas of people. The same people who can make up a society and can create social constructs.</span></p>\n<p><span style=\"font-weight: 400;\">And this is where the danger lies. We have political parties that are created by a society that has 100s of years of hate and racism, and for some reason, we irresponsibly think that a social construct, which is created by society as previously said, is not influenced by 100s of years of a racist and hateful past, and I will contend present as well. Then we become so prideful in sticking to our political party’s ideologies that we begin to argue over the very nature of whether or not racism is prevalent in our society when it very much is. We become so entrenched in our political party’s doctrine and ideology that we become too prideful to put our foot down and say “This is enough”.</span></p>\n<p><span style=\"font-weight: 400;\">This is what leads to things like conservatives saying “All Lives Matter” in opposition to Black Lives Matter and Democrats saying “All Cops are Bad” when there are a great number of people out there that represent that badge with integrity, honor, and most importantly love for one’s community. </span></p>\n<p class=\"msg msg--highlight  align-center\"><em><strong>It is important to remember that we should not generalize people, no matter if they are Republican or Democrat. We should treat each person as an individual.</strong></em></p>\n<p><span style=\"font-weight: 400;\">However, I point all of this out because the purpose in saying all this is not to generalize Republicans or Democrats, but is to call out these infectious political doctrines and how they are imbuing, injecting, and infecting dangerous and hateful ideals into people. </span></p>\n<p><span style=\"font-weight: 400;\">We have become so prideful in our political affiliations we are not willing to say, “Black Lives Matter”, and we are not willing to say there are many good cops as well. We blindly pledge our allegiance to social constructs that have been indecisive on whether or not they want to enable or eradicate racism. </span></p>\n<p><span style=\"font-weight: 400;\">It is time we put aside our pride and political affiliations and all come together and admit that racism is very real. And that healing must not start with politics, but with our own minds, our own hearts. We need to create a society in which we remember our hateful past as a lesson to never go back there, we renounce these past hateful ways and stop glorifying our hate (stop glorifying Confederate leaders/statues) in the present, and live for a hopeful future filled with justice for all. </span></p>\n<p><span style=\"font-weight: 400;\">Maybe then we can build social constructs that are unwavering on their promise to eradicate racism on a society filled with hope for a future full of justice, not on a society full of a hateful past. </span></p>\n<hr>\n<p class=\"align-center\"><em>Citations</em></p>\n<ol>\n<li><span style=\"font-weight: 400;\"> Constitutional Rights Foundation. “Southern Black Codes”. Constitutional Rights Foundation, </span><span style=\"font-weight: 400;\"><a href=\"https://www.crf-usa.org/brown-v-board-50th-anniversary/southern-black-codes.html\">https://www.crf-usa.org/brown-v-board-50th-anniversary/southern-black-codes.html</a><br><br><a href=\"https://www.crf-usa.org/brown-v-board-50th-anniversary/southern-black-codes.html\"></a></span></li>\n<li><span style=\"font-weight: 400;\"> Foner, Eric. “Reconstruction”. Britannica Encyclopædia, April 3, 2020, </span><span style=\"font-weight: 400;\"><a href=\"https://www.britannica.com/event/Reconstruction-United-States-history/The-end-of-Reconstruction\">https://www.britannica.com/event/Reconstruction-United-States-history/The-end-of-Reconstruction</a><br><br><a href=\"https://www.britannica.com/event/Reconstruction-United-States-history/The-end-of-Reconstruction\"></a></span></li>\n<li><span style=\"font-weight: 400;\"> Gustainis, J. Justin. “Solid South”. </span><i><span style=\"font-weight: 400;\">Dictionary of American History</span></i><span style=\"font-weight: 400;\">, found on Encyclopedia.com, entry on the website updated on May 27, 2020, </span><a href=\"https://www.encyclopedia.com/history/united-states-and-canada/us-history/solid-south\"><span style=\"font-weight: 400;\">https://www.encyclopedia.com/history/united-states-and-canada/us-history/solid-south</span></a></li>\n</ol>\n<ol start=\"4\">\n<li><a href=\"https://www.britannica.com/editor/The-Editors-of-Encyclopaedia-Britannica/4419\"><span style=\"font-weight: 400;\">The Editors of Encyclopaedia Britannica</span></a><span style=\"font-weight: 400;\">. “Black Code”.Britannica Encyclopædia, August 20, 2019, </span><span style=\"font-weight: 400;\"><a href=\"https://www.britannica.com/topic/black-code\">https://www.britannica.com/topic/black-code</a><br><br><a href=\"https://www.britannica.com/topic/black-code\"></a></span></li>\n<li>“Social Construct”. Merriam Webster, <a href=\"https://www.merriam-webster.com/dictionary/social%20construct\" style=\"font-family: var(--font-base); font-size: inherit; font-weight: var(--font-weight-normal);\">https://www.merriam-webster.com/dictionary/social%20construct</a><span style=\"font-weight: 400;\">, Accessed June 13, 2020</span></li>\n</ol>",
            "image": "https://blog.thegenz.org/media/posts/18/henry-be-4KDngW9vWwo-unsplash.jpg",
            "author": {
                "name": "Ishan Vepa"
            },
            "tags": [
                   "#society",
                   "#inequality",
                   "#community",
                   "#blacklivesmatter",
                   "#BLM"
            ],
            "date_published": "2020-07-20T09:44:00-04:00",
            "date_modified": "2020-07-20T09:44:00-04:00"
        },
        {
            "id": "https://blog.thegenz.org/systemic-racism-in-healthcare.html",
            "url": "https://blog.thegenz.org/systemic-racism-in-healthcare.html",
            "title": "Systemic Racism in Healthcare",
            "summary": "On May 25, 2020, George Floyd, a 46-year-old black man, was killed by a Minneapolis police officer who already had 18 previous complaints regarding excessive force. Derek Chauvin, the police officer, pressed his knee into the complying and already handcuffed George Floyd, killing him. This&hellip;",
            "content_html": "<p class=\"msg msg--highlight  align-center\"><em><strong>On May 25, 2020, George Floyd, a 46-year-old black man, was killed by a Minneapolis police officer who already had 18 previous complaints regarding excessive force. Derek Chauvin, the police officer, pressed his knee into the complying and already handcuffed George Floyd, killing him.</strong></em></p>\n<hr>\n<p>This murder has had a profound impact on the United States and numerous other nations where protests have been going on for weeks. The Black Lives Matter movement has gained traction as individuals across the globe have decided enough is enough and that change needs to happen.</p>\n<p>No matter what your stance is on this major issue, it has unarguably started a wider conversation on systemic racism and how our society has subtly and not so subtly allowed for racism to continue in the United States. Since this discussion hit its boiling point with the unethical treatment of Floyd, the discussion about systemic racism has been primarily centered around the justice system, and the political climate of the United States. This discussion about the justice system has been very controversial. One area in which systemic racism has been recognized by nearly everyone in the field is in public health and safety, even more specifically the roots of modern-day medicine.</p>\n<p class=\"msg msg--highlight  align-center\">Medical professionals have a very unique perspective: people go to them for help, and as people in a position of power, patients are likely to take their advice and trust them.</p>\n<p><span style=\"color: var(--text-editor-body-color); font-family: var(--font-base); font-size: inherit; font-weight: var(--font-weight-normal);\">This unique and important relationship that medical professionals have with their patients is really a delicate balance in which doctors have an ethical duty to help individuals no matter their race, personal beliefs, and sexual orientation. In modern times, discrimination against people of color still occurs and this might have something to do with the roots of medicine and misconceptions that have been spread.</span></p>\n<p>One of the more obvious cases of discrimination against people of color dates back to 1932 during the Tuskegee Experiment. The purpose of this experiment was to see the effects of untreated syphilis on the human body, however, black men were used as the test subjects for this experiment. Out of the 600 black men that took part at the beginning of the experiment. The 399 men with syphilis were not told of their status and were only told that they were being treated for “bad blood” (a phrase that was often used to describe numerous illnesses.) These men did not know they were ill with syphilis and were told that they were being cured when in reality they were only given placebos such as aspirin. Many men passed it to family members because they were not told of their status. Because the study was to see the effects of untreated syphilis many participants suffered from side effects, such as blindness, insanity, and death.</p>\n<p>The men were told that the experiment would only last six months but it went on for an additional 40 years without the men even being fully aware of their diagnosis. Researchers even continued the experiment despite knowing that in 1947, penicillin was a common treatment for syphilis. In the 1960s, a disease detective known as Peter Buxton recognized the unethical treatment that was going on and brought it to the attention of a public health services board that ultimately allowed the study to continue until all patients died. Buxton leaked the story and by doing so he was able to get the study shut down. Congress recognized the issue and paid 10 million dollars for an out of court settlement with survivors.</p>\n<p>The government has tried to make amends with victims and family members. However, this did not change the little trust that African Americans had with the public health system. It is apparent how little was done for the black community as the first public apology from a U.S. official was from Bill Clinton in 1997 when he announced the creation of Tuskegee University’s National Center for Bioethics in Research and Health Care. This might be the most apparent instance of discrimination against people of color but there are certainly dozens more which are reflected in the high mortality rates people of color face when in medical care. A 2016 study done on medical students showed that nearly 50 percent of medical students and residents believed there were biological differences between white and black people and that black people feel less pain because they have “thicker skin.” Black women are four times more likely to die during childbirth than white women and black people are 22% less likely to receive proper pain management medication.</p>\n<p>A lot has been going on in recent weeks and it is very important for us to do our research and learn about these disparities that have been going on for centuries in our country.</p>",
            "image": "https://blog.thegenz.org/media/posts/17/Cover_grace.png",
            "author": {
                "name": "Ishan Vepa"
            },
            "tags": [
                   "#society",
                   "#inequality",
                   "#healthcare",
                   "#community",
                   "#blacklivesmatter",
                   "#BLM"
            ],
            "date_published": "2020-07-20T09:44:00-04:00",
            "date_modified": "2020-07-20T09:44:00-04:00"
        },
        {
            "id": "https://blog.thegenz.org/sanity.html",
            "url": "https://blog.thegenz.org/sanity.html",
            "title": "Sanity",
            "summary": "In light of the recent outbreak of the novel coronavirus, COVID-19, many governments and researchers have recommended that people practice social distancing. As defined by John Hopkins Medicine, “Social Distancing is deliberately increasing the physical space between people to avoid spreading illness.” Please follow the&hellip;",
            "content_html": "<p><span style=\"font-weight: 400;\">In light of the recent outbreak of the novel coronavirus, COVID-19, many governments and researchers have recommended that people practice social distancing.</span></p>\n<hr>\n<p><span style=\"font-weight: 400;\">As defined by </span><a href=\"https://www.hopkinsmedicine.org/health/conditions-and-diseases/coronavirus/coronavirus-social-distancing-and-self-quarantine\"><span style=\"font-weight: 400;\">John Hopkins Medicine</span></a><span style=\"font-weight: 400;\">, “Social Distancing </span><span style=\"font-weight: 400;\">is deliberately increasing the physical space between people to avoid spreading illness.” Please follow the guidelines</span><span style=\"font-weight: 400;\"> outlined </span><a href=\"https://www.cdc.gov/coronavirus/2019-ncov/prevent-getting-sick/prevention.html\"><span style=\"font-weight: 400;\">here</span></a> <span style=\"font-weight: 400;\">by the Center for Disease Control and Prevention (CDC) to help prevent the spread of sickness. In these trying times, it becomes easy to lose ourselves to anxiety and loneliness. Many of us or our loved ones may struggle with mental health illnesses. </span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">The CDC has developed a </span><a href=\"https://www.cdc.gov/coronavirus/2019-ncov/daily-life-coping/managing-stress-anxiety.html?CDC_AA_refVal=https%3A%2F%2Fwww.cdc.gov%2Fcoronavirus%2F2019-ncov%2Fprepare%2Fmanaging-stress-anxiety.html\"><span style=\"font-weight: 400;\">page</span></a><span style=\"font-weight: 400;\"> filled with tips for how to maneuver mental health during this pandemic, but the two aspects I am focusing on here are loneliness as a symptom and skin hunger. Loneliness is often a symptom of mental disorders such as depression, but can often be the most harmful symptom. In an </span><a href=\"https://www.ncbi.nlm.nih.gov/pubmed/25910392\"><span style=\"font-weight: 400;\">analytic review</span></a><span style=\"font-weight: 400;\"> at Brigham Young University, researchers concluded that loneliness can reduce immunity, increase inflammation, and spur heart disease. During a time where a virus seems to target elder and weaker people, loneliness will only do more damage. </span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">This goes hand-in-hand (Socially Distanced hands) with another aspect of mental health: skin hunger. While skin hunger hasn’t been researched as widely, we do know a few things. Some people crave human touch, even as much as a handshake or a hug. Day to day proceedings often brush over these basic touches, but due to social distancing, people have started to feel the effects of these cravings. Isolation and loneliness only add to the troubles, and combined, can lead to depression. Research shows that skin hunger can also lead to more troubling illnesses such as alexithymia, a condition which stops people from interpreting or feeling emotions. </span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">So what can we, as social beings, do to help? </span></p>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Use video chatting! Call your family, friends, neighbors and just talk. Remind them that you care.</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Write letters! Letters are personal and can help convey a lot of emotion.</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Prepare meals to share! Make sure the meal can be microwaved for at least a few seconds to kill any potential trace virus.</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Send pictures and tips! Sending tips and pictures of what you’re doing throughout the day can make someone feel like they’re interacting alongside you.</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Share an article! Articles like this help spread the word and can help save lives</span></li>\n</ul>\n<p> </p>\n<p><span style=\"font-weight: 400;\">Don’t be afraid to reach out to a loved one. Even just a simple check-in might make someone’s day, and in pressing times like these, we cannot afford to leave anyone behind.</span></p>",
            "image": "https://blog.thegenz.org/media/posts/16/social_distancing04-01.jpg",
            "author": {
                "name": "Ishan Vepa"
            },
            "tags": [
                   "#socialdistancing",
                   "#covid19",
                   "#coronavirus"
            ],
            "date_published": "2020-07-20T09:44:00-04:00",
            "date_modified": "2020-07-20T09:44:00-04:00"
        }
    ]
}
